/*
 * -------------------------------------------------------------
 *  Generated by: SDK Generator
 *  Author      : projectilegravity & 48ix
 *  Timestamp   : 2026-06-28 15:40:30
 *  Game        : Fortnite
 *  Version     : ++Fortnite+Release-41.10-CL-55227503
 *  File        : sdk_replication.h
 * -------------------------------------------------------------
 */

#pragma once
#include <cstdint>


struct FortPawnComponent_ZiplineDeployer
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	float CurrentHeightAboveWorld; // 0xf8 [Size: 0x4]
};


struct UWindSplineComponent
{
public:
	uint8_t pad_0[0xd40]; // 0x0
	FWindSplineTargetData TargetData; // 0xd40 [Size: 0x78]
	FWindSplineBlockageArray Blockages; // 0xdb8 [Size: 0x58]
};


struct UVoteBroadcasterComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FVoteSessionRuntimeArray VoteSessionRuntimeList; // 0x100 [Size: 0x60]
	FVoteRuntimeArray VoteRuntimeList; // 0x160 [Size: 0x60]
	FVoteSelectionResultsArray VoteResultsList; // 0x1c0 [Size: 0x60]
};


struct UVoteResponderComponent
{
public:
	uint8_t pad_0[0x1a0]; // 0x0
	TArray<FVoteSelection> SupportedVoteSelections; // 0x1a0 [Size: 0x10]
	bool bShouldLockVotingAfterCasted : 1; // 0x1b0 [Mask: 0x1] [Bit: 0]
};


struct AVividRazorVaultDoor
{
public:
	uint8_t pad_0[0x928]; // 0x0
	bool bDoorOpened : 1; // 0x928 [Mask: 0x1] [Bit: 0]
	uint8_t pad_929[0xb7]; // 0x929
	TArray<FVaultWeakPointRuntime> WeakPoints; // 0x9e0 [Size: 0x10]
};


struct FortChargingSet_SlapCannon
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct UVerseDynamicUIPanel
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FVerseDynamicUISceneList ActiveScenes; // 0xe0 [Size: 0x60]
	UIAllowedWidgetList ReplicatedWidgetList; // 0x140 [Size: 0x60]
};


struct UVerseScreenshotTestRequestComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FScreenshotTestRequestDetails ScreenshotTestRequestDetails; // 0xc0 [Size: 0x18]
};


struct UWidgetComponentImplementation
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FString WidgetName; // 0x30 [Size: 0x10]
};


struct UVerseFortniteUIFrameworkButton_Base
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FLocalizableMessage Message; // 0xf0 [Size: 0x30]
	UInputAction* TriggeringInputAction; // 0x120 [Size: 0x20]
};


struct UVerseFortniteUIFrameworkSlider
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FVerseFortniteUIFrameworkSliderValue Value; // 0xe0 [Size: 0xc]
	float MinValue; // 0xec [Size: 0x4]
	float MaxValue; // 0xf0 [Size: 0x4]
	float StepSize; // 0xf4 [Size: 0x4]
};


struct ExecConsoleCommandOnClientActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FString ConsoleCommand; // 0x270 [Size: 0x10]
};


struct AScreenshotActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FString ScreenshotName; // 0x270 [Size: 0x10]
};


struct UHurdleComponent
{
public:
	uint8_t pad_0[0xb48]; // 0x0
	FReplicatedHurdleTargetingData ReplayHurdleTargetingData; // 0xb48 [Size: 0x70]
};


struct UPlayspaceComponent_EditConnectionManager
{
public:
	uint8_t pad_0[0x1d8]; // 0x0
	int EditConnections; // 0x1d8 [Size: 0x4]
	enum EVkEditStatus VkEditStatus; // 0x1dc [Size: 0x1]
};


struct FortLiquidGunProjectile
{
public:
	uint8_t pad_0[0xb80]; // 0x0
	FVector_NetQuantize RandomDetachmentAngleFirstHalf; // 0xb80 [Size: 0x18]
	FVector_NetQuantize RandomDetachmentAngleSecondHalf; // 0xb98 [Size: 0x18]
	uint8_t pad_bb0[0x2]; // 0xbb0
	enum ELiquidRibbonDetachmentReason DetachmentReason; // 0xbb2 [Size: 0x1]
};


struct Umbramolt_KipperAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData DamageMultiplier; // 0x30 [Size: 0x28]
};


struct FortTrainManager
{
public:
	uint8_t pad_0[0x220]; // 0x0
	float DefaultConnectorLength; // 0x220 [Size: 0x4]
	float BaseMoveSpeed; // 0x224 [Size: 0x4]
	uint8_t pad_228[0x140]; // 0x228
	FortTrainRail* Rail; // 0x368 [Size: 0x8]
	TArray<FTrainCarRuntimeData> Cars; // 0x370 [Size: 0x10]
	uint8_t pad_380[0x1c]; // 0x380
	FTrainMovementData ReplicatedMovementData; // 0x39c [Size: 0x1c]
};


struct AToyFoxGiantPlayerPawn
{
public:
	uint8_t pad_0[0x5da9]; // 0x0
	bool bWaitingForDestroyed : 1; // 0x5da9 [Mask: 0x1] [Bit: 0]
};


struct FortPawnComponent_TetheredMovement
{
public:
	uint8_t pad_0[0x118]; // 0x0
	FReplicatedRopeData ReplicatedRopeData; // 0x118 [Size: 0x28]
};


struct ATheShapeGameplayVolume
{
public:
	uint8_t pad_0[0x338]; // 0x0
	FortPawn* RelevantPlayer; // 0x338 [Size: 0x8]
	double NextLookAtPlayerServerTimestamp; // 0x340 [Size: 0x8]
	uint8_t pad_348[0x250]; // 0x348
	FGameplayTag StyleTag; // 0x598 [Size: 0x4]
	bool RescuedShapeActivating : 1; // 0x59c [Mask: 0x1] [Bit: 0]
};


struct FortActorComponent_TargetedBeam
{
public:
	uint8_t pad_0[0x2d0]; // 0x0
	FTargetedBeamData BeamData; // 0x2d0 [Size: 0x88]
};


struct ABuildingGameplayActorSupplyDropRadio
{
public:
	uint8_t pad_0[0x99c]; // 0x0
	float DistanceFromOriginalSpawnLocForBalloonOpen; // 0x99c [Size: 0x4]
	enum ESupplyDropRadioBalloonState BalloonState; // 0x9a0 [Size: 0x1]
	uint8_t pad_9a1[0xff]; // 0x9a1
	bool bMoving : 1; // 0xaa0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_aa1[0x3]; // 0xaa1
	float FallSpeed; // 0xaa4 [Size: 0x4]
	float BalloonOpenedFallSpeed; // 0xaa8 [Size: 0x4]
	float GravityMultiplier; // 0xaac [Size: 0x4]
	FVector ServerLocation; // 0xab0 [Size: 0x18]
	float ClientLocationCorrectionMaxDistSqWhenBalloonDisabled; // 0xac8 [Size: 0x4]
	float ClientLocationCorrectionMaxDistSqWhenBalloonEnabled; // 0xacc [Size: 0x4]
};


struct UTempestTornadoForcesComponent
{
public:
	uint8_t pad_0[0x1e0]; // 0x0
	FTornadoClientSimulationArray ActorsToClientSimulate; // 0x1e0 [Size: 0x58]
};


struct UTempestMovementComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FTempestReplicatedMovementData MovementData; // 0xc0 [Size: 0x50]
};


struct UTempestStateMachineComponent
{
public:
	uint8_t pad_0[0x140]; // 0x0
	FTempestStateInfo CurrentStateInfo; // 0x140 [Size: 0xc]
};


struct FortPawnComponent_WingedFlying
{
public:
	uint8_t pad_0[0xd4]; // 0x0
	float NativeCurrentHeightAboveWorld; // 0xd4 [Size: 0x4]
	float CurrentFlyingEnergy; // 0xd8 [Size: 0x4]
};


struct FortChargingSet_SunroseDash
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData CurrentCharges; // 0x30 [Size: 0x28]
};


struct FortAthenaMutator_SplitStorm
{
public:
	uint8_t pad_0[0x510]; // 0x0
	Actor* SafeZoneProxy; // 0x510 [Size: 0x8]
	enum ESplitStormProxyPhase CurrentProxyPhase; // 0x518 [Size: 0x1]
	uint8_t pad_519[0x57]; // 0x519
	FSplitStormProxyCircle ProxyHoldCircle; // 0x570 [Size: 0x20]
	FSplitStormProxyCircle CurrentProxyCircle; // 0x590 [Size: 0x20]
};


struct UOnlinePollMeshNetUplinkComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	FSproutOnlinePollRootTallyFastArray PollTallies; // 0xf8 [Size: 0x60]
};


struct USproutGameStateComponent_OnlinePoll
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	FSproutOnlinePollTallyFastArray DedicatedTallies; // 0xf8 [Size: 0x60]
	uint8_t pad_158[0x38]; // 0x158
	bool bIsPollingAvailable : 1; // 0x190 [Mask: 0x1] [Bit: 0]
};


struct USproutCanvasComponent
{
public:
	uint8_t pad_0[0x248]; // 0x0
	FSproutCanvasDesign CanvasDesign; // 0x248 [Size: 0x30]
	Actor* CanvasDesignOwner; // 0x278 [Size: 0x8]
	uint8_t pad_280[0x10]; // 0x280
	Actor* CanvasEditor; // 0x290 [Size: 0x8]
};


struct USproutCanvasPlayerComponent
{
public:
	uint8_t pad_0[0x168]; // 0x0
	TArray<FSproutCanvasDesign> SavedDesigns; // 0x168 [Size: 0x10]
};


struct ASproutGameplayActor
{
public:
	uint8_t pad_0[0x320]; // 0x0
	FortAbilitySystemComponent* ReplicatedAbilitySystemComponent; // 0x320 [Size: 0x8]
	uint8_t pad_328[0x18]; // 0x328
	FGuid SavedActorGuid; // 0x340 [Size: 0x10]
	UItemDefinitionBase* AssociatedItem; // 0x350 [Size: 0x8]
};


struct ASproutHousingGameplayVolume
{
public:
	uint8_t pad_0[0x390]; // 0x0
	FLotOwnershipInfo LotOwnershipInfo; // 0x390 [Size: 0x48]
	uint8_t pad_3d8[0x88]; // 0x3d8
	FGuid RegisteredLevel; // 0x460 [Size: 0x10]
	uint8_t pad_470[0xc0]; // 0x470
	int CurrentDecorCount; // 0x530 [Size: 0x4]
};


struct UDollHouseSpawnerComponent
{
public:
	uint8_t pad_0[0x2e8]; // 0x0
	Actor* SpawnedNPC; // 0x2e8 [Size: 0x8]
	FDollHouseSpawnerSaveData PersistentSpawnerData; // 0x2f0 [Size: 0x40]
};


struct FortGameStateComponent_SproutHousing
{
public:
	uint8_t pad_0[0x130]; // 0x0
	FSproutHousingStreamingLevelFastArray InjectedLevels; // 0x130 [Size: 0x60]
	uint8_t pad_190[0x40]; // 0x190
	FSproutHousingLotOwnershipFastArray SproutHousingLotOwnershipArray; // 0x1d0 [Size: 0x60]
};


struct UPlayspaceComponent_Root_SproutJobManagement
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FSproutActiveJobDataFastArray ActiveJobDataArray; // 0x128 [Size: 0x60]
	uint8_t pad_188[0x38]; // 0x188
	TArray<FReplicatedJobVolumeData> ReplicatedJobVolumeEntries; // 0x1c0 [Size: 0x10]
	uint8_t pad_1d0[0x18]; // 0x1d0
	FGameplayTagContainer CurrentBoostedJobs; // 0x1e8 [Size: 0x20]
	uint8_t pad_208[0x128]; // 0x208
	bool bIsJobXPEnabled : 1; // 0x330 [Mask: 0x1] [Bit: 0]
};


struct USproutActorComponent_ActivityState
{
public:
	uint8_t pad_0[0x140]; // 0x0
	FSproutActorComponent_ActivityStateConfigurationCategoryRuntime CurrentStateConfigurationRuntime; // 0x140 [Size: 0x10]
};


struct USproutActorComponent_ItemRecipient
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	UItemDefinitionBase* GoalItem; // 0xd0 [Size: 0x20]
	FGameplayTagContainer GoalItemTags; // 0xf0 [Size: 0x20]
};


struct USproutActorComponent_Requests
{
public:
	uint8_t pad_0[0x1c8]; // 0x0
	FSproutRequestRuntime RunningRequest; // 0x1c8 [Size: 0x14]
};


struct USproutConnectivityManagerDebugComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	USproutConnectivityManagerComponent* ManagerComponent; // 0xc0 [Size: 0x8]
	FJunoConnectivityDebugData DebugDrawData; // 0xc8 [Size: 0x38]
};


struct USproutControllerComponent_AccountItemsUnlock
{
public:
	uint8_t pad_0[0x160]; // 0x0
	TArray<FGameplayTag> ReplicatedMcpOwnershipTags; // 0x160 [Size: 0x10]
};


struct USproutControllerComponent_Collections
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FSproutCollectionsFastArray AllCollections; // 0xd0 [Size: 0x78]
};


struct USproutControllerComponent_Housing
{
public:
	uint8_t pad_0[0x194]; // 0x0
	FPlayerHousingClaim CurrentHousingClaim; // 0x194 [Size: 0x2c]
	uint8_t pad_1c0[0x18]; // 0x1c0
	TArray<FPlayerHousingSlot> HousingSlots; // 0x1d8 [Size: 0x10]
	uint8_t pad_1e8[0x8]; // 0x1e8
	TArray<FSessionHouseReaction> SessionHouseReactionList; // 0x1f0 [Size: 0x10]
};


struct USproutControllerComponent_InventoryOverflow
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FSproutOverflowInventoryFastArray OverflowInventory; // 0x128 [Size: 0x60]
};


struct USproutControllerComponent_NeighborhoodInfo
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	bool bIsMemberOfNeighborhood : 1; // 0xe8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_e9[0x3]; // 0xe9
	FGuid HomeNeighborhoodId; // 0xec [Size: 0x10]
	uint8_t pad_fc[0x4]; // 0xfc
	FSproutNeighborhoodKnowledgeFastArray NeighborhoodKnowledge; // 0x100 [Size: 0x60]
};


struct USproutControllerComponent_PersistedUnlocks
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	bool bAllItemsAreUnlocked : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c9[0x7]; // 0xc9
	TArray<FPrimaryAssetId> TrackedPersistedUnlockItems; // 0xd0 [Size: 0x10]
	TArray<FPrimaryAssetId> TrackedTransientUnlockItems; // 0xe0 [Size: 0x10]
};


struct USproutControllerComponent_Roommates
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	TArray<UniqueNetIdRepl> MyRoommatesList; // 0xf8 [Size: 0x10]
	uint8_t pad_108[0x18]; // 0x108
	TArray<UniqueNetIdRepl> RoommateInvitesList; // 0x120 [Size: 0x10]
};


struct USproutEventManager
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	FSproutActiveEventArray EventArray; // 0xe8 [Size: 0xa0]
};


struct USproutGameStateComponent_DollHouse
{
public:
	uint8_t pad_0[0x110]; // 0x0
	TArray<FSproutDollHouseSaveDataPerPlayer> TemporarySaveDataPerPlayer; // 0x110 [Size: 0x10]
	FSproutDollHouseSlotConfigurationOptions ReplicatedDigestedPossibleOptions; // 0x120 [Size: 0x120]
	bool bIsPersistentStateInitialized : 1; // 0x240 [Mask: 0x1] [Bit: 0]
};


struct USproutGameStateComponent_NeighborhoodHousing
{
public:
	uint8_t pad_0[0x138]; // 0x0
	TArray<FNeighborhoodHousingSlot> HousingSlots; // 0x138 [Size: 0x10]
};


struct USproutGameStateComponent_NeighborhoodManager
{
public:
	uint8_t pad_0[0x140]; // 0x0
	TArray<UniqueNetIdRepl> MemberList; // 0x140 [Size: 0x10]
	FGuid NeighborhoodId; // 0x150 [Size: 0x10]
	FSproutNeighborhoodDescription CurrentDescription; // 0x160 [Size: 0x20]
};


struct USproutGameStateComponent_NeighborhoodThemes
{
public:
	uint8_t pad_0[0xd4]; // 0x0
	FGameplayTag ActiveTheme; // 0xd4 [Size: 0x4]
};


struct USproutGameStateComponent_Requests
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	TArray<FSproutAllRequestsPerCategory> PerCategoryRequestsDataDigested; // 0xd0 [Size: 0x10]
};


struct USproutJobTrackerComponent
{
public:
	uint8_t pad_0[0x110]; // 0x0
	ASproutJobVolume* EnclosingJobVolume; // 0x110 [Size: 0x8]
};


struct USproutJobWorkerStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FGameplayTagContainer CurrentJobTags; // 0xc0 [Size: 0x20]
	FSproutJobTask CurrentJobTask; // 0xe0 [Size: 0x70]
	uint8_t pad_150[0x78]; // 0x150
	bool bIsJobTaskCooldownActive : 1; // 0x1c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1c9[0x47]; // 0x1c9
	FSproutJobProgressionFastArray JobProgressionArray; // 0x210 [Size: 0x60]
	uint8_t pad_270[0x80]; // 0x270
	bool bIsPersistentStateInitialized : 1; // 0x2f0 [Mask: 0x1] [Bit: 0]
};


struct USproutNPCPawnComponent
{
public:
	uint8_t pad_0[0x148]; // 0x0
	FSproutNPCPawnComponent_DollHouseData DollHouseData; // 0x148 [Size: 0xc0]
};


struct USproutPlayerStateComp_Neighborhood
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FGuid HomeNeighborhoodId; // 0xd0 [Size: 0x10]
};


struct USproutPlayerStateComponent_Bounties
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	TArray<FSproutJobTask> CurrentDailyBounties; // 0xf0 [Size: 0x10]
	uint8_t pad_100[0x20]; // 0x100
	TArray<FSproutJobTask> CurrentEventBounties; // 0x120 [Size: 0x10]
	uint8_t pad_130[0x20]; // 0x130
	FGameplayTagContainer ClaimableBounties; // 0x150 [Size: 0x20]
	FGameplayTag PinnedBountyID; // 0x170 [Size: 0x4]
};


struct UZeroPointSpriteAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData CurrentCharges; // 0x30 [Size: 0x28]
};


struct USpriteBackpackController
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	bool bServerHiddenState : 1; // 0xd8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d9[0x7]; // 0xd9
	FBackpackData ReplicatedBackpackData; // 0xe0 [Size: 0x18]
};


struct USpriteNavigationHelperComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	Object* ClosestDiscoverable; // 0x118 [Size: 0x8]
};


struct FortPlayerStateComponent_SpriteExtractionPersistence
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FortPlayerController* OwningController; // 0x128 [Size: 0x8]
	ExtractableItemPersistenceDataArray ReplicatedSpriteData; // 0x130 [Size: 0x20]
	uint8_t pad_150[0x100]; // 0x150
	FPostMatchExtractionData ClientExtractionMatchData; // 0x250 [Size: 0x58]
	bool bFinalDataFlushed : 1; // 0x2a8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2a9[0x97]; // 0x2a9
	TArray<ExtractionOperation> AllMatchExtractions; // 0x340 [Size: 0x10]
};


struct FortLWPPredictionComponent
{
public:
	uint8_t pad_0[0x190]; // 0x0
	enum EFortLWPPredictionState CurrentState; // 0x190 [Size: 0x1]
};


struct UMajorSpireGameplayComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FGameplayTag CurrentState; // 0xe0 [Size: 0x4]
};


struct ASourForkPlayerPawn
{
public:
	uint8_t pad_0[0x5d78]; // 0x0
	FRotator CurrentBeamRotation; // 0x5d78 [Size: 0x18]
	uint8_t pad_5d90[0x1]; // 0x5d90
	bool bIsIntroAnimStateExit : 1; // 0x5d91 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_SonicSpear
{
public:
	uint8_t pad_0[0x3d0]; // 0x0
	FReplicatedSonicSpearZoneArray ReplicatedActiveZones; // 0x3d0 [Size: 0x60]
};


struct ASonicSpearZone
{
public:
	uint8_t pad_0[0x4fc]; // 0x0
	float Radius; // 0x4fc [Size: 0x4]
};


struct USidewaysStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum ESidewaysState SidewaysState; // 0xc0 [Size: 0x1]
	uint8_t pad_c1[0x7]; // 0xc1
	ASidewaysPlayspace* SidewaysPlayspace; // 0xc8 [Size: 0x8]
};


struct USevenSlideAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData MaxFuel; // 0x38 [Size: 0x28]
	FortGameplayAttributeData Fuel; // 0x60 [Size: 0x28]
};


struct FortScubaBondOak_LightningTrail
{
public:
	uint8_t pad_0[0x950]; // 0x0
	FortSplinePointInsertionData CurrentPointInsertionData; // 0x950 [Size: 0x100]
};


struct FortScoutDrone
{
public:
	uint8_t pad_0[0x6b8]; // 0x0
	bool bIsSpeedBoosting : 1; // 0x6b8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_6b9[0x97]; // 0x6b9
	FortPawn* ControllingPlayerPawn; // 0x750 [Size: 0x8]
};


struct FortChargingSet_ScoutDroneEnergy
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Energy; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxEnergy; // 0x70 [Size: 0x28]
	FortGameplayAttributeData EnergyChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeEnergyIncrements; // 0xc0 [Size: 0x28]
};


struct FortGameplayAbility_ScoutDrone_PassiveMark
{
public:
	uint8_t pad_0[0xb40]; // 0x0
	FScoutDroneStatusData CurrentTargetStatus; // 0xb40 [Size: 0x8]
};


struct FortScoutDroneControllingComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FortScoutDrone* ControlledDrone; // 0x100 [Size: 0x8]
	uint8_t pad_108[0xd8]; // 0x108
	FScoutDroneDeferredDestructionData CurrentDestructionData; // 0x1e0 [Size: 0x10]
};


struct FortScoutDroneMovementComponent
{
public:
	uint8_t pad_0[0x1018]; // 0x0
	FVector ReplicatedAcceleration; // 0x1018 [Size: 0x18]
};


struct FortScoutDronePickupManager
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FScoutDronePickupTargets AttachedTargets; // 0xc0 [Size: 0x18]
};


struct FortHestiaTrainerMannequin
{
public:
	uint8_t pad_0[0x9b0]; // 0x0
	bool bShouldShowTrainer : 1; // 0x9b0 [Mask: 0x1] [Bit: 0]
};


struct FortHestiaWeaponBoardBase
{
public:
	uint8_t pad_0[0x2a8]; // 0x0
	FortHestiaWeaponBoardWeaponLists WeaponLists; // 0x2a8 [Size: 0x20]
};


struct AHestiaQuestObjectiveNumberDisplay
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	int ObjectiveProgress; // 0x2a0 [Size: 0x4]
	bool bIsTrackedQuestObjectiveComplete : 1; // 0x2a4 [Mask: 0x1] [Bit: 0]
};


struct UHestiaHostBannerDisplayComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FName BannerColorName; // 0x108 [Size: 0x4]
	FName BannerIconName; // 0x10c [Size: 0x4]
};


struct UHestiaVariationManager
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	TArray<int> GroupsIdxWithActiveEffects; // 0xf0 [Size: 0x10]
};


struct FortPlayerDefenderComponent
{
public:
	uint8_t pad_0[0x1e4]; // 0x0
	bool bCanInteract : 1; // 0x1e4 [Mask: 0x1] [Bit: 0]
};


struct URocketDrillAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData MaxFuel; // 0x38 [Size: 0x28]
	FortGameplayAttributeData Fuel; // 0x60 [Size: 0x28]
	FortGameplayAttributeData MaxReserveFuel; // 0x88 [Size: 0x28]
	FortGameplayAttributeData ReserveFuel; // 0xb0 [Size: 0x28]
};


struct ARockVehicle
{
public:
	uint8_t pad_0[0x2029]; // 0x0
	bool bFreeLookCamera : 1; // 0x2029 [Mask: 0x1] [Bit: 0]
	uint8_t pad_202a[0x17]; // 0x202a
	FRockRuntimeConfigOverrides RockRuntimeConfigs; // 0x2041 [Size: 0x4]
};


struct URockVehicleBoostTank
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FRockScalableFloat MaxSeconds; // 0x100 [Size: 0x30]
	enum ERockBoostLogic BoostLogic; // 0x130 [Size: 0x1]
	uint8_t pad_131[0x3]; // 0x131
	float BoostRechargeRate; // 0x134 [Size: 0x4]
	float BoostRechargeDelay; // 0x138 [Size: 0x4]
	float SecondsRemaining; // 0x13c [Size: 0x4]
};


struct FakeRadioPlayerComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	bool bReplicatedRadioIsActive : 1; // 0xf0 [Mask: 0x1] [Bit: 0]
};


struct UStreamingRadioPlayerComponent
{
public:
	uint8_t pad_0[0x1a8]; // 0x0
	bool bAutostartOnEntry : 1; // 0x1a8 [Mask: 0x1] [Bit: 0]
	bool bDisabledForCurrentPlayerState : 1; // 0x1a9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1aa[0x6]; // 0x1aa
	FStreamingRadioSourceData ReplicatedRadioSourceData; // 0x1b0 [Size: 0x68]
	uint8_t pad_218[0x1b4]; // 0x218
	int DefaultPlayingIndex; // 0x3cc [Size: 0x4]
	bool bForceAutoStartOnInit : 1; // 0x3d0 [Mask: 0x1] [Bit: 0]
	bool bTryStopRadioOnSeatChanges : 1; // 0x3d1 [Mask: 0x1] [Bit: 0]
	bool bStopRadioOnNetConnectionLost : 1; // 0x3d2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3d3[0x69]; // 0x3d3
	float MediaStartTimeFromInit; // 0x43c [Size: 0x4]
};


struct FortChargingSet_RiverStyxDash
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData CurrentCharges; // 0x30 [Size: 0x28]
};


struct FortPawnComponent_RiftGauntlets
{
public:
	uint8_t pad_0[0x1e8]; // 0x0
	float CurrentHeightAboveWorld; // 0x1e8 [Size: 0x4]
};


struct ARiftAnomaliesActorBase
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FortRiftAnomaliesData* RiftAnomalyData; // 0x270 [Size: 0x8]
};


struct FortRiftAnomaliesManager
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FortRiftAnomaliesData* CurrentRetryingAnomaly; // 0x100 [Size: 0x20]
};


struct FortPlayerStateComponent_PlaytimeRewards
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float DisplayIntervalInSeconds; // 0xc0 [Size: 0x4]
	int AccumulatedXpRewardedThisSession; // 0xc4 [Size: 0x4]
};


struct FortBattleRoyalePlayerAugmentSystem
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	float ServerGrantingStartedTimestamp; // 0xc8 [Size: 0x4]
};


struct FortControllerComponent_AugmentGrantingSystem
{
public:
	uint8_t pad_0[0x1e9]; // 0x0
	int8_t ReplicatedNumPendingAugmentsToGrant; // 0x1e9 [Size: 0x1]
	uint8_t pad_1ea[0x6]; // 0x1ea
	TArray<FPlayerAugmentChoiceDatum> ReplicatedAugmentChoices; // 0x1f0 [Size: 0x10]
	int8_t NumFreeRerolls; // 0x200 [Size: 0x1]
	int8_t NumLockedSelectionChoices; // 0x201 [Size: 0x1]
	uint8_t pad_202[0xbe]; // 0x202
	FortItemEntry SelectorItemEntry; // 0x2c0 [Size: 0x98]
};


struct FortControllerComponent_PlayerAugmentPersistence
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FPlayerAugmentsPersistenceData LivePlayerAugmentsPersistenceData; // 0x128 [Size: 0x18]
	uint8_t pad_140[0x10]; // 0x140
	TArray<FReplicatedSharedPlayerAugment> ReplicatedSharedPlayerAugments; // 0x150 [Size: 0x10]
};


struct FortPlayerStateComponent_PlayerAugmentSystem
{
public:
	uint8_t pad_0[0x138]; // 0x0
	TArray<FortPlayerAugmentItemDefinition*> ActiveAugments; // 0x138 [Size: 0x10]
	uint8_t pad_148[0x18]; // 0x148
	TArray<FSquadMemberAugmentData> SquadAugments; // 0x160 [Size: 0x10]
};


struct FortAIPawnComponent_PlayerAIPet
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FortPlayerPawn* CurrentPlayer; // 0xc8 [Size: 0x8]
};


struct FortControllerComponent_PlayerAIPet
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FortAIPawn* CurrentPet; // 0xc8 [Size: 0x8]
};


struct UPilgrimBattleStageGameManagerComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	TArray<FBattleStageBandState> BattleStageBandStates; // 0x100 [Size: 0x10]
	enum EMatchPrivacyType bIsMatchPrivate; // 0x110 [Size: 0x1]
};


struct APilgrimQuickplayPlayerStart
{
public:
	uint8_t pad_0[0x2e8]; // 0x0
	uint8_t Team; // 0x2e8 [Size: 0x1]
};


struct APilgrimQuickplayPlayspace
{
public:
	uint8_t pad_0[0x730]; // 0x0
	UGameplayStateMachine* MainStateMachine; // 0x730 [Size: 0x8]
};


struct UPilgrimGreenRoomLayoutSwitcher
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	int CurrentLayout; // 0xc0 [Size: 0x4]
};


struct UPilgrimQuickplayBandStateComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	UPilgrimPremadeSetlist* SetlistVoteWinner; // 0xe0 [Size: 0x8]
	int CurrentSetlistIndex; // 0xe8 [Size: 0x4]
	bool bIsReplayingPreviousSong : 1; // 0xec [Mask: 0x1] [Bit: 0]
};


struct UPilgrimQuickplayPlayerStateComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	UPilgrimSongMetadata* SongVote; // 0xe0 [Size: 0x8]
	UPilgrimPremadeSetlist* SetlistVote; // 0xe8 [Size: 0x8]
	bool bHasSongSelectMenuOpen : 1; // 0xf0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_f1[0x6f]; // 0xf1
	bool bInitialSpawningDone : 1; // 0x160 [Mask: 0x1] [Bit: 0]
};


struct UPilgrimQuickplayState_SongResults
{
public:
	uint8_t pad_0[0x98]; // 0x0
	double ServerEndTime; // 0x98 [Size: 0x8]
};


struct UPilgrimSetlistComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	FSparksCuratedSetlistData ActiveSetlistData; // 0xe8 [Size: 0x78]
	bool bCustomSetlistsEnabled : 1; // 0x160 [Mask: 0x1] [Bit: 0]
};


struct APilgrimMusicBattleInstance
{
public:
	uint8_t pad_0[0x290]; // 0x0
	uint8_t Team; // 0x290 [Size: 0x1]
	uint8_t pad_291[0xf]; // 0x291
	FPilgrimMusicBattleData MusicBattleData; // 0x2a0 [Size: 0x48]
	FName SongToPlayShortName; // 0x2e8 [Size: 0x4]
	uint8_t pad_2ec[0xc]; // 0x2ec
	enum EPilgrimSongDifficulty SongDifficultyToPlay; // 0x2f8 [Size: 0x1]
	uint8_t pad_2f9[0x27]; // 0x2f9
	TArray<FortPlayerStateAthena*> MusicBattlePlayers; // 0x320 [Size: 0x10]
	uint8_t pad_330[0x8]; // 0x330
	enum EMusicBattleType MusicBattleType; // 0x338 [Size: 0x1]
};


struct APilgrimPlayspace
{
public:
	uint8_t pad_0[0x6d0]; // 0x0
	TArray<APilgrimMusicBattleInstance*> PilgrimMusicBattleInstances; // 0x6d0 [Size: 0x10]
	uint8_t pad_6e0[0x20]; // 0x6e0
	UPilgrimGameConfig* PilgrimGameConfig; // 0x700 [Size: 0x8]
	UPilgrimSupportedGameplayConfig* PilgrimSupportedGameplayConfig; // 0x708 [Size: 0x8]
};


struct UNetworkedMusicClockManager
{
public:
	uint8_t pad_0[0x1c8]; // 0x0
	FSongTimestampData CurrentSongServerTimestamp; // 0x1c8 [Size: 0x50]
};


struct UPilgrimCoreBandStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FName> OwnedSongs; // 0xc0 [Size: 0x10]
};


struct UPilgrimCorePlayerStateComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	enum EPartPickingState PartPickingState; // 0xd8 [Size: 0x1]
	enum EPilgrimSongDifficulty SongDifficulty; // 0xd9 [Size: 0x1]
	bool bIsReady : 1; // 0xda [Mask: 0x1] [Bit: 0]
	uint8_t pad_db[0x1]; // 0xdb
	bool bIsReadyToReturn : 1; // 0xdc [Mask: 0x1] [Bit: 0]
	bool bPregameChoicesLocked : 1; // 0xdd [Mask: 0x1] [Bit: 0]
};


struct UPilgrimCustomSetlist
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	TArray<FPilgrimCustomSetlistEntry> SetlistEntries; // 0xf0 [Size: 0x10]
	int MaxSongsPerPlayer; // 0x100 [Size: 0x4]
	bool bIsSetlistLocked : 1; // 0x104 [Mask: 0x1] [Bit: 0]
	uint8_t pad_105[0x3]; // 0x105
	FGuid SetlistId; // 0x108 [Size: 0x10]
};


struct UPilgrimLeaderboardPlayerComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	bool bEnableBandFriendLeaderboardOption : 1; // 0xe0 [Mask: 0x1] [Bit: 0]
};


struct UPilgrimPlayerControllerComponent
{
public:
	uint8_t pad_0[0x170]; // 0x0
	bool bUseAutoplay : 1; // 0x170 [Mask: 0x1] [Bit: 0]
};


struct UPilgrimRandomSetlist
{
public:
	uint8_t pad_0[0x118]; // 0x0
	TArray<UPilgrimSongMetadata*> SongList; // 0x118 [Size: 0x10]
};


struct UPilgrimStandinDirector
{
public:
	uint8_t pad_0[0x118]; // 0x0
	TArray<FortPlayerPawnAthena*> SpawnedStandinPawns; // 0x118 [Size: 0x10]
	TArray<FortPlayerStateAthena*> SpawnedStandinStates; // 0x128 [Size: 0x10]
};


struct UPilgrimTrackSelectionComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EPilgrimTrackType SelectedTrack; // 0xc0 [Size: 0x1]
};


struct UPiggybackComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FortPlayerPawn* PiggybackRider; // 0xd0 [Size: 0x8]
	FortPlayerPawn* PiggybackCarrier; // 0xd8 [Size: 0x8]
	UPiggybackComponent* PiggybackRootCarrierComp; // 0xe0 [Size: 0x8]
	TArray<UPiggybackComponent*> PiggybackStack; // 0xe8 [Size: 0x10]
};


struct APapayaTimedEvents
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	FMediaTimeEventArray TimedEventsArray; // 0x2a0 [Size: 0x58]
	uint8_t pad_2f8[0x18]; // 0x2f8
	FString ScreenName; // 0x310 [Size: 0x10]
};


struct FortNevadaVehicle
{
public:
	uint8_t pad_0[0x2020]; // 0x0
	FNevadaState ServerReplicatedState; // 0x2020 [Size: 0x14]
	uint8_t pad_2034[0x38]; // 0x2034
	float TractorBeamExtraLengthForExtents; // 0x206c [Size: 0x4]
	uint8_t pad_2070[0xc0]; // 0x2070
	bool bTractorBeamChargeStarted : 1; // 0x2130 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2131[0xdf]; // 0x2131
	UPrimitiveComponent* TractorBeamAttachedPrimitive; // 0x2210 [Size: 0x8]
	uint8_t pad_2218[0x10]; // 0x2218
	TArray<Actor*> TractorBeamTargetedActors; // 0x2228 [Size: 0x10]
	uint8_t pad_2238[0x10]; // 0x2238
	Actor* TractorBeamAttachedActor; // 0x2248 [Size: 0x8]
	Actor* TractorBeamTargetedActor; // 0x2250 [Size: 0x8]
	FVector TractorBeamTargetPosition; // 0x2258 [Size: 0x18]
	uint8_t pad_2270[0x158]; // 0x2270
	enum ETractorBeamState TractorBeamState; // 0x23c8 [Size: 0x1]
	uint8_t pad_23c9[0x2f]; // 0x23c9
	float TractorBeamDeactivationTimestamp; // 0x23f8 [Size: 0x4]
	float TractorBeamDisruptedTimestamp; // 0x23fc [Size: 0x4]
};


struct FortExCaliberProjectile
{
public:
	uint8_t pad_0[0xc08]; // 0x0
	bool bSimulationRunning : 1; // 0xc08 [Mask: 0x1] [Bit: 0]
};


struct FortMusterExplosiveARProjectile
{
public:
	uint8_t pad_0[0xc08]; // 0x0
	FVector HitLocation; // 0xc08 [Size: 0x18]
	FRotator HitRotation; // 0xc20 [Size: 0x18]
	bool bHitPlayer : 1; // 0xc38 [Mask: 0x1] [Bit: 0]
};


struct UMusicSequencerHitComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FMusicSequencerHitArray MusicSequencerEventList; // 0xc0 [Size: 0x60]
	TArray<USoundBase*> LoadedSoundsList; // 0x120 [Size: 0x10]
};


struct FortWeaponRangedDual_MurkyVole
{
public:
	uint8_t pad_0[0x2948]; // 0x0
	int ActualMissileNumber; // 0x2948 [Size: 0x4]
};


struct AMurkyVoleTurretAttachment
{
public:
	uint8_t pad_0[0x290]; // 0x0
	FRotator AimRotation_Server; // 0x290 [Size: 0x18]
	uint8_t pad_2a8[0x18]; // 0x2a8
	FVector TargetActorLastKnownLocation; // 0x2c0 [Size: 0x18]
	FVector ScannerRays_TargetingScale; // 0x2d8 [Size: 0x18]
	uint8_t pad_2f0[0xc0]; // 0x2f0
	Actor* TargetActor; // 0x3b0 [Size: 0x8]
	uint8_t pad_3b8[0x1]; // 0x3b8
	bool bTargetIsObstructed : 1; // 0x3b9 [Mask: 0x1] [Bit: 0]
};


struct AModularVehicleSceneGraphPawn
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	Object* EntityPtr; // 0x2f0 [Size: 0x8]
	Object* EntityOwnerPtr; // 0x2f8 [Size: 0x8]
};


struct UMistRavenPlayerComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	bool bRepWFActive : 1; // 0xe0 [Mask: 0x1] [Bit: 0]
};


struct UMilkshakeControllerComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	int NearbyBuildingActorsUpdateScanRadiusReplicated; // 0xf0 [Size: 0x4]
	uint8_t pad_f4[0x2c]; // 0xf4
	float CameraShakeScaleReplicated; // 0x120 [Size: 0x4]
	uint8_t pad_124[0x2c]; // 0x124
	float NearbyBuildingActorsUpdateIntervalReplicated; // 0x150 [Size: 0x4]
	uint8_t pad_154[0x2c]; // 0x154
	bool bForceFeedbackEnabledReplicated : 1; // 0x180 [Mask: 0x1] [Bit: 0]
	uint8_t pad_181[0x97]; // 0x181
	float MinTimeBetweenBuildingDamageFXReplicated; // 0x218 [Size: 0x4]
	uint8_t pad_21c[0x2c]; // 0x21c
	float MaxTimeBetweenBuildingDamageFXReplicated; // 0x248 [Size: 0x4]
};


struct ABuildingGameplayActorMarketItem
{
public:
	uint8_t pad_0[0x940]; // 0x0
	FMarketGameplayPurchaseRuntimeData PurchaseData; // 0x940 [Size: 0x120]
};


struct ULimePawnComponentMood
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FLimeMoodStateData CurrentMoodState; // 0xf0 [Size: 0x4]
};


struct ULimePawnComponent_EmotionalState
{
public:
	uint8_t pad_0[0x108]; // 0x0
	enum ELimePawnEmotionalState CurrentEmotionalState; // 0x108 [Size: 0x1]
	uint8_t pad_109[0x3]; // 0x109
	FLimeEmotionalStateData TargetEmotionalState; // 0x10c [Size: 0x10]
	uint8_t CheatEmotionIndex; // 0x11c [Size: 0x1]
};


struct ABuildingGameplayActorLaserGrid
{
public:
	uint8_t pad_0[0x9b0]; // 0x0
	FLaserGridConnectionArray LaserGridConnections; // 0x9b0 [Size: 0x58]
	uint8_t pad_a08[0xf8]; // 0xa08
	FLaserGridOutletArray LaserGridOutlets; // 0xb00 [Size: 0x60]
	uint8_t pad_b60[0x10]; // 0xb60
	bool bEnabled : 1; // 0xb70 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Knockback
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	FKnockbackMutatorDataArray AllPlayersKnockbackData; // 0x2f8 [Size: 0x60]
};


struct AJunoWheelActor
{
public:
	uint8_t pad_0[0x480]; // 0x0
	int CurveTableIndexToWheelPresets; // 0x480 [Size: 0x4]
};


struct UJunoTabascoInvasionManagerComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	bool bInvasionStarted : 1; // 0x120 [Mask: 0x1] [Bit: 0]
	uint8_t pad_121[0x3]; // 0x121
	int CurrentEscalationLevel; // 0x124 [Size: 0x4]
};


struct AJunoSwivelBase
{
public:
	uint8_t pad_0[0xde0]; // 0x0
	AJunoSwivelPlate* SwivelPlateActor; // 0xde0 [Size: 0x8]
	FConstraintAttachData AttachmentData; // 0xde8 [Size: 0xa0]
	uint8_t pad_e88[0x8]; // 0xe88
	bool bReverseControlledRotation : 1; // 0xe90 [Mask: 0x1] [Bit: 0]
};


struct AJunoSwivelPlate
{
public:
	uint8_t pad_0[0xc78]; // 0x0
	AJunoSwivelBase* SwivelBaseActor; // 0xc78 [Size: 0x8]
	bool bCurrentlyDriving : 1; // 0xc80 [Mask: 0x1] [Bit: 0]
};


struct UJunoStormAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData StormTime; // 0x30 [Size: 0x28]
	FortGameplayAttributeData MaxStormTime; // 0x58 [Size: 0x28]
};


struct UJunoCustomMusicPlayerComponent
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	FJunoCustomMusicPlayerComponentRepData RepData; // 0x2a0 [Size: 0x48]
};


struct UJunoMusicGameStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FGameplayTag> MusicStates; // 0xc0 [Size: 0x10]
};


struct USparksCustomSetlist
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	TArray<FSparksCustomSetlistEntry> SetlistEntries; // 0xd8 [Size: 0x10]
};


struct UJunoGameFrameworkComponent_ModularMatchStats
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FJunoModularMatchStatFastArray ReplicatedMatchStats; // 0xd0 [Size: 0x60]
};


struct UJunoResearchControllerComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FJunoReplicatedAllPlayerResearch AllPlayerResearch; // 0x100 [Size: 0x10]
	TArray<FName> UnlockedRecipes; // 0x110 [Size: 0x10]
};


struct UJunoMistRavenItemsHoverAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData MaxLateralSpeed; // 0x30 [Size: 0x28]
	FortGameplayAttributeData MaxAscendSpeed; // 0x58 [Size: 0x28]
	FortGameplayAttributeData HorizontalMovementForce; // 0x80 [Size: 0x28]
	FortGameplayAttributeData AscendForce; // 0xa8 [Size: 0x28]
	FortGameplayAttributeData DescendForce; // 0xd0 [Size: 0x28]
	FortGameplayAttributeData HorizontalBrakingForce; // 0xf8 [Size: 0x28]
	FortGameplayAttributeData DirectionChangeBonus; // 0x120 [Size: 0x28]
	FortGameplayAttributeData ZBrakingForce; // 0x148 [Size: 0x28]
	FortGameplayAttributeData SprintMultiplier; // 0x170 [Size: 0x28]
};


struct AJunoMissionPrefab
{
public:
	uint8_t pad_0[0xa68]; // 0x0
	enum EScenarioStatus MissionStatus; // 0xa68 [Size: 0x1]
	uint8_t pad_a69[0x7]; // 0xa69
	FJunoMissionInfo MissionInfo; // 0xa70 [Size: 0x190]
	FJunoObjectiveInfo CurrentObjective; // 0xc00 [Size: 0x28]
};


struct AJunoObjectivePrefab
{
public:
	uint8_t pad_0[0xa68]; // 0x0
	enum EScenarioStatus ObjectiveStatus; // 0xa68 [Size: 0x1]
};


struct UJunoMissionManagerComponent
{
public:
	uint8_t pad_0[0x158]; // 0x0
	FJunoMissionInfo CurrentMissionInfo; // 0x158 [Size: 0x190]
};


struct UJunoControllerComponent_RuneRoll
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FRuneRoll CurrentRoll; // 0xf0 [Size: 0x20]
};


struct AJunoPOIEncounterPrefab
{
public:
	uint8_t pad_0[0xa68]; // 0x0
	bool bEncounterShouldBeLoaded : 1; // 0xa68 [Mask: 0x1] [Bit: 0]
	bool bEncounterIsInitialized : 1; // 0xa69 [Mask: 0x1] [Bit: 0]
};


struct UJunoEarthElementalAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FGameplayAttributeData JunoCurrentEarthAffliction; // 0x38 [Size: 0x10]
	FGameplayAttributeData JunoMaxEarthAffliction; // 0x48 [Size: 0x10]
};


struct UJunoFireElementalAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FGameplayAttributeData JunoCurrentFireAffliction; // 0x38 [Size: 0x10]
	FGameplayAttributeData JunoMaxFireAffliction; // 0x48 [Size: 0x10]
};


struct UJunoIceElementalAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FGameplayAttributeData JunoCurrentIceAffliction; // 0x38 [Size: 0x10]
	FGameplayAttributeData JunoMaxIceAffliction; // 0x48 [Size: 0x10]
};


struct UJunoLightningElementalAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FGameplayAttributeData JunoCurrentLightningAffliction; // 0x38 [Size: 0x10]
	FGameplayAttributeData JunoMaxLightningAffliction; // 0x48 [Size: 0x10]
};


struct UJunoAnimalProcessorComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FGameplayTag AssignedAnimalDescriptorTag; // 0xf0 [Size: 0x4]
	uint8_t pad_f4[0x4]; // 0xf4
	FGameplayTag AssignedFriendshipStateTag; // 0xf8 [Size: 0x4]
	float CurrentCraftingSpeedModifier; // 0xfc [Size: 0x4]
};


struct UJunoControllerComponent_Taming
{
public:
	uint8_t pad_0[0x110]; // 0x0
	FGameplayTag FollowingAnimalAIDescriptorTag; // 0x110 [Size: 0x4]
};


struct AJunoConveyorBelt
{
public:
	uint8_t pad_0[0x278]; // 0x0
	float BeltSpeed; // 0x278 [Size: 0x4]
	uint8_t pad_27c[0x3c]; // 0x27c
	float SplineLength; // 0x2b8 [Size: 0x4]
	uint8_t pad_2bc[0x8]; // 0x2bc
	float ItemSlotDistance; // 0x2c4 [Size: 0x4]
	TArray<Actor*> Slots; // 0x2c8 [Size: 0x10]
	bool bIsRunning : 1; // 0x2d8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2d9[0x7]; // 0x2d9
	TArray<FloatRange> HiddenDistanceRanges; // 0x2e0 [Size: 0x10]
	double StartTime; // 0x2f0 [Size: 0x8]
};


struct AJunoItemSlottable
{
public:
	uint8_t pad_0[0x2c8]; // 0x0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x2c8 [Size: 0x8]
	FortItemEntry SlottedItem; // 0x2d0 [Size: 0x98]
};


struct AJunoPowerCenter
{
public:
	uint8_t pad_0[0xc40]; // 0x0
	UJunoPowerManagerComponent* PowerManager; // 0xc40 [Size: 0x8]
	FGuid CurrentPowerItemGUID; // 0xc48 [Size: 0x10]
};


struct UJunoPowerConsumerComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	UJunoPowerManagerComponent* PowerManager; // 0x120 [Size: 0x8]
};


struct UJunoPowerManagerComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	TArray<AJunoPowerCenter*> AttachedPowerCenters; // 0xf8 [Size: 0x10]
	TArray<AJunoPowerBank*> AttachedPowerBanks; // 0x108 [Size: 0x10]
	TArray<FConsumerChannelPowerInfo> ConsumerChannelPowers; // 0x118 [Size: 0x10]
	AJunoPowerCenter* CurrentPowerCenter; // 0x128 [Size: 0x8]
	uint8_t pad_130[0x10]; // 0x130
	bool bIsConsumingPower : 1; // 0x140 [Mask: 0x1] [Bit: 0]
	bool bHasInfinitePower : 1; // 0x140 [Mask: 0x2] [Bit: 1]
};


struct UJunoGameStateComponent_Escalations
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FGameplayTag EscalationTag; // 0xc0 [Size: 0x4]
};


struct UJunoLevelsControllerComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	TArray<FJunoReplicatedRoleLevels> AllRoleLevels; // 0x128 [Size: 0x10]
};


struct UJunoPointsStateComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FJunoReplicatedPointsBalance PointsBalance; // 0xd0 [Size: 0x8]
};


struct UJunoRoleAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData RoleEnergy; // 0x30 [Size: 0x28]
	FortGameplayAttributeData MaxRoleEnergy; // 0x58 [Size: 0x28]
	FortGameplayAttributeData XPMultiplier; // 0x80 [Size: 0x28]
};


struct UJunoRolesControllerComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	FGameplayTag RoleTag; // 0xe8 [Size: 0x4]
	uint8_t pad_ec[0x4c]; // 0xec
	int NumRoleAbilities; // 0x138 [Size: 0x4]
};


struct UJunoSkillsControllerComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	TArray<FJunoReplicatedRoleSkills> AllSkills; // 0xd8 [Size: 0x10]
};


struct UJunoPartDataComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FJunoItemPartData> PartData; // 0xc0 [Size: 0x10]
};


struct UJunoLowMemoryFallbackGameStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FJunoLowMemoryFallbackTriggeredStrategy> TriggeredStrategies; // 0xc0 [Size: 0x10]
};


struct UJunoGameFrameworkComponent_Journal
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FJunoJournalEntryFastArray ReplicatedTaskState; // 0xd0 [Size: 0x60]
};


struct UJunoPlayerStateComponent_JournalUserData
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FJunoJournalViewedTaskFastArray ReplicatedViewedTasks; // 0xe0 [Size: 0x60]
	FName TrackedTaskName; // 0x140 [Size: 0x4]
	uint8_t pad_144[0x14]; // 0x144
	FJunoJournalCategoryFastArray ReplicatedCategories; // 0x158 [Size: 0x60]
	uint8_t pad_1b8[0x8]; // 0x1b8
	bool bIsInitialized : 1; // 0x1c0 [Mask: 0x1] [Bit: 0]
};


struct AJunoBattleBusStop
{
public:
	uint8_t pad_0[0xa50]; // 0x0
	FGuid ReplicatedSavedActorGuid; // 0xa50 [Size: 0x10]
	bool bIsBusStopDiscovered : 1; // 0xa60 [Mask: 0x1] [Bit: 0]
};


struct UJunoBusManagerComponent
{
public:
	uint8_t pad_0[0x3e0]; // 0x0
	TArray<FJunoDiscoveredBusStop> DiscoveredBusStops; // 0x3e0 [Size: 0x10]
	FJunoBattleBusQueuedPlayersData QueuedPlayersData; // 0x3f0 [Size: 0x38]
	int QueueTimeRemaining; // 0x428 [Size: 0x4]
};


struct AJunoStreamingGameplayVolume
{
public:
	uint8_t pad_0[0x3d8]; // 0x0
	TArray<UWorld*> LevelsToLoad; // 0x3d8 [Size: 0x10]
};


struct AJunoWorldTile
{
public:
	uint8_t pad_0[0x3f8]; // 0x0
	FPCGJunoWorldTile TileInformation; // 0x3f8 [Size: 0x1c8]
	uint8_t pad_5c0[0x10]; // 0x5c0
	FJunoWorldTileStreamingLevelFastArray InjectedLevels; // 0x5d0 [Size: 0x60]
	uint8_t pad_630[0x10]; // 0x630
	TArray<FJunoWorldTilePreloadActor> PreloadActors; // 0x640 [Size: 0x10]
	uint8_t pad_650[0x20]; // 0x650
	AJunoWorldTileEventBuilder* EventBuilder; // 0x670 [Size: 0x8]
	int PreloadActorCount; // 0x678 [Size: 0x4]
	int ReferencedPreloadActorCount; // 0x67c [Size: 0x4]
	uint8_t pad_680[0x38]; // 0x680
	bool bTileGenerationComplete : 1; // 0x6b8 [Mask: 0x1] [Bit: 0]
	bool bLoaded : 1; // 0x6b9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_6ba[0x86]; // 0x6ba
	bool bIsSingleTileProxy : 1; // 0x740 [Mask: 0x1] [Bit: 0]
};


struct UJunoLifecycleComponent
{
public:
	uint8_t pad_0[0x139]; // 0x0
	uint8_t CurrentPhaseIndex; // 0x139 [Size: 0x1]
};


struct UJunoPawnComponent_StreamingSourcesProvider
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FVector AboveGroundLocation; // 0xd8 [Size: 0x18]
	FRotator AboveGroundRotation; // 0xf0 [Size: 0x18]
	FVector BelowGroundLocation; // 0x108 [Size: 0x18]
	FRotator BelowGroundRotation; // 0x120 [Size: 0x18]
};


struct UJunoProceduralWorldSettings
{
public:
	uint8_t pad_0[0x11a]; // 0x0
	enum EJunoLevelInstanceMode Caves_LevelInstanceMode; // 0x11a [Size: 0x1]
	enum EJunoLevelInstanceMode POI_LevelInstanceMode; // 0x11b [Size: 0x1]
	bool bEnablePOI_HLODs : 1; // 0x11c [Mask: 0x1] [Bit: 0]
	uint8_t pad_11d[0x7]; // 0x11d
	FName InjectedPOI_GridName; // 0x124 [Size: 0x4]
	FName InjectedPOI_HLODGridName; // 0x128 [Size: 0x4]
	FName InjectedCave_GridName; // 0x12c [Size: 0x4]
	FName InjectedCave_HLODGridName; // 0x130 [Size: 0x4]
	uint8_t pad_134[0xc]; // 0x134
	int64_t TileSize; // 0x140 [Size: 0x8]
	int64_t WorldSize; // 0x148 [Size: 0x8]
	int64_t GenerateWorldDiameter; // 0x150 [Size: 0x8]
	FIntVector WorldOriginTileOffset; // 0x158 [Size: 0xc]
	uint8_t pad_164[0x14]; // 0x164
	UJunoWorldTileSelectionBase* TileSelectionClass; // 0x178 [Size: 0x8]
};


struct UJunoWorldLocalEnvironmentComponent
{
public:
	uint8_t pad_0[0x198]; // 0x0
	FJunoBiomeInfoQueryResult ServerBiome; // 0x198 [Size: 0xd0]
	uint8_t pad_268[0x108]; // 0x268
	FGuid CaveGUID; // 0x370 [Size: 0x10]
};


struct AJunoAdventurePlayspaceBase
{
public:
	uint8_t pad_0[0x660]; // 0x0
	FGameplayTagContainer AdventureTags; // 0x660 [Size: 0x20]
};


struct AJunoBuildingActor
{
public:
	uint8_t pad_0[0xc1a]; // 0x0
	bool bPreventDestroyingFoliageWhenPlaced : 1; // 0xc1a [Mask: 0x1] [Bit: 0]
	uint8_t pad_c1b[0x1]; // 0xc1b
	bool bAvoidExternalConnectionWithGuidedBuild : 1; // 0xc1c [Mask: 0x1] [Bit: 0]
};


struct AJunoBuildingGameplayActor
{
public:
	uint8_t pad_0[0x9d8]; // 0x0
	bool bNeedsAssembly : 1; // 0x9d8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9d9[0x7]; // 0x9d9
	UItemDefinitionBase* AssociatedItem; // 0x9e0 [Size: 0x8]
};


struct AJunoBuildingProp
{
public:
	uint8_t pad_0[0xbd8]; // 0x0
	bool bNeedsAssembly : 1; // 0xbd8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_bd9[0x7]; // 0xbd9
	UItemDefinitionBase* AssociatedItem; // 0xbe0 [Size: 0x8]
};


struct AJunoCampActor
{
public:
	uint8_t pad_0[0x360]; // 0x0
	FGuid SavedActorGuid; // 0x360 [Size: 0x10]
	uint8_t pad_370[0x10]; // 0x370
	UJunoCampCenterComponent* CampCenterCache; // 0x380 [Size: 0x8]
	enum EJunoBiome CampBiome; // 0x388 [Size: 0x1]
	uint8_t pad_389[0x3]; // 0x389
	FGameplayTag CampBiomeTag; // 0x38c [Size: 0x4]
	FGameplayTagContainer OwnedGameplayTags; // 0x390 [Size: 0x20]
};


struct AJunoClusterUnionActor
{
public:
	uint8_t pad_0[0x308]; // 0x0
	FGameplayTagContainer CachedChannelTagSubscribed; // 0x308 [Size: 0x20]
	FChannelIconOverridesFastArray ChannelIconOverrides; // 0x328 [Size: 0x58]
};


struct AJunoCoreMutators
{
public:
	uint8_t pad_0[0x328]; // 0x0
	bool bIsJunoPlayspaceReady : 1; // 0x328 [Mask: 0x1] [Bit: 0]
};


struct AJunoCraftingObjectBGA
{
public:
	uint8_t pad_0[0xa60]; // 0x0
	bool bNeedsAssembly : 1; // 0xa60 [Mask: 0x1] [Bit: 0]
};


struct AJunoGuidedBuildingActor
{
public:
	uint8_t pad_0[0xcc8]; // 0x0
	FJunoGuidedBuildingStateArray StateArray; // 0xcc8 [Size: 0x60]
	FJunoStageKey CurrentStage; // 0xd28 [Size: 0x8]
	FJunoGuidedBuildingSetCompleteState SetCompleteState; // 0xd30 [Size: 0x10]
	uint8_t pad_d40[0x8]; // 0xd40
	UniqueNetIdRepl OwningPlayerID; // 0xd48 [Size: 0x30]
	uint8_t pad_d78[0x108]; // 0xd78
	FJunoGuidedBuildingRegisteredPlayerArray RegisteredPlayers; // 0xe80 [Size: 0x88]
	TArray<AutoCompleteBlockedIndex> BlockedAutoCompleteIndexes; // 0xf08 [Size: 0x10]
};


struct AJunoInventory
{
public:
	uint8_t pad_0[0x470]; // 0x0
	int InventoryCapacity; // 0x470 [Size: 0x4]
};


struct AJunoMapManager
{
public:
	uint8_t pad_0[0x270]; // 0x0
	float TileSize; // 0x270 [Size: 0x4]
};


struct AJunoMarkerManager
{
public:
	uint8_t pad_0[0x2b0]; // 0x0
	TArray<FJunoMarker> Markers; // 0x2b0 [Size: 0x10]
};


struct AJunoPlayerState
{
public:
	uint8_t pad_0[0x1718]; // 0x0
	FGuid CaveId; // 0x1718 [Size: 0x10]
};


struct AJunoRoom
{
public:
	uint8_t pad_0[0x28c]; // 0x0
	FGuid SavedActorGuid; // 0x28c [Size: 0x10]
	uint8_t pad_29c[0x24]; // 0x29c
	FJunoRoomContext RoomContext; // 0x2c0 [Size: 0x18]
	bool bAutoDetectType : 1; // 0x2d8 [Mask: 0x1] [Bit: 0]
};


struct AJunoRootPlayspace
{
public:
	uint8_t pad_0[0x830]; // 0x0
	AJunoMapManager* MapManager; // 0x830 [Size: 0x8]
	uint8_t pad_838[0x18]; // 0x838
	AJunoMarkerManager* MarkerManager; // 0x850 [Size: 0x8]
};


struct AJunoStorageChest
{
public:
	uint8_t pad_0[0xce8]; // 0x0
	UniqueNetIdRepl OwnerPlayerId; // 0xce8 [Size: 0x30]
	uint8_t pad_d18[0x28]; // 0xd18
	bool bChestSearched : 1; // 0xd40 [Mask: 0x1] [Bit: 0]
	bool bChestLooted : 1; // 0xd41 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d42[0x3e]; // 0xd42
	bool bAllowInteractionFromPersistence : 1; // 0xd80 [Mask: 0x1] [Bit: 0]
};


struct AJunoSurvivalMapManager
{
public:
	uint8_t pad_0[0x288]; // 0x0
	FJunoSurvivalMapExplorationData MapExplorationData; // 0x288 [Size: 0x70]
	bool bIsExplorationDataInitialized : 1; // 0x2f8 [Mask: 0x1] [Bit: 0]
};


struct AJunoSurvivalRootPlayspace
{
public:
	uint8_t pad_0[0x888]; // 0x0
	FJunoReplicatedWorldMetadata MetadataForReplication; // 0x888 [Size: 0xe0]
};


struct UJunoAIAttachableArmorComponent
{
public:
	uint8_t pad_0[0x2b8]; // 0x0
	AJunoAIAttachableArmorActor* ChildAttachableArmor; // 0x2b8 [Size: 0x8]
};


struct UJunoAIFriendshipPawnComponent
{
public:
	uint8_t pad_0[0x33c]; // 0x0
	float FriendshipValue; // 0x33c [Size: 0x4]
	FGameplayTag FriendshipState; // 0x340 [Size: 0x4]
};


struct UJunoAwesomeLevelComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	int AwesomeLevel; // 0x118 [Size: 0x4]
	int CurrentAwesomePoints; // 0x11c [Size: 0x4]
	uint8_t pad_120[0x10]; // 0x120
	TArray<int> AwesomePointGoals; // 0x130 [Size: 0x10]
	uint8_t pad_140[0x10]; // 0x140
	FJunoAwesomeUpgradeRequirements CurrentUpgradeRequirements; // 0x150 [Size: 0x20]
	uint8_t pad_170[0x10]; // 0x170
	FGameplayTagContainer CampPersistentTagsCopy; // 0x180 [Size: 0x20]
	uint8_t pad_1a0[0x4]; // 0x1a0
	FGameplayTag CampBiomeTag; // 0x1a4 [Size: 0x4]
	uint8_t pad_1a8[0x38]; // 0x1a8
	FJunoAwesomePointModificationData CachedAwesomePointModificationData; // 0x1e0 [Size: 0x28]
	FJunoAwesomeLevelChangeData CachedAwesomeLevelChangeData; // 0x208 [Size: 0x20]
	bool bNonResourceRequirementsMet : 1; // 0x228 [Mask: 0x1] [Bit: 0]
	bool bSkipAwesomeUpgradeResourceChecks : 1; // 0x228 [Mask: 0x2] [Bit: 1]
	bool bCanEverUpgrade : 1; // 0x229 [Mask: 0x1] [Bit: 0]
	bool bIsReadyForUse : 1; // 0x229 [Mask: 0x2] [Bit: 1]
	bool bIsFromPersistence : 1; // 0x229 [Mask: 0x4] [Bit: 2]
	uint8_t pad_22a[0x6]; // 0x22a
	TArray<AwesomeLevelRewardEntry> AwesomeLevelRewardEntries; // 0x230 [Size: 0x10]
};


struct UJunoCampAIManagementComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FJunoCampAICachedRecruitmentData CachedAndReplicatedRecruitmentData; // 0xd8 [Size: 0x30]
};


struct UJunoCampCenterComponent
{
public:
	uint8_t pad_0[0x160]; // 0x0
	FGuid LinkedCampActorID; // 0x160 [Size: 0x10]
	uint8_t pad_170[0x18]; // 0x170
	AJunoCampActor* CampActorCache; // 0x188 [Size: 0x8]
};


struct UJunoCampMembershipActorComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	AJunoCampActor* BoundCamp; // 0x128 [Size: 0x8]
};


struct UJunoCampRecruitmentComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	TArray<ActiveCampNPCEntry> ActiveNPCEntries; // 0x108 [Size: 0x10]
	TArray<ActiveCampCreatureEntry> ActiveCreatureEntries; // 0x118 [Size: 0x10]
};


struct UJunoCampRecruitmentObjectComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	bool bIsEnabled : 1; // 0x120 [Mask: 0x1] [Bit: 0]
	uint8_t pad_121[0x7]; // 0x121
	FJunoRecruitmentObjectAssignedData CachedAssignedData; // 0x128 [Size: 0x78]
};


struct UJunoCampRemovalStatusComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FJunoCampRemovalStatusData CampRemovalStatusData; // 0x100 [Size: 0xc]
};


struct UJunoClientAtomicReplacementComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FGuid Guid; // 0xc0 [Size: 0x10]
	AJunoPersistentPlayspace* TargetPlayspace; // 0xd0 [Size: 0x8]
};


struct UJunoComponent_HealthIndicator
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	float Health; // 0xf0 [Size: 0x4]
	float MaxHealth; // 0xf4 [Size: 0x4]
	float CurrentShield; // 0xf8 [Size: 0x4]
	float Shield; // 0xfc [Size: 0x4]
	bool bHasEverHadShield : 1; // 0x100 [Mask: 0x1] [Bit: 0]
	uint8_t pad_101[0x3]; // 0x101
	float OverpoweredThreshold; // 0x104 [Size: 0x4]
};


struct UJunoConnectivityComponent
{
public:
	uint8_t pad_0[0x138]; // 0x0
	bool bAreDoorsEjected : 1; // 0x138 [Mask: 0x1] [Bit: 0]
	uint8_t pad_139[0x30]; // 0x139
	bool bIsDebris : 1; // 0x169 [Mask: 0x1] [Bit: 0]
};


struct UJunoConnectivityManagerComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	FJunoConnectivityDebugData DebugDrawData; // 0x118 [Size: 0x38]
};


struct UJunoControlChannelComponent
{
public:
	uint8_t pad_0[0x158]; // 0x0
	AJunoClusterUnionActor* SourceClusterUnionActor; // 0x158 [Size: 0x8]
};


struct UJunoControllerComponent
{
public:
	uint8_t pad_0[0x300]; // 0x0
	FGuid ItemSelectedGuid; // 0x300 [Size: 0x10]
	bool bSpawnedBackpack : 1; // 0x310 [Mask: 0x1] [Bit: 0]
	uint8_t pad_311[0x7]; // 0x311
	FVector BackpackSpawnLocation; // 0x318 [Size: 0x18]
};


struct UJunoControllerComponent_AccountItemsUnlock
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	TArray<FPrimaryAssetId> ServerUnlockedItemsCache; // 0xf0 [Size: 0x10]
};


struct UJunoControllerComponent_BedAssignmentNetworkEvents
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FJunoReplicatedCharacterData ReplicatedCharacterData; // 0xe0 [Size: 0x28]
};


struct UJunoControllerComponent_CraftingNetworkEvents
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	Actor* LastUpgradedActor; // 0xe8 [Size: 0x8]
};


struct UJunoCreativeFlightComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	bool bIsCreativeFlightEnabled : 1; // 0xd0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d1[0x7]; // 0xd1
	TArray<FJunoPlayerCreativeFlightState> PlayerCreativeFlightStates; // 0xd8 [Size: 0x10]
};


struct UJunoCreaturePawnComponent
{
public:
	uint8_t pad_0[0x220]; // 0x0
	FText CachedAndReplicatedCustomName; // 0x220 [Size: 0x10]
};


struct UJunoDamageSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData ArmorPenetration; // 0x30 [Size: 0x28]
};


struct UJunoFreeBuildComponent
{
public:
	uint8_t pad_0[0xc4]; // 0x0
	bool bIsFreeBuildEnabled : 1; // 0xc4 [Mask: 0x1] [Bit: 0]
	bool bIsItemSpawnerEnabled : 1; // 0xc5 [Mask: 0x1] [Bit: 0]
	bool bIsFreeBuildCostFilteringEnabled : 1; // 0xc6 [Mask: 0x1] [Bit: 0]
	bool bIsKnowledgeFilteringEnabled : 1; // 0xc7 [Mask: 0x1] [Bit: 0]
	bool bWasFreeBuildEverEnabled : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
};


struct UJunoGameStateComponent_Codex
{
public:
	uint8_t pad_0[0xdc]; // 0x0
	bool bIsCodexEnabled : 1; // 0xdc [Mask: 0x1] [Bit: 0]
};


struct UJunoGameStateComponent_GameEventStream
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FJunoGameEventsFastArray GameEventEntries; // 0xc8 [Size: 0x88]
};


struct UJunoGameStateComponent_WorldReactionsManager
{
public:
	uint8_t pad_0[0x248]; // 0x0
	FGameplayTagContainer ReplicatedWorldStates; // 0x248 [Size: 0x20]
};


struct UJunoGuidedBuildingInteractionComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	AJunoGuidedBuildingActor* ParentBuilding; // 0xc8 [Size: 0x8]
};


struct UJunoInventoryAggregateComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	TArray<UJunoInventoryComponent*> InventoryArray; // 0xc8 [Size: 0x10]
};


struct UJunoInventoryComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	FGameplayTagContainer TypeTags; // 0x118 [Size: 0x20]
	uint8_t pad_138[0x4]; // 0x138
	bool bEnabledAsCraftingSource : 1; // 0x13c [Mask: 0x8] [Bit: 3]
	uint8_t pad_13d[0x33]; // 0x13d
	FJunoInventoryHandle InventoryHandle; // 0x170 [Size: 0x24]
	uint8_t pad_194[0x44]; // 0x194
	FJunoReplicatedItemSlotList ReplicatedItemSlotData; // 0x1d8 [Size: 0x68]
	uint8_t pad_240[0x30]; // 0x240
	TArray<FJunoSelectedSlotData> SelectedItemGroupSlots; // 0x270 [Size: 0x10]
};


struct UJunoKnowledgeComponent
{
public:
	uint8_t pad_0[0x1a2]; // 0x0
	bool bEnableKnowledgeFiltering : 1; // 0x1a2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1a3[0x1]; // 0x1a3
	bool bUnownedMCPRecipesKnowledgeBlockedWhenUnfiltered : 1; // 0x1a4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1a5[0x5b]; // 0x1a5
	FGameplayTagContainer ClaimedKnowlegeBundles; // 0x200 [Size: 0x20]
	uint8_t pad_220[0x18]; // 0x220
	FJunoKnowledgeRecipeStateFastArray RecipeStateArray; // 0x238 [Size: 0x60]
	uint8_t pad_298[0x78]; // 0x298
	TArray<UItemDefinitionBase*> ViewedItems; // 0x310 [Size: 0x10]
	TArray<FGuid> ViewedRecipes; // 0x320 [Size: 0x10]
	TArray<FGameplayTag> ViewedCreatures; // 0x330 [Size: 0x10]
	TArray<FGuid> OwnedMcpRecipes; // 0x340 [Size: 0x10]
	TArray<FJunoKnowledgeReplicatedRecipeDiscoverer> RecipeDiscoverers; // 0x350 [Size: 0x10]
	uint8_t pad_360[0x10]; // 0x360
	bool bMCPRecipesBlocked : 1; // 0x370 [Mask: 0x1] [Bit: 0]
	bool bComponentReady : 1; // 0x371 [Mask: 0x1] [Bit: 0]
};


struct UJunoLandscapeVisualModifierComponent
{
public:
	uint8_t pad_0[0x260]; // 0x0
	enum EJunoLandscapeVisualModifierType VisualModifierType; // 0x260 [Size: 0x1]
};


struct UJunoMapManagerComponent_Storms
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	TArray<FJunoStormMapLocation> StormLocations; // 0xd8 [Size: 0x10]
};


struct UJunoMeshNetworkWeatherComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	TArray<FJunoSynchronizedWeatherState> SynchronizedWeatherStates; // 0xf0 [Size: 0x10]
};


struct UJunoMinifigAnimationComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FRotator MinifigLookAtRotation; // 0xc8 [Size: 0x18]
};


struct UJunoModeratorModeComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	bool bIsModeratorModeEnabled : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
	bool bIsPlayerAllowedToFly : 1; // 0xc9 [Mask: 0x1] [Bit: 0]
};


struct UJunoMultiCraftingComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	TArray<FCraftingProcess> CraftingProcesses; // 0x120 [Size: 0x10]
	uint8_t pad_130[0x20]; // 0x130
	bool bIsCraftingBlocked : 1; // 0x150 [Mask: 0x1] [Bit: 0]
};


struct UJunoNPCConversationParticipantComponent
{
public:
	uint8_t pad_0[0x668]; // 0x0
	UTexture2D* ParticipantIconSmall; // 0x668 [Size: 0x20]
	UTexture2D* ParticipantIconWide; // 0x688 [Size: 0x20]
};


struct UJunoNPCPawnComponent_Speech
{
public:
	uint8_t pad_0[0x148]; // 0x0
	FJunoNPCSpeechResults RunningResult; // 0x148 [Size: 0x68]
};


struct UJunoNamedPOIComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FText POIName; // 0x108 [Size: 0x10]
	uint8_t pad_118[0x8]; // 0x118
	FJunoMarker Marker; // 0x120 [Size: 0x108]
	FGuid MarkerId; // 0x228 [Size: 0x10]
};


struct UJunoPassiveCraftingComponent
{
public:
	uint8_t pad_0[0xfc]; // 0x0
	bool bIsAutoCrafting : 1; // 0xfc [Mask: 0x1] [Bit: 0]
	uint8_t pad_fd[0x3]; // 0xfd
	FName AutoCraftingFormulaRow; // 0x100 [Size: 0x4]
};


struct UJunoPawnComponentMood
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	FJunoMoodStateData CurrentMoodState; // 0xf8 [Size: 0x4]
	uint8_t pad_fc[0x4]; // 0xfc
	UProxyTable* MoodAnimProxyTable; // 0x100 [Size: 0x8]
	uint8_t pad_108[0x8]; // 0x108
	bool bIsMoodReactionActive : 1; // 0x110 [Mask: 0x1] [Bit: 0]
};


struct UJunoPawnComponent_EmotionalState
{
public:
	uint8_t pad_0[0x108]; // 0x0
	enum EJunoPawnEmotionalState CurrentEmotionalState; // 0x108 [Size: 0x1]
	uint8_t pad_109[0x3]; // 0x109
	FJunoEmotionalStateData TargetEmotionalState; // 0x10c [Size: 0x10]
	uint8_t CheatEmotionIndex; // 0x11c [Size: 0x1]
};


struct UJunoPawnStrafeComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	bool bStrafeEnabled : 1; // 0xf8 [Mask: 0x1] [Bit: 0]
};


struct UJunoPhysicsToyAbilities
{
public:
	uint8_t pad_0[0x160]; // 0x0
	TArray<FJunoPhysicsToysAbilityBoundChannels> BoundControlChannels; // 0x160 [Size: 0x10]
	TArray<FJunoPhysicsToysAbilityKeyInt> SaveDataKeyInt; // 0x170 [Size: 0x10]
	bool bPersistentDataReady : 1; // 0x180 [Mask: 0x1] [Bit: 0]
};


struct UJunoPlayerBuildingComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	bool bHasSeenItemShopCallout : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c9[0x7f]; // 0xc9
	FJunoSelectedSlot ReplicatedSelectedSlot; // 0x148 [Size: 0x30]
	uint8_t pad_178[0x3c]; // 0x178
	AJunoGuidedBuildingActor* ReplicatedLastGuidedBuildingActor; // 0x1b4 [Size: 0x8]
	float ReplicateLastGuidedActorTime; // 0x1bc [Size: 0x4]
	float ReplicateBuildingMetricSpatialPrecision; // 0x1c0 [Size: 0x4]
	uint8_t pad_1c4[0x24]; // 0x1c4
	FJunoMCPItemPlacementStatus MCPItemPlacementStatus; // 0x1e8 [Size: 0xc]
	uint8_t pad_1f4[0xe4]; // 0x1f4
	TArray<FJunoBuildingMetricsClientPermissions> ClientSpatialMetricsBuildingPermissions; // 0x2d8 [Size: 0x10]
};


struct UJunoPlayerControllerComponent_SessionAnalytics
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FGuid JunoPlaySessionID; // 0xd0 [Size: 0x10]
};


struct UJunoPlayerLifetimeStatsComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	int AccumulatedTimePlayedSeconds; // 0xc8 [Size: 0x4]
};


struct UJunoPlayerStateComponent_PlayerReactionsManager
{
public:
	uint8_t pad_0[0x1b0]; // 0x0
	TArray<FName> CachedTriggeredReactions; // 0x1b0 [Size: 0x10]
};


struct UJunoPlayspaceControllerComponent_PlayerSpawning
{
public:
	uint8_t pad_0[0x188]; // 0x0
	bool bHasPlayerRespawnedFromDeath : 1; // 0x188 [Mask: 0x1] [Bit: 0]
};


struct UJunoPlayspaceRandomStreamComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	int PlayspaceRandomSeed; // 0x118 [Size: 0x4]
};


struct UJunoQuestGiverComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FString GrantableQuestID; // 0xc0 [Size: 0x10]
};


struct UJunoTemperatureAttributeSet
{
public:
	uint8_t pad_0[0x50]; // 0x0
	FortGameplayAttributeData Temperature; // 0x50 [Size: 0x28]
	FortGameplayAttributeData ColdResistance; // 0x78 [Size: 0x28]
	FortGameplayAttributeData HeatResistance; // 0xa0 [Size: 0x28]
	FGameplayTag CurrentTemperature; // 0xc8 [Size: 0x4]
	uint8_t pad_cc[0x4]; // 0xcc
	TArray<FTemperatureRange> TemperatureRanges; // 0xd0 [Size: 0x10]
};


struct UJunoWeatherLocationComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FJunoWeatherLocation Location; // 0xf0 [Size: 0x68]
};


struct UJunoWeatherStateComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FJunoWeatherLocation Location; // 0xf0 [Size: 0x68]
	uint8_t pad_158[0x10]; // 0x158
	FJunoWeatherPhase CurrentWeatherPhase; // 0x168 [Size: 0x38]
	FJunoWeatherPhase NextWeatherPhase; // 0x1a0 [Size: 0x38]
	TArray<FJunoWeatherPhase> NextWeatherQueue; // 0x1d8 [Size: 0x10]
};


struct UJunoWorldSettingsComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	TArray<FJunoWorldSettingRepState> WorldSettings; // 0xe0 [Size: 0x10]
	uint8_t pad_f0[0x10]; // 0xf0
	bool bAreWorldSettingsLoaded : 1; // 0x100 [Mask: 0x1] [Bit: 0]
	bool bCanWorldSettingsTaint : 1; // 0x101 [Mask: 0x1] [Bit: 0]
};


struct UPlayspaceComponent_JunoRootCampManagement
{
public:
	uint8_t pad_0[0x2c0]; // 0x0
	TArray<FReplicatedCampData> ReplicatedCampDatas; // 0x2c0 [Size: 0x10]
	TArray<FReplicatedCampAreaReservationData> ReplicatedCampAreaReservationDatas; // 0x2d0 [Size: 0x10]
	uint8_t pad_2e0[0x48]; // 0x2e0
	TArray<FPOIEncounterDataForCamps> ActivePOIEncounters; // 0x328 [Size: 0x10]
};


struct UControllableRidableComponent
{
public:
	uint8_t pad_0[0x5c0]; // 0x0
	bool bIsBeingControlled : 1; // 0x5c0 [Mask: 0x1] [Bit: 0]
};


struct UControllingRiderComponent
{
public:
	uint8_t pad_0[0x719]; // 0x0
	bool bIsControllingRidable : 1; // 0x719 [Mask: 0x1] [Bit: 0]
	uint8_t pad_71a[0x1a]; // 0x71a
	FRidingControlInputStateReliable ReplicatedControlInputStateReliable; // 0x734 [Size: 0x1]
	FRidingControlInputStateUnreliable ReplicatedControlInputStateUnreliable; // 0x735 [Size: 0x2]
};


struct URidableComponent
{
public:
	uint8_t pad_0[0x2c8]; // 0x0
	URiderComponent* ActiveRider; // 0x2c8 [Size: 0x8]
};


struct URiderComponent
{
public:
	uint8_t pad_0[0x2b0]; // 0x0
	URidableComponent* ActiveRidable; // 0x2b0 [Size: 0x8]
	uint8_t pad_2b8[0x2b0]; // 0x2b8
	FRidableControlRuntimeData RidableControlRuntimeData; // 0x568 [Size: 0x40]
	bool bIsSprintingReplay : 1; // 0x5a8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5a9[0xc7]; // 0x5a9
	bool bPreventExitRidingFromInput : 1; // 0x670 [Mask: 0x1] [Bit: 0]
};


struct ULFNControllerComponent_GameTravel
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FLFNGameTravelInfo CurrentGameTravelInfo; // 0xc0 [Size: 0x30]
};


struct ULFNControllerComponent_ContentModerationSender
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FString SubmittedReportId; // 0xc0 [Size: 0x10]
};


struct UJunoStaminaAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FGameplayAttributeData MaxStamina; // 0x30 [Size: 0x10]
	FGameplayAttributeData MinimumStaminaForUsing; // 0x40 [Size: 0x10]
	FGameplayAttributeData StaminaRechargeAmountPerSecond; // 0x50 [Size: 0x10]
	FGameplayAttributeData StaminaRechargeDelaySeconds; // 0x60 [Size: 0x10]
	FGameplayAttributeData StaminaRechargePercentageLimit; // 0x70 [Size: 0x10]
	FGameplayAttributeData StaminaUsageMultiplier; // 0x80 [Size: 0x10]
};


struct UJunoStaminaComponent
{
public:
	uint8_t pad_0[0x370]; // 0x0
	bool bIsStaminaUsageBlocked : 1; // 0x370 [Mask: 0x10] [Bit: 4]
	bool bAllStaminaUsageIsFree : 1; // 0x370 [Mask: 0x20] [Bit: 5]
};


struct AJunoPersistentPlayspace
{
public:
	uint8_t pad_0[0x6ec]; // 0x0
	FName PersistenceMainLevelUniquePackageName; // 0x6ec [Size: 0x4]
	ULevel* PersistenceMainLevelWeakPtr; // 0x6f0 [Size: 0x8]
};


struct FortAthenaJethroVehicle
{
public:
	uint8_t pad_0[0x28fc]; // 0x0
	FJethroVehicleStatus JethroVehicleStatus; // 0x28fc [Size: 0xc]
	uint8_t pad_2908[0x1f4]; // 0x2908
	uint8_t CurrentWeaponMuzzleSocketIndex; // 0x2afc [Size: 0x1]
};


struct FortAthenaMutator_BackFillControl
{
public:
	uint8_t pad_0[0x308]; // 0x0
	uint8_t ControlFlowIndex; // 0x308 [Size: 0x1]
	uint8_t pad_309[0x3]; // 0x309
	int MinPlayersForBackfill; // 0x30c [Size: 0x4]
	int MaxPlayersForBackfill; // 0x310 [Size: 0x4]
	bool bIsGameSessionInBackfillMode : 1; // 0x314 [Mask: 0x1] [Bit: 0]
	uint8_t pad_315[0x3]; // 0x315
	int NumPlayers; // 0x318 [Size: 0x4]
};


struct FortAthenaMutator_DestroyActorsAndComponents
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	TArray<FDestroyActorsAndComponentsMutator_ActorDefinition> ActorDefinitions; // 0x2e0 [Size: 0x10]
};


struct FortAthenaMutator_FakeKillRelevancy
{
public:
	uint8_t pad_0[0x490]; // 0x0
	TArray<FakeKillRelevancyPhaseData> RelevancyPhaseDataArray; // 0x490 [Size: 0x10]
	int PhaseNum; // 0x4a0 [Size: 0x4]
};


struct FortAthenaMutator_SE_BlockGlider
{
public:
	uint8_t pad_0[0x2f2]; // 0x0
	bool bDisableGlider : 1; // 0x2f2 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_SE_BlockNativeActions
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	FGameplayTagContainer BlockedNativeActions; // 0x2f0 [Size: 0x20]
};


struct FortAthenaMutator_SE_Respawn
{
public:
	uint8_t pad_0[0x468]; // 0x0
	FortAthenaMutator_SE_Respawn_AllowedPlayers AllowedPlayers; // 0x468 [Size: 0x58]
};


struct FortAthenaMutator_SpecialEvent
{
public:
	uint8_t pad_0[0x3b8]; // 0x0
	bool bPlayersAreInvincible : 1; // 0x3b8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3b9[0xef]; // 0x3b9
	FortAthenaAircraft* EventAircraft; // 0x4a8 [Size: 0x8]
	uint8_t pad_4b0[0x50]; // 0x4b0
	bool bDisableHUD : 1; // 0x500 [Mask: 0x1] [Bit: 0]
	uint8_t GameResumed; // 0x501 [Size: 0x1]
	uint8_t pad_502[0x6]; // 0x502
	FVector AdditionalViewpoint; // 0x508 [Size: 0x18]
	bool bParachutesDisabled : 1; // 0x520 [Mask: 0x1] [Bit: 0]
	uint8_t pad_521[0x7]; // 0x521
	FString LastCSVEventName; // 0x528 [Size: 0x10]
	bool bCanStreamBuildingFoundationsIn : 1; // 0x538 [Mask: 0x1] [Bit: 0]
	uint8_t pad_539[0x3]; // 0x539
	int AllPlayerTeleportedCount; // 0x53c [Size: 0x4]
	FortDelayRTMMData DelayPlayersFromReturningToLobbyData; // 0x540 [Size: 0x10]
	uint8_t pad_550[0x48]; // 0x550
	FGameplayTagContainer BlockedNativeActions; // 0x598 [Size: 0x20]
	uint8_t pad_5b8[0x10]; // 0x5b8
	bool bLockingOnFocalPoint : 1; // 0x5c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5c9[0x57]; // 0x5c9
	TArray<FSpecialEventMapData> TerrainMapsToUnload; // 0x620 [Size: 0x10]
};


struct FortAthenaMutator_SpecialEventTODM
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	int PhaseIndexInProgress; // 0x2f8 [Size: 0x4]
	int SubphaseIndexInProgress; // 0x2fc [Size: 0x4]
	uint8_t pad_300[0x8]; // 0x300
	InterfaceProperty SpawnedTODM; // 0x308 [Size: 0x10]
	bool bDebug : 1; // 0x318 [Mask: 0x1] [Bit: 0]
};


struct APreEventManager
{
public:
	uint8_t pad_0[0x330]; // 0x0
	int CurrentPhaseIndex; // 0x330 [Size: 0x4]
};


struct ASpecialEventBackfillManager
{
public:
	uint8_t pad_0[0x298]; // 0x0
	enum ESpecialEventBackfillManagerState BackfillState; // 0x298 [Size: 0x1]
};


struct ASpecialEventMeshLeaderboardManager
{
public:
	uint8_t pad_0[0x300]; // 0x0
	FMeshLeaderboardConfig LeaderboardConfig; // 0x300 [Size: 0x18]
	FortMeshLeaderboardPlayerDataArray GlobalLeaderboardPlayerDatas; // 0x318 [Size: 0x78]
	FortMeshLeaderboardPlayerDataArray LocalLeaderboardPlayerDatas; // 0x390 [Size: 0x78]
	uint8_t pad_408[0x10]; // 0x408
	float ScoreToEnterGlobalLeaderboard; // 0x418 [Size: 0x4]
};


struct ASpecialEventMeshMetadataExampleActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	ExampleMetadataStruct MetadataExampleStruct; // 0x270 [Size: 0x18]
};


struct ASpecialEventPhase
{
public:
	uint8_t pad_0[0x310]; // 0x0
	ASpecialEventScript* SpecialEventScript; // 0x310 [Size: 0x8]
	enum ESpecialEventPhaseState PhaseState; // 0x318 [Size: 0x1]
};


struct ASpecialEventScript
{
public:
	uint8_t pad_0[0x2c8]; // 0x0
	TArray<FPhaseInfo> PhaseInfoArray; // 0x2c8 [Size: 0x10]
	uint8_t pad_2d8[0x1f0]; // 0x2d8
	int ReplicatedActivePhaseIndex; // 0x4c8 [Size: 0x4]
	uint8_t pad_4cc[0x3c]; // 0x4cc
	bool bShouldActivateNightNight : 1; // 0x508 [Mask: 0x1] [Bit: 0]
};


struct ASpecialEventScriptMeshActor
{
public:
	uint8_t pad_0[0x298]; // 0x0
	FDateTime RootStartTime; // 0x298 [Size: 0x8]
	bool bIsNightNightEnabled : 1; // 0x2a0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2a1[0x3]; // 0x2a1
	int MaxEventPlaybackCount; // 0x2a4 [Size: 0x4]
	bool bCameraShiftEnabled : 1; // 0x2a8 [Mask: 0x1] [Bit: 0]
	bool bExitScreenDisabled : 1; // 0x2a9 [Mask: 0x1] [Bit: 0]
	bool bExitButtonDisabled : 1; // 0x2aa [Mask: 0x1] [Bit: 0]
	bool bPlaybackButtonDisabled : 1; // 0x2ab [Mask: 0x1] [Bit: 0]
	uint8_t pad_2ac[0x4]; // 0x2ac
	FString PlaybackVuid; // 0x2b0 [Size: 0x10]
	bool bDisableBackfill : 1; // 0x2c0 [Mask: 0x1] [Bit: 0]
	bool bActivateSafeZoneMutator : 1; // 0x2c1 [Mask: 0x1] [Bit: 0]
	bool bPauseSafeZonesAtIndex : 1; // 0x2c2 [Mask: 0x1] [Bit: 0]
	bool bPawnsCanBeDamaged : 1; // 0x2c3 [Mask: 0x1] [Bit: 0]
	FGameplayTag InitialPreEventPhase; // 0x2c4 [Size: 0x4]
	int TeleportPlayersToSafeZoneRequestId; // 0x2c8 [Size: 0x4]
	uint8_t pad_2cc[0x4]; // 0x2cc
	FString ForceEmoteTemplateId; // 0x2d0 [Size: 0x10]
	int ForceEmoteRequestId; // 0x2e0 [Size: 0x4]
	uint8_t pad_2e4[0x20]; // 0x2e4
	float SafeZoneFinalLocationXCoord; // 0x304 [Size: 0x4]
	float SafeZoneFinalLocationYCoord; // 0x308 [Size: 0x4]
	bool bSafeZoneFinalLocationSet : 1; // 0x30c [Mask: 0x1] [Bit: 0]
	uint8_t pad_30d[0x3]; // 0x30d
	int SafeZonePhaseToForcePause; // 0x310 [Size: 0x4]
	bool bExcludeBotsFromInvulnerability : 1; // 0x314 [Mask: 0x1] [Bit: 0]
	uint8_t pad_315[0x7]; // 0x315
	bool bForceAllSafeZonesToFinalLocation : 1; // 0x31c [Mask: 0x1] [Bit: 0]
	uint8_t pad_31d[0x3]; // 0x31d
	float TeleportRingRadius; // 0x320 [Size: 0x4]
	bool bTeleportExcludePlayersAlreadyInRadius : 1; // 0x324 [Mask: 0x1] [Bit: 0]
	bool bUseRingRadiusForExclusion : 1; // 0x325 [Mask: 0x1] [Bit: 0]
};


struct UDamageRecordEntry
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float DamageTotal; // 0xc0 [Size: 0x4]
	float EndReplicationTime; // 0xc4 [Size: 0x4]
	FGameplayTagContainer DamageTags; // 0xc8 [Size: 0x20]
	FGameplayEffectContextHandle EffectContext; // 0xe8 [Size: 0x18]
};


struct FortCharacterMovementMutatorComponent
{
public:
	uint8_t pad_0[0x330]; // 0x0
	Actor* BuffetBubblesFollowActor; // 0x330 [Size: 0x8]
	FVector BuffetBubblesInitialFollowBoxOffsetPercent; // 0x338 [Size: 0x18]
	uint8_t pad_350[0xe0]; // 0x350
	FBuffetBubblesReplicatedData BuffetBubblesReplicatedData; // 0x430 [Size: 0x80]
	uint8_t pad_4b0[0x2b0]; // 0x4b0
	FTransform BuffetBubblesIntroTargetTransform; // 0x760 [Size: 0x60]
	uint8_t pad_7c0[0x90]; // 0x7c0
	float BuffetFlyingMaxSpeedOverride; // 0x850 [Size: 0x4]
	float BuffetFlyingMaxSpeedInterpSpeed; // 0x854 [Size: 0x4]
	uint8_t pad_858[0x4]; // 0x858
	float BuffetFlyingVelocityDirectionInterpSpeedOverride; // 0x85c [Size: 0x4]
	uint8_t pad_860[0xc0]; // 0x860
	FBuffetFlyingRicochetReplicatedData BuffetFlyingRicochetReplicatedData; // 0x920 [Size: 0x20]
};


struct FortControllerComponent_FakeKillRelevancy
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FakeKillRelevancyPlayerDataArray PlayerDataArray; // 0xc8 [Size: 0x60]
	uint8_t pad_128[0x10]; // 0x128
	uint8_t ResetCounter; // 0x138 [Size: 0x1]
	uint8_t pad_139[0x7]; // 0x139
	TArray<FortPlayerStateAthena*> DebugSupergroupPlayerStates; // 0x140 [Size: 0x10]
};


struct FortControllerComponent_GameplayCinematic
{
public:
	uint8_t pad_0[0x118]; // 0x0
	bool bIsReadyForGameplay : 1; // 0x118 [Mask: 0x1] [Bit: 0]
};


struct FortSpecialRelevancyAttachComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	USceneComponent* AttachComponent; // 0xf8 [Size: 0x8]
};


struct USpecialEventCursorPawnComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	bool bAllowOnNonOwningClients : 1; // 0xd8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d9[0x5f]; // 0xd9
	FSpecialEventCursorStackEntry ReplicatedCursorStackEntry; // 0x138 [Size: 0xc]
	uint8_t pad_144[0xcc]; // 0x144
	FVector ReplicatedWorldLocation; // 0x210 [Size: 0x18]
};


struct USpecialEventCursorWeaponComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	USpecialEventCursorPawnComponent* CursorPawnComponent; // 0xf0 [Size: 0x8]
};


struct USpecialEventMeshLeaderboardNetworkComponent
{
public:
	uint8_t pad_0[0x10c]; // 0x0
	float RequestRate; // 0x10c [Size: 0x4]
};


struct USpecialEventRewindComponent
{
public:
	uint8_t pad_0[0xdc]; // 0x0
	FSpecialEventRewindComponentStateData StateData; // 0xdc [Size: 0x8]
	float ReplicatedRewindDuration; // 0xe4 [Size: 0x4]
};


struct USpecialEventRewindComponent_PlayerPawn
{
public:
	uint8_t pad_0[0x110]; // 0x0
	FSpecialEventRewindComponentRecording_PlayerPawn ReplicatedRecording; // 0x110 [Size: 0x20]
	uint8_t pad_130[0x58]; // 0x130
	FSpecialEventRewindComponentRecordingFastArray_PlayerPawn ReplicatedRecordingFastArray; // 0x188 [Size: 0x58]
};


struct USpecialEventStatComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FSpecialEventStatArray StatFastArray; // 0xe0 [Size: 0x60]
};


struct USpecialRelevancyHealthComponent
{
public:
	uint8_t pad_0[0xfc]; // 0x0
	float OwnerMaxHealthCached; // 0xfc [Size: 0x4]
};


struct UJamFabricBridgePlayspaceComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	enum EJamFabricSyncType SyncType; // 0xe8 [Size: 0x1]
};


struct AInventoryDebugMenu
{
public:
	uint8_t pad_0[0x428]; // 0x0
	Actor* MonitoredActor; // 0x428 [Size: 0x8]
	FRootInventoryDebugSnapshot ServerDebugSnapshot; // 0x430 [Size: 0x10]
	FortInventoryDebugSnapshot ServerDebugSnapshot_FortInventory; // 0x440 [Size: 0x28]
};


struct APropertyInterfaceDebugger
{
public:
	uint8_t pad_0[0x428]; // 0x0
	Object* MonitoredPropertyInterface; // 0x428 [Size: 0x8]
	FPropertyInterfaceDebugSnapshot ServerDebugSnapshot; // 0x430 [Size: 0x38]
};


struct UImmunityCarriage_InteractionComponent
{
public:
	uint8_t pad_0[0x3d4]; // 0x0
	int HandleIntoGameState; // 0x3d4 [Size: 0x4]
	enum ESpawnMachineState SpawnMachineState; // 0x3d8 [Size: 0x1]
	uint8_t pad_3d9[0x2]; // 0x3d9
	bool bIsInsideSafeZone : 1; // 0x3db [Mask: 0x1] [Bit: 0]
};


struct AIceGroundPath
{
public:
	uint8_t pad_0[0x288]; // 0x0
	TArray<FVector_NetQuantize> SplinePoints; // 0x288 [Size: 0x10]
};


struct UHoverAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData MaxFuel; // 0x38 [Size: 0x28]
	FortGameplayAttributeData Fuel; // 0x60 [Size: 0x28]
};


struct FortHoagieVehicle
{
public:
	uint8_t pad_0[0x2418]; // 0x0
	int HoagieStateRep; // 0x2418 [Size: 0x4]
	uint8_t pad_241c[0xbc]; // 0x241c
	FReplicatedHeliControlState ControlState; // 0x24d8 [Size: 0x30]
};


struct FortPlayerStateComponent_HazelnutSpreadPersistence
{
public:
	uint8_t pad_0[0x208]; // 0x0
	bool Gameplay_bIsActivated : 1; // 0x208 [Mask: 0x1] [Bit: 0]
	uint8_t pad_209[0x3]; // 0x209
	int Gameplay_NumBounties; // 0x20c [Size: 0x4]
	int Gameplay_BountyCurrency; // 0x210 [Size: 0x4]
};


struct FortPlayerStateComponent_RivalsFaction
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FName PlayerFaction; // 0xc0 [Size: 0x4]
};


struct FortGrindRail
{
public:
	uint8_t pad_0[0xbc0]; // 0x0
	bool bDisableBooster : 1; // 0xbc0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_bc1[0x7]; // 0xbc1
	TArray<FName> ResolverScopes; // 0xbc8 [Size: 0x10]
	uint8_t pad_bd8[0x10]; // 0xbd8
	FortGrindRail* HeadConnectedRail; // 0xbe8 [Size: 0x20]
	FortGrindRail* TailConnectedRail; // 0xc08 [Size: 0x20]
};


struct FortDagwoodVehicle
{
public:
	uint8_t pad_0[0x2160]; // 0x0
	float FadeDuration; // 0x2160 [Size: 0x4]
	uint8_t pad_2164[0x2c]; // 0x2164
	float RechargeableBoostPercent; // 0x2190 [Size: 0x4]
	uint8_t pad_2194[0x1e4]; // 0x2194
	FDagwoodRuntimeModifiers DagwoodRuntimeModifiedProperties; // 0x2378 [Size: 0x70]
	TArray<AttachedWheel> ServerRepWheelData; // 0x23e8 [Size: 0x10]
	uint8_t pad_23f8[0x148]; // 0x23f8
	TArray<enum ETireStates> FakeTireStates; // 0x2540 [Size: 0x10]
	uint8_t pad_2550[0x1]; // 0x2550
	enum EPoppedTireReactionStates ReplicatedPoppedTireReaction; // 0x2551 [Size: 0x1]
	uint8_t pad_2552[0x32]; // 0x2552
	bool bIsInoperable : 1; // 0x2584 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2585[0x3]; // 0x2585
	int RandomSeed; // 0x2588 [Size: 0x4]
};


struct UDagwoodNetworkPhysicsComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FNetworkPhysicsState NetworkPhysicsState; // 0xc0 [Size: 0x90]
	uint8_t pad_150[0x10]; // 0x150
	FDagwoodManagedState ReplicatedManagedState; // 0x160 [Size: 0x508]
};


struct FortAbilityTask_ApplyRootMotionMantisForce
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float duration; // 0xc0 [Size: 0x4]
	uint8_t pad_c4[0x4]; // 0xc4
	AnimMontage* TechniqueMontage; // 0xc8 [Size: 0x8]
	FortMantisRootMotionWarpInfo WarpInfo; // 0xd0 [Size: 0x70]
	bool bIgnoreZAccumulate : 1; // 0x140 [Mask: 0x1] [Bit: 0]
};


struct FortMantisWeaponComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FortMantisReplicatedAnimInstanceInfo AnimInstanceInfo; // 0xd8 [Size: 0x10]
	FortMantisReplicatedAnimInstanceInfo ReplayAnimInstanceInfo; // 0xe8 [Size: 0x10]
};


struct FortPlayerStateComponent_TofuGarden
{
public:
	uint8_t pad_0[0x130]; // 0x0
	int CachedTofuGardenProgress; // 0x130 [Size: 0x4]
};


struct FortControllerComponent_PlaylistTravel
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortPlaylistTravelInfo CurrentGameTravelInfo; // 0xc0 [Size: 0x80]
};


struct FortOcclusionNetRelevancyServerDebug
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FortOcclusionNetRelevancyStats ServerCurrentStats; // 0x270 [Size: 0x50]
};


struct FortOcclusionClientStatsComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	int NumPawnsWithinRelevancyRange; // 0xc0 [Size: 0x4]
	int NumPawnsCulled; // 0xc4 [Size: 0x4]
	bool bServerSystemEnabled : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
	bool bServerUsingOcclusionFilter : 1; // 0xc9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_ca[0x6]; // 0xca
	TArray<FVector> OccludedLocations; // 0xd0 [Size: 0x10]
};


struct FortGenericMapManager
{
public:
	uint8_t pad_0[0x270]; // 0x0
	float TileSize; // 0x270 [Size: 0x4]
};


struct UPlayspaceComponent_FortGenericMapManager
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FortGenericMapManager* MapManager; // 0xd0 [Size: 0x8]
};


struct FortDelMarTrackSegmentBase
{
public:
	uint8_t pad_0[0x290]; // 0x0
	FortDelMarSplineSegmentInfo Info; // 0x290 [Size: 0xc0]
};


struct FortDelMarVehicle
{
public:
	uint8_t pad_0[0x2090]; // 0x0
	bool bLocalDriverHasReplicatedVehicle : 1; // 0x2090 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2091[0x77]; // 0x2091
	float DistanceToPack; // 0x2108 [Size: 0x4]
	float DistanceFromTrackFinish; // 0x210c [Size: 0x4]
	float RaceStatusSpeedModifier; // 0x2110 [Size: 0x4]
	uint8_t pad_2114[0x174]; // 0x2114
	bool bIdleFromNoInput : 1; // 0x2288 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2289[0x12f]; // 0x2289
	FortDelMarVehicleConfigOverrides ConfigOverrides; // 0x23b8 [Size: 0xa0]
	uint8_t pad_2458[0xcc0]; // 0x2458
	enum EFortDelMarInvertSteerMethod InvertSteerMethod; // 0x3118 [Size: 0x1]
	bool bPitchInverted : 1; // 0x3119 [Mask: 0x1] [Bit: 0]
	bool bVerticalKickflipInverted : 1; // 0x311a [Mask: 0x1] [Bit: 0]
	bool bAerialPitchActivationEnabled : 1; // 0x311b [Mask: 0x1] [Bit: 0]
	uint8_t pad_311c[0x504]; // 0x311c
	FortDelMarStartlineBoostData StartlineBoostData; // 0x3620 [Size: 0x14]
	uint8_t pad_3634[0xdc]; // 0x3634
	float TurboCharges; // 0x3710 [Size: 0x4]
	uint8_t pad_3714[0x154]; // 0x3714
	FVector ForcedReattachmentDirection; // 0x3868 [Size: 0x18]
	uint8_t pad_3880[0x128]; // 0x3880
	FortDelMarVehicleSpawnInfo SpawnInfo; // 0x39a8 [Size: 0x10]
	uint8_t pad_39b8[0x10]; // 0x39b8
	bool bAllowExitingVehicle : 1; // 0x39c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_39c9[0x97]; // 0x39c9
	bool bVehicleCollisionsEnabled : 1; // 0x3a60 [Mask: 0x1] [Bit: 0]
	bool bPawnCollisionsEnabled : 1; // 0x3a61 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3a62[0xe]; // 0x3a62
	bool bUsePredictiveInterpolation : 1; // 0x3a70 [Mask: 0x1] [Bit: 0]
};


struct FortDelMarVehicleMovementSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData AccelMultiplier; // 0x30 [Size: 0x28]
	FortGameplayAttributeData bVehicleThrottleDisabled; // 0x58 [Size: 0x28]
	FortGameplayAttributeData BonusSpeed; // 0x80 [Size: 0x28]
};


struct FortDelMarVehicleNetworkPhysicsComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FortDelMarVehicleReplicatedState ReplicatedState; // 0xd0 [Size: 0x290]
};


struct FortDelMarActorMover
{
public:
	uint8_t pad_0[0xb58]; // 0x0
	float ServerMovementStartTime; // 0xb58 [Size: 0x4]
};


struct FortDelMarTimeDelayedStateSequencer
{
public:
	uint8_t pad_0[0x2b4]; // 0x0
	bool bIsEnabled : 1; // 0x2b4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2b5[0x3]; // 0x2b5
	int CurrentStateIndex; // 0x2b8 [Size: 0x4]
};


struct FortDelMarGlobalInputDisabler
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FGameplayTagContainer DisabledInputTags; // 0xd8 [Size: 0x20]
};


struct FortDelMarPlayerAttachmentComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortPlayerState* AttachedPlayer; // 0xc0 [Size: 0x8]
};


struct FortDynamicPOIInjectionManager
{
public:
	uint8_t pad_0[0x1c0]; // 0x0
	FTransform ChosenInjectTransform; // 0x1c0 [Size: 0x60]
};


struct FortLevelInjectionManager
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	TArray<FortLevelInjectionRuntimeData> InjectedLevels; // 0xd8 [Size: 0x10]
};


struct FortLevelInjectionManagerBase
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortLevelInjectionRuntimeDataArray InjectedLevels; // 0xc0 [Size: 0x78]
};


struct FortAthenaMutator_FigmentEvents
{
public:
	uint8_t pad_0[0x380]; // 0x0
	bool bBuildingBlocked : 1; // 0x380 [Mask: 0x1] [Bit: 0]
	bool bGlobalEmoteBlock : 1; // 0x381 [Mask: 0x1] [Bit: 0]
	uint8_t pad_382[0xb]; // 0x382
	bool bDisableHUD : 1; // 0x38d [Mask: 0x1] [Bit: 0]
};


struct FortGameStateComponent_FeralCorgiManager
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	uint8_t TeamOneTeamId; // 0xd0 [Size: 0x1]
	uint8_t TeamTwoTeamId; // 0xd1 [Size: 0x1]
	enum EFeralCorgiTeam CurrentAttackingTeam; // 0xd2 [Size: 0x1]
	enum EFeralCorgiTeam RoundWinningTeam; // 0xd3 [Size: 0x1]
	enum EFeralCorgiTeamRole RoundWinningTeamRole; // 0xd4 [Size: 0x1]
};


struct FortGameStateComponent_FeralCorgiVerseCommonBridge
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FString CurrentPhaseName; // 0xc0 [Size: 0x10]
};


struct FortGameplayStateMachine
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FortGameplayStateTransitionData RootTransitionData; // 0xd8 [Size: 0x18]
};


struct FortFirstPersonMode_CameraController
{
public:
	uint8_t pad_0[0x468]; // 0x0
	float HeadMotionScalar; // 0x468 [Size: 0x4]
	bool bDisplayReticleWhileADS : 1; // 0x46c [Mask: 0x1] [Bit: 0]
	bool bDisplayAmmoCountWhileADS : 1; // 0x46d [Mask: 0x1] [Bit: 0]
};


struct ACreativeMoveToolPreviewEntity
{
public:
	uint8_t pad_0[0x908]; // 0x0
	Object* PreviewObject; // 0x908 [Size: 0x8]
};


struct APhoneToolEntityInteractionMode
{
public:
	uint8_t pad_0[0x430]; // 0x0
	TArray<FOriginalAndSpawnedEntityPair> NewlyPlacedEntities; // 0x430 [Size: 0x10]
	UObjectInteractionBehavior* ActiveBoundBehaviorReplicateToRemoteClients; // 0x440 [Size: 0x8]
	TArray<FCreativeSelectedEntityInfo> PlacementModeEntitiesReplicateToRemoteClients; // 0x448 [Size: 0x10]
};


struct ULightsaberBladeConfigComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FLightsaberMaterialParams MaterialParams; // 0xd0 [Size: 0x28]
};


struct AConversationEntityProxyActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	TArray<AController*> ControllersInConversation; // 0x270 [Size: 0x10]
	uint8_t pad_280[0x10]; // 0x280
	FLocalizableMessage SpeakerName; // 0x290 [Size: 0x30]
	Object* CachedConversationEntityComponent; // 0x2c0 [Size: 0x8]
};


struct UInstancedActorsComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FInstancedActorsInstanceHandle InstanceHandle; // 0xc0 [Size: 0xc]
};


struct UInstancedActorsData
{
public:
	uint8_t pad_0[0x1e0]; // 0x0
	FInstancedActorsDeltaList InstanceDeltas; // 0x1e0 [Size: 0x78]
};


struct UInstancedActorsModifierVolumeComponent
{
public:
	uint8_t pad_0[0x568]; // 0x0
	enum EInstancedActorsVolumeShape Shape; // 0x568 [Size: 0x1]
	uint8_t pad_569[0x7]; // 0x569
	FVector Extent; // 0x570 [Size: 0x18]
	float Radius; // 0x588 [Size: 0x4]
	uint8_t pad_58c[0x1c]; // 0x58c
	TArray<UWorld*> LevelsToIgnore; // 0x5a8 [Size: 0x10]
};


struct UMassAgentComponent
{
public:
	uint8_t pad_0[0x23c]; // 0x0
	FMassNetworkID NetID; // 0x23c [Size: 0x4]
};


struct FMBaseBoomboxComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FBoomboxState CurrentState; // 0x128 [Size: 0x28]
};


struct AJamDeck
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	UJamMusicSlot* InUseMusicSlot; // 0x2f8 [Size: 0x8]
	enum EFMJamLoopType DefaultLoopType; // 0x300 [Size: 0x1]
	uint8_t pad_301[0xb7]; // 0x301
	Object* PertinentJamSessionObject; // 0x3b8 [Size: 0x8]
	ActorComponent_JamSessionNotifier* JamSessionNotifier; // 0x3c0 [Size: 0x8]
};


struct UControllerComponent_StateDrivenReplication
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FLatestObjectRecordedStateTreeTransitionResult> LatestRecordedStateTreeTransitionResults; // 0xc0 [Size: 0x10]
};


struct FortActorComponent_StateDriven
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FortItemEntry SlottedItemEntry; // 0xd8 [Size: 0x98]
};


struct FortGameStateComponent_StateDrivenReplication
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	TArray<FLatestWorldRecordedStateTreeTransitionResult> LatestRecordedStateTreeTransitionResults; // 0xd0 [Size: 0x10]
};


struct UObjectInstancedStateTreeComponent
{
public:
	uint8_t pad_0[0x1a4]; // 0x0
	FInstancedStateTreeId InstancedStateTreeId; // 0x1a4 [Size: 0x4]
};


struct UWorldInstancedStateTreeComponent
{
public:
	uint8_t pad_0[0x17c]; // 0x0
	FInstancedStateTreeId InstancedStateTreeId; // 0x17c [Size: 0x4]
};


struct USparksPlayerStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum ESparksInstrumentType SparksInstrumentChoice; // 0xc0 [Size: 0x1]
};


struct AJamPlayspace
{
public:
	uint8_t pad_0[0x6f8]; // 0x0
	UJamSessionComponent_PlayerManager* JamPlayerManager; // 0x6f8 [Size: 0x8]
	uint8_t pad_700[0x8]; // 0x700
	UJamSessionComponent_AudioState* AudioState; // 0x708 [Size: 0x8]
	UJamSessionComponent_MusicManager* MusicManager; // 0x710 [Size: 0x8]
	uint8_t pad_718[0x10]; // 0x718
	UMusicTimeNetSyncComponent* NetSyncComponent; // 0x728 [Size: 0x8]
	FGuid JamSessionGuid; // 0x730 [Size: 0x10]
};


struct USparksInstrumentAnimPawnComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	Actor* StagePropActor; // 0xf0 [Size: 0x8]
};


struct USparksCameraDirectorComponent
{
public:
	uint8_t pad_0[0x168]; // 0x0
	bool bCamerasAreActive : 1; // 0x168 [Mask: 0x1] [Bit: 0]
};


struct AJamSessionActor
{
public:
	uint8_t pad_0[0x2b0]; // 0x0
	UJamSessionComponent_PlayerManager* JamPlayerManager; // 0x2b0 [Size: 0x8]
	uint8_t pad_2b8[0x8]; // 0x2b8
	UJamSessionComponent_AudioState* AudioState; // 0x2c0 [Size: 0x8]
	UJamSessionComponent_MusicManager* MusicManager; // 0x2c8 [Size: 0x8]
	uint8_t pad_2d0[0x8]; // 0x2d0
	UMusicTimeNetSyncComponent* NetSyncComponent; // 0x2d8 [Size: 0x8]
	uint8_t pad_2e0[0x30]; // 0x2e0
	FGuid JamSessionGuid; // 0x310 [Size: 0x10]
};


struct UJamMusicSlot
{
public:
	uint8_t pad_0[0x120]; // 0x0
	FJamPlayParams CurrentPlayParams; // 0x120 [Size: 0x60]
	uint8_t pad_180[0x60]; // 0x180
	UJamSessionComponent_MusicManager* JamMusicManager; // 0x1e0 [Size: 0x8]
	int NthSlot; // 0x1e8 [Size: 0x4]
	uint8_t pad_1ec[0x4]; // 0x1ec
	FGameplayTagContainer OwnedGameplayTags; // 0x1f0 [Size: 0x20]
	float StartAtSongSeconds; // 0x210 [Size: 0x4]
};


struct UJamSessionComponent_AudioState
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EMusicKey CurrentKey; // 0xc0 [Size: 0x1]
	enum EMusicKeyMode CurrentMode; // 0xc1 [Size: 0x1]
	uint8_t pad_c2[0x2]; // 0xc2
	int CurrentTempo; // 0xc4 [Size: 0x4]
};


struct UJamSessionComponent_MusicFXController
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	TArray<FJamMusicFXControlState> MusicFXControl_Slot0; // 0xc8 [Size: 0x10]
	TArray<FJamMusicFXControlState> MusicFXControl_Slot1; // 0xd8 [Size: 0x10]
	TArray<FJamMusicFXControlState> MusicFXControl_Slot2; // 0xe8 [Size: 0x10]
	TArray<FJamMusicFXControlState> MusicFXControl_Slot3; // 0xf8 [Size: 0x10]
};


struct UJamSessionComponent_MusicManager
{
public:
	uint8_t pad_0[0x1d0]; // 0x0
	TArray<UJamMusicSlot*> MusicSlots; // 0x1d0 [Size: 0x10]
};


struct UJamSessionComponent_PlayerManager
{
public:
	uint8_t pad_0[0x120]; // 0x0
	TArray<APawn*> PawnsInSession; // 0x120 [Size: 0x10]
	TArray<FJamSessionPMC_SpawnedComponentEntry> ServerOnlySpawnedComponents; // 0x130 [Size: 0x10]
};


struct FMInWorldKnobOptionsComponent
{
public:
	uint8_t pad_0[0x198]; // 0x0
	TArray<Object*> ReplicatedInWorldKnobInterfaceObjects; // 0x198 [Size: 0x10]
	TArray<Object*> ReplicatedFabricInteractableObjects; // 0x1a8 [Size: 0x10]
	TArray<FMDeviceCableModulatorPortComponent*> ReplicatedModulatorPorts; // 0x1b8 [Size: 0x10]
};


struct FMDeviceCable
{
public:
	uint8_t pad_0[0x808]; // 0x0
	FMDeviceCablePortComponent* ConstantPort; // 0x808 [Size: 0x8]
	uint8_t pad_810[0x8]; // 0x810
	FMDeviceCablePortComponent* ServerPortA; // 0x818 [Size: 0x8]
	uint8_t pad_820[0x8]; // 0x820
	FMDeviceCablePortComponent* ServerPortB; // 0x828 [Size: 0x8]
	bool bPermittedToShowVisuals : 1; // 0x830 [Mask: 0x1] [Bit: 0]
};


struct FMDeviceCableControllerComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FMDeviceCablePortComponent* ServerControllerPort; // 0x108 [Size: 0x8]
	uint8_t pad_110[0x10]; // 0x110
	FMDeviceCableManagerComponent* ServerDeviceCableManager; // 0x120 [Size: 0x8]
};


struct FMDeviceCableManagerComponent
{
public:
	uint8_t pad_0[0x130]; // 0x0
	TArray<FMDeviceCable*> FreeDeviceCables; // 0x130 [Size: 0x10]
	uint8_t pad_140[0x61]; // 0x140
	bool bUnregisterWithSignificanceSystem : 1; // 0x1a1 [Mask: 0x1] [Bit: 0]
};


struct FMDeviceCableModulatorPortComponent
{
public:
	uint8_t pad_0[0x968]; // 0x0
	FString AssociatedProperty; // 0x968 [Size: 0x10]
};


struct FMDeviceCablePortComponent
{
public:
	uint8_t pad_0[0x86a]; // 0x0
	bool bIsOnPreviewBuildingActor : 1; // 0x86a [Mask: 0x1] [Bit: 0]
	uint8_t pad_86b[0x1d]; // 0x86b
	TArray<FMDeviceCablePortComponent*> ServerConnectedPorts; // 0x888 [Size: 0x10]
	uint8_t pad_898[0x10]; // 0x898
	FMDeviceCable* ConstantCable; // 0x8a8 [Size: 0x8]
	FMDeviceCableManagerComponent* DeviceCableManager; // 0x8b0 [Size: 0x8]
	uint8_t pad_8b8[0x11]; // 0x8b8
	enum EDeviceCableActivatedState ServerPortActivatedState; // 0x8c9 [Size: 0x1]
};


struct FMDeviceCableWildcardOrderingComponent
{
public:
	uint8_t pad_0[0x4a0]; // 0x0
	TArray<FMDeviceCableOrderingPortState> ServerPortStates; // 0x4a0 [Size: 0x10]
};


struct FMDeviceCableWildcardPortComponent
{
public:
	uint8_t pad_0[0x98c]; // 0x0
	int SavedSlotIndex; // 0x98c [Size: 0x4]
	enum EDeviceCablePortDataType SavedPortDataType; // 0x990 [Size: 0x1]
};


struct UDanceSpotlightComponent
{
public:
	uint8_t pad_0[0x110]; // 0x0
	bool bPlayerOnTheBeat : 1; // 0x110 [Mask: 0x1] [Bit: 0]
	uint8_t pad_111[0x47]; // 0x111
	bool bInTheSpotlight : 1; // 0x158 [Mask: 0x1] [Bit: 0]
	bool bTrailVFXActive : 1; // 0x159 [Mask: 0x1] [Bit: 0]
	uint8_t pad_15a[0x2]; // 0x15a
	int CurrentMoodIndex; // 0x15c [Size: 0x4]
	bool bPlayerHolding : 1; // 0x160 [Mask: 0x1] [Bit: 0]
};


struct ExtractablePickup
{
public:
	uint8_t pad_0[0x754]; // 0x0
	bool bHiddenForCustomDrop : 1; // 0x754 [Mask: 0x1] [Bit: 0]
};


struct ExtractionBackpackActor
{
public:
	uint8_t pad_0[0x27c]; // 0x0
	FortPlayerPawn* OwningPawn; // 0x27c [Size: 0x8]
	ExtractableItemDefinition* ExtractableItemDefinition; // 0x284 [Size: 0x8]
};


struct ExtractableItem_DataComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortItemEntry ItemEntry; // 0xc0 [Size: 0x98]
};


struct ExtractionAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData CurrentExtractableExperience; // 0x30 [Size: 0x28]
};


struct EspressoGameplayAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData CurrentCharges; // 0x30 [Size: 0x28]
};


struct APlayedSoundReplication
{
public:
	uint8_t pad_0[0x270]; // 0x0
	double StartTime; // 0x270 [Size: 0x8]
	bool bPlaySound2D : 1; // 0x278 [Mask: 0x1] [Bit: 0]
	uint8_t pad_279[0x7]; // 0x279
	USoundBase* SoundAsset; // 0x280 [Size: 0x20]
};


struct ASpawnedParticleSystemReplication
{
public:
	uint8_t pad_0[0x270]; // 0x0
	double StartTime; // 0x270 [Size: 0x8]
	UVerseAssetPtr* VFXAsset; // 0x278 [Size: 0x8]
};


struct ALivingWorldEncounterPrefab
{
public:
	uint8_t pad_0[0xa18]; // 0x0
	EncounterItemDefinition* EncounterDefinition; // 0xa18 [Size: 0x8]
	uint8_t pad_a20[0x28]; // 0xa20
	ALivingWorldEncounterPrefab* ParentScenarioPrefab; // 0xa48 [Size: 0x8]
};


struct EncounterManagerComponent
{
public:
	uint8_t pad_0[0x160]; // 0x0
	bool bHasHandledSuccessFailure : 1; // 0x160 [Mask: 0x1] [Bit: 0]
};


struct ElectroBatAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData KnockbackCharge; // 0x30 [Size: 0x28]
	FortGameplayAttributeData CurrentChargeStage; // 0x58 [Size: 0x28]
};


struct FortDynamicVolumePlayspaceComponent
{
public:
	uint8_t pad_0[0x228]; // 0x0
	FOnlineLinkId CurrentLevelLinkId; // 0x228 [Size: 0x18]
	uint8_t pad_240[0x40]; // 0x240
	FVector BoundsScale; // 0x280 [Size: 0x18]
	FBox EstimatedGameplayBounds; // 0x298 [Size: 0x38]
	bool ServerVerseRuntimeErrorEncountered : 1; // 0x2d0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2d1[0x7]; // 0x2d1
	FOnUnrecoverableErrorMessage UnrecoverableErrorMessage; // 0x2d8 [Size: 0x28]
	FOnlineLinkId DesiredLinkId; // 0x300 [Size: 0x18]
};


struct UDynamicCapsuleComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	TArray<FDynamicCapsuleEntry> DynamicCapsuleEntryStack; // 0xc8 [Size: 0x10]
	FDynamicCapsuleState ReplicatedCapsuleState; // 0xd8 [Size: 0x10]
};


struct UNyxGlassFuelAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData MaxFuel; // 0x38 [Size: 0x28]
	FortGameplayAttributeData Fuel; // 0x60 [Size: 0x28]
	FortGameplayAttributeData LocalFuel; // 0x88 [Size: 0x28]
};


struct FortMotorcycleVehicle
{
public:
	uint8_t pad_0[0x2218]; // 0x0
	TArray<int> BoostShapeIndices; // 0x2218 [Size: 0x10]
	bool bIsBoostAttacking : 1; // 0x2228 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2229[0x7]; // 0x2229
	FMotorcycleRuntimeBoostInfo BoostInfo; // 0x2230 [Size: 0x18]
};


struct FortPawnComponent_VoidTeleport
{
public:
	uint8_t pad_0[0xd4]; // 0x0
	ABuildingGameplayActor* BGAToTeleport; // 0xd4 [Size: 0x8]
	FortProjectileBase* CurrentTrackedVoidProjectile; // 0xdc [Size: 0x8]
	uint8_t pad_e4[0x10]; // 0xe4
	bool bForceCrouch : 1; // 0xf4 [Mask: 0x1] [Bit: 0]
	bool bForceCrouchPredicted : 1; // 0xf5 [Mask: 0x1] [Bit: 0]
};


struct USpecterHauntInteractionExtensionComponent
{
public:
	uint8_t pad_0[0x138]; // 0x0
	int HaunterCount; // 0x138 [Size: 0x4]
};


struct USpecterHauntingComponent
{
public:
	uint8_t pad_0[0x114]; // 0x0
	FortPlayerPawnAthena* HauntedPawn; // 0x114 [Size: 0x8]
};


struct FortControllerComponent_VictoryCrowns
{
public:
	uint8_t pad_0[0x130]; // 0x0
	bool bWonCrownInMatch : 1; // 0x130 [Mask: 0x1] [Bit: 0]
	bool bWonRoyalRoyale : 1; // 0x131 [Mask: 0x1] [Bit: 0]
	uint8_t pad_132[0x3a]; // 0x132
	FVictoryCrownAccountData VictoryCrownAccountData; // 0x16c [Size: 0x14]
};


struct FortGameStateComponent_VictoryCrowns
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FortPlayerStateAthena*> CrownBearerPlayerStates; // 0xc0 [Size: 0x10]
};


struct FortPlayerStateComponent_VictoryCrowns
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bHasWonRoyalRoyale : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
};


struct FortGameStateComponent_RandomWinCondition
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	int CurrentWinConditionPlayersRemaining; // 0xc0 [Size: 0x4]
};


struct UDelMarDriverCosmeticPlayerComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	FDelMarDriverCosmeticData CosmeticData; // 0xe8 [Size: 0x18]
};


struct ADelMarActorMover
{
public:
	uint8_t pad_0[0xb60]; // 0x0
	float ServerMovementStartTime; // 0xb60 [Size: 0x4]
};


struct ADelMarChallengeRaceManager
{
public:
	uint8_t pad_0[0x428]; // 0x0
	bool bIsOvertime : 1; // 0x428 [Mask: 0x1] [Bit: 0]
};


struct ADelMarCompetitiveRaceManager
{
public:
	uint8_t pad_0[0x438]; // 0x0
	double FirstPlayerFinishedTimestamp; // 0x438 [Size: 0x8]
};


struct ADelMarPlayspace
{
public:
	uint8_t pad_0[0x6c0]; // 0x0
	FString MRSLinkId; // 0x6c0 [Size: 0x10]
	uint8_t pad_6d0[0x30]; // 0x6d0
	ADelMarRaceManager* ActiveRaceManager; // 0x700 [Size: 0x8]
	uint8_t pad_708[0x20]; // 0x708
	FDelMarMapSet MapSet; // 0x728 [Size: 0x18]
};


struct ADelMarRaceLevelConfig
{
public:
	uint8_t pad_0[0xb2c]; // 0x0
	int DefaultNumRequiredLaps; // 0xb2c [Size: 0x4]
};


struct ADelMarRaceManager
{
public:
	uint8_t pad_0[0x388]; // 0x0
	bool bRaceStarted : 1; // 0x388 [Mask: 0x1] [Bit: 0]
	bool bRaceFinished : 1; // 0x389 [Mask: 0x1] [Bit: 0]
	uint8_t pad_38a[0x6]; // 0x38a
	TArray<FortPlayerState*> SpectatorPlayerStates; // 0x390 [Size: 0x10]
	TArray<FortPlayerState*> ActiveRacerPlayerStates; // 0x3a0 [Size: 0x10]
	uint8_t pad_3b0[0x8]; // 0x3b0
	ADelMarRaceLevelConfig* ActiveRaceLevelConfig; // 0x3b8 [Size: 0x8]
};


struct ADelMarSpeedUpDevice
{
public:
	uint8_t pad_0[0xb28]; // 0x0
	float SpeedAmount; // 0xb28 [Size: 0x4]
	uint8_t pad_b2c[0x4]; // 0xb2c
	float TurboChargesGained; // 0xb30 [Size: 0x4]
	uint8_t pad_b34[0x7c]; // 0xb34
	float MaxLifetimePowerIntensitySeconds; // 0xbb0 [Size: 0x4]
};


struct ADelMarTimeDelayedStateSequencer
{
public:
	uint8_t pad_0[0x2b4]; // 0x0
	bool bIsEnabled : 1; // 0x2b4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2b5[0x3]; // 0x2b5
	int CurrentStateIndex; // 0x2b8 [Size: 0x4]
};


struct ADelMarVehicle
{
public:
	uint8_t pad_0[0x2088]; // 0x0
	bool bLocalDriverHasReplicatedVehicle : 1; // 0x2088 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2089[0x77]; // 0x2089
	float DistanceToPack; // 0x2100 [Size: 0x4]
	float DistanceFromTrackFinish; // 0x2104 [Size: 0x4]
	float RaceStatusSpeedModifier; // 0x2108 [Size: 0x4]
	uint8_t pad_210c[0x184]; // 0x210c
	bool bIdleFromNoInput : 1; // 0x2290 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2291[0x147]; // 0x2291
	FDelMarVehicleConfigOverrides ConfigOverrides; // 0x23d8 [Size: 0xa0]
	uint8_t pad_2478[0xcb0]; // 0x2478
	enum EDelMarInvertSteerMethod InvertSteerMethod; // 0x3128 [Size: 0x1]
	bool bPitchInverted : 1; // 0x3129 [Mask: 0x1] [Bit: 0]
	bool bVerticalKickflipInverted : 1; // 0x312a [Mask: 0x1] [Bit: 0]
	bool bAerialPitchActivationEnabled : 1; // 0x312b [Mask: 0x1] [Bit: 0]
	uint8_t pad_312c[0x504]; // 0x312c
	FDelMarStartlineBoostData StartlineBoostData; // 0x3630 [Size: 0x14]
	uint8_t pad_3644[0xdc]; // 0x3644
	float TurboCharges; // 0x3720 [Size: 0x4]
	uint8_t pad_3724[0x15c]; // 0x3724
	FVector ForcedReattachmentDirection; // 0x3880 [Size: 0x18]
	uint8_t pad_3898[0x128]; // 0x3898
	FDelMarVehicleSpawnInfo SpawnInfo; // 0x39c0 [Size: 0x10]
	uint8_t pad_39d0[0x10]; // 0x39d0
	bool bAllowExitingVehicle : 1; // 0x39e0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_39e1[0x97]; // 0x39e1
	bool bVehicleCollisionsEnabled : 1; // 0x3a78 [Mask: 0x1] [Bit: 0]
	bool bPawnCollisionsEnabled : 1; // 0x3a79 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3a7a[0xe]; // 0x3a7a
	bool bUsePredictiveInterpolation : 1; // 0x3a88 [Mask: 0x1] [Bit: 0]
};


struct UDelMarGameplayModifierComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	TArray<ADelMarGameplayModifier*> SpawnedModifiers; // 0xe0 [Size: 0x10]
};


struct UDelMarGlobalInputDisabler
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FGameplayTagContainer DisabledInputTags; // 0xd8 [Size: 0x20]
};


struct UDelMarGlobalLeaderboardControllerComponent
{
public:
	uint8_t pad_0[0x150]; // 0x0
	FDelMarLeaderboardSettings LeaderboardSettings; // 0x150 [Size: 0x20]
};


struct UDelMarLeaderboardManager
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FDelMarLeaderboardConfig LeaderboardConfig; // 0x108 [Size: 0x20]
};


struct UDelMarLevelManagerComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	UDelMarLevelDataAsset* CurrentLevelData; // 0xf0 [Size: 0x8]
	FOnlineLinkId CurrentLevelLinkId; // 0xf8 [Size: 0x18]
	FGameplayTagContainer DesiredMapDescription; // 0x110 [Size: 0x20]
	FOnlineLinkId DesiredLinkId; // 0x130 [Size: 0x18]
};


struct UDelMarPlayerActiveRaceManagerComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	ADelMarRaceManager* ActiveRaceManager; // 0xd8 [Size: 0x8]
};


struct UDelMarPlayerAttachmentComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortPlayerState* AttachedPlayer; // 0xc0 [Size: 0x8]
};


struct UDelMarPlayerDeathRaceDataComponent
{
public:
	uint8_t pad_0[0x1c0]; // 0x0
	int Score; // 0x1c0 [Size: 0x4]
};


struct UDelMarPlayerRaceDataComponent
{
public:
	uint8_t pad_0[0x110]; // 0x0
	double RunStartTime; // 0x110 [Size: 0x8]
	double RunFinishTime; // 0x118 [Size: 0x8]
	double CheckpointStartTime; // 0x120 [Size: 0x8]
	double LapStartTime; // 0x128 [Size: 0x8]
	float DistanceToFinishLine; // 0x130 [Size: 0x4]
	float LapDistance; // 0x134 [Size: 0x4]
	float PrimaryTrackDistance; // 0x138 [Size: 0x4]
	float IndependentTrackDistance; // 0x13c [Size: 0x4]
	int LapsCompleted; // 0x140 [Size: 0x4]
	bool bHasStartedFirstLap : 1; // 0x144 [Mask: 0x1] [Bit: 0]
	bool bFinishedRace : 1; // 0x145 [Mask: 0x1] [Bit: 0]
	uint8_t pad_146[0x2]; // 0x146
	int Points; // 0x148 [Size: 0x4]
	uint8_t pad_14c[0x4]; // 0x14c
	TArray<APlayerState*> ViewingSpectators; // 0x150 [Size: 0x10]
	ADelMarCheckpoint* MostRecentlyVisitedCheckpoint; // 0x160 [Size: 0x8]
};


struct UDelMarPositionalTrackerComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	TArray<FDelMarFinalRacePositionEntry> FinalRacePositions; // 0x118 [Size: 0x10]
};


struct UDelMarPreRaceControllerComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	FortPlayerState* CurrentViewTarget; // 0x120 [Size: 0x8]
};


struct UDelMarRaceConfigComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bGhostReplayEnabled : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c1[0xff]; // 0xc1
	FDelMarVehicleRuntimeConfig VehicleRuntimeConfig; // 0x1c0 [Size: 0xc]
	FDelMarVehicleAbilityConfig VehicleAbilityConfig; // 0x1cc [Size: 0x11]
	uint8_t pad_1dd[0x3]; // 0x1dd
	FDelMarRespawnConfig RespawnConfig; // 0x1e0 [Size: 0x10]
};


struct UDelMarRaceInfoComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FString RaceGUID; // 0xc0 [Size: 0x10]
};


struct UDelMarRequestComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FGameplayTagContainer MapChoice; // 0x108 [Size: 0x20]
	bool bIsLoadingScreenActive : 1; // 0x128 [Mask: 0x1] [Bit: 0]
	bool bIsReadyToStartRace : 1; // 0x129 [Mask: 0x1] [Bit: 0]
	bool bIsReadyToJoinRace : 1; // 0x12a [Mask: 0x1] [Bit: 0]
	enum EDelMarPostRaceVote PostRaceVote; // 0x12b [Size: 0x1]
	bool bVotedPostRace : 1; // 0x12c [Mask: 0x1] [Bit: 0]
};


struct UDelMarRequestTrackerComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FDelMarEvent_TrackedPlayerReadyStates PlayerReadyStates; // 0xc0 [Size: 0x20]
};


struct UDelMarRubberbandingManagerComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	float PackDistance; // 0xd8 [Size: 0x4]
	FDelMarRubberbandingConfig RubberbandingConfig; // 0xdc [Size: 0x28]
	int MMRUsed; // 0x104 [Size: 0x4]
};


struct UDelMarRunRecordPlayerComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FDelMarRunRecord CurrentRunRecord; // 0xc0 [Size: 0x20]
	FDelMarRunRecord BestRunRecord; // 0xe0 [Size: 0x20]
	FDelMarRunRecord BestSectionsRecord; // 0x100 [Size: 0x20]
	double BestSingleLapTime; // 0x120 [Size: 0x8]
};


struct UDelMarSpectatorControllerComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	FortPlayerState* CurrentViewTarget; // 0xf8 [Size: 0x8]
	FortPlayerState* PrevValidViewTarget; // 0x100 [Size: 0x8]
	uint8_t pad_108[0x10]; // 0x108
	bool bIsLateJoinSpectator : 1; // 0x118 [Mask: 0x1] [Bit: 0]
};


struct UDelMarState
{
public:
	uint8_t pad_0[0x28]; // 0x0
	FGameplayTag StateTag; // 0x28 [Size: 0x4]
};


struct UDelMarStateMachine
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FGameplayTag RequestedStateTag; // 0xe0 [Size: 0x4]
	uint8_t pad_e4[0x1c]; // 0xe4
	TArray<UDelMarState*> ReplicatedStates; // 0x100 [Size: 0x10]
};


struct UDelMarState_Gameplay_Postrace
{
public:
	uint8_t pad_0[0x38]; // 0x0
	double PostRaceEndServerTime; // 0x38 [Size: 0x8]
	uint8_t pad_40[0x50]; // 0x40
	FString EliminationList; // 0x90 [Size: 0x10]
};


struct UDelMarState_Gameplay_Prerace
{
public:
	uint8_t pad_0[0x40]; // 0x0
	double PreRaceCountdownFinishServerTime; // 0x40 [Size: 0x8]
};


struct UDelMarState_Gameplay_WaitingForPlayers
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FDelMarEvent_LoadedPlayerStates LoadedPlayerStates; // 0x48 [Size: 0x8]
};


struct UDelMarState_Loading
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FGameplayTagContainer DesiredMap; // 0x38 [Size: 0x20]
};


struct UDelMarTimeManagerComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	double ServerRaceStartTime; // 0xd8 [Size: 0x8]
	double ServerRaceFinishTime; // 0xe0 [Size: 0x8]
	double ServerCountdownIntervalTime; // 0xe8 [Size: 0x8]
};


struct UDelMarVehicleMovementSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData AccelMultiplier; // 0x30 [Size: 0x28]
	FortGameplayAttributeData bVehicleThrottleDisabled; // 0x58 [Size: 0x28]
	FortGameplayAttributeData BonusSpeed; // 0x80 [Size: 0x28]
};


struct UDelMarVehicleNetworkPhysicsComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FDelMarVehicleReplicatedState ReplicatedState; // 0xd0 [Size: 0x290]
};


struct UVehicleCosmeticsAssembledMeshUserComponent
{
public:
	uint8_t pad_0[0x190]; // 0x0
	FReplicatedCosmeticLoadoutData OwningCosmeticLoadoutData; // 0x190 [Size: 0x20]
	uint8_t pad_1b0[0x61]; // 0x1b0
	bool bVehicleCosmeticsEnabled : 1; // 0x211 [Mask: 0x1] [Bit: 0]
};


struct UGameplayState
{
public:
	uint8_t pad_0[0x28]; // 0x0
	FGameplayTag StateId; // 0x28 [Size: 0x4]
};


struct UGameplayStateMachine
{
public:
	uint8_t pad_0[0x90]; // 0x0
	FGameplayTag StateMachineId; // 0x90 [Size: 0x4]
	uint8_t pad_94[0x4]; // 0x94
	ActiveGameplayStateData ActiveGameplayStateData; // 0x98 [Size: 0x18]
};


struct UGameplayStateMachineManager
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FGameplayStateMachineArray StateMachineList; // 0xc0 [Size: 0x60]
};


struct ADelMarTrackPerformanceScrubber
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	int RuntimeSpeed; // 0x2a0 [Size: 0x4]
	bool bRunCsvProfilerDuringScrub : 1; // 0x2a4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2a5[0x1f]; // 0x2a5
	bool bRuntimeEnabled : 1; // 0x2c4 [Mask: 0x1] [Bit: 0]
};


struct FortWeaponComponent_BarrelSpin
{
public:
	uint8_t pad_0[0x17c]; // 0x0
	float CurrentRPM; // 0x17c [Size: 0x4]
	bool bIsSpooling : 1; // 0x180 [Mask: 0x1] [Bit: 0]
};


struct FortWeaponComponent_SegmentedReload
{
public:
	uint8_t pad_0[0x118]; // 0x0
	double LastServerReloadCompletionTime; // 0x118 [Size: 0x8]
};


struct UCreativeGameStateComponent_CommunicationOverride
{
public:
	uint8_t pad_0[0x1b0]; // 0x0
	FCreativeBubbleChatSettings CreativeBubbleChatSettings; // 0x1b0 [Size: 0x38]
};


struct ACraftingObjectBGA
{
public:
	uint8_t pad_0[0x928]; // 0x0
	FortInventory* Inventory; // 0x928 [Size: 0x8]
};


struct UCraftingObjectComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FCraftingObjectRepStateData CraftingObjectRepStateData; // 0x128 [Size: 0x18]
	uint8_t pad_140[0x10]; // 0x140
	FName LastCraftedItemFormulaRow; // 0x150 [Size: 0x4]
	uint8_t pad_154[0x44]; // 0x154
	FGameplayTagContainer CraftingObjectTags; // 0x198 [Size: 0x20]
	uint8_t pad_1b8[0x2b8]; // 0x1b8
	bool FreeCraftingEnabled : 1; // 0x470 [Mask: 0x1] [Bit: 0]
};


struct FortGameStateComponent_Crafting
{
public:
	uint8_t pad_0[0x120]; // 0x0
	TArray<FCraftingResult> CraftingResultsList; // 0x120 [Size: 0x10]
};


struct FortAthenaMutator_WarEffort
{
public:
	uint8_t pad_0[0x438]; // 0x0
	TArray<FPrimaryAssetId> PreloadedItemList; // 0x438 [Size: 0x10]
	bool bCanPreloadItems : 1; // 0x448 [Mask: 0x1] [Bit: 0]
};


struct AWarEffortMeshActor
{
public:
	uint8_t pad_0[0x278]; // 0x0
	TArray<FGameplayTag> ActiveFundedItems; // 0x278 [Size: 0x10]
	TArray<FGameplayTag> ActiveTryBeforeYouBuyItems; // 0x288 [Size: 0x10]
	TArray<FWarEffortFundingData> CurrentFundingData; // 0x298 [Size: 0x10]
};


struct FortScriptedObjectMovement_MovableObjectBase
{
public:
	uint8_t pad_0[0xa40]; // 0x0
	FScriptedObjectMovement_StaticPathStepData CurrentStepData; // 0xa40 [Size: 0xf0]
};


struct FortPlayerCompanion
{
public:
	uint8_t pad_0[0x740]; // 0x0
	FortPlayerCompanionGoal CurrentGoal; // 0x740 [Size: 0x58]
	uint8_t pad_798[0xe8]; // 0x798
	FortPlayerCompanionBodyState BodyState; // 0x880 [Size: 0x8]
	uint8_t pad_888[0x4]; // 0x888
	FortPlayerCompanionRunningReaction RunningReaction; // 0x88c [Size: 0x18]
	uint8_t pad_8a4[0x3c]; // 0x8a4
	FortPlayerCompanionRunningInteraction RunningInteraction; // 0x8e0 [Size: 0xc]
	uint8_t pad_8ec[0x4]; // 0x8ec
	FortAbilitySystemComponent* AbilitySystemComponent; // 0x8f0 [Size: 0x8]
	enum EPlayerCompanionMood CurrentMood; // 0x8f8 [Size: 0x1]
	uint8_t pad_8f9[0x27]; // 0x8f9
	bool bServerIsStopping : 1; // 0x920 [Mask: 0x1] [Bit: 0]
	bool bCompanionInteractionsEnabled : 1; // 0x921 [Mask: 0x1] [Bit: 0]
	bool bAnticsEnabled : 1; // 0x922 [Mask: 0x1] [Bit: 0]
};


struct FortPlayerCompanionComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	FortPlayerCompanion* PlayerCompanion; // 0x128 [Size: 0x8]
	uint8_t pad_130[0x18]; // 0x130
	FortPlayerCompanionRunningInteraction RunningInteraction; // 0x148 [Size: 0xc]
};


struct FortAthenaMutator_LedgeLaunch
{
public:
	uint8_t pad_0[0x3d0]; // 0x0
	bool bShouldSpawnLedge : 1; // 0x3d0 [Mask: 0x1] [Bit: 0]
};


struct UClamberingComponent
{
public:
	uint8_t pad_0[0xd1]; // 0x0
	enum EClamberingState ReplicatedClamberingState; // 0xd1 [Size: 0x1]
	uint8_t pad_d2[0x146]; // 0xd2
	FReplicatedClamberingTargetingData_SimClient ReplicatedTargetingData; // 0x218 [Size: 0x38]
	uint8_t pad_250[0xca8]; // 0x250
	double LastTeleportTime; // 0xef8 [Size: 0x8]
};


struct UCherrySmokeHeroRankingGlobalManager
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	FCherrySmokeHeroRankRuntimeDataArray PerTeamRuntimeRankData; // 0xd0 [Size: 0x60]
};


struct UCherrySmokeHeroRankingManager
{
public:
	uint8_t pad_0[0x1b0]; // 0x0
	FHeroRankMultiplier ActiveMultiplier; // 0x1b0 [Size: 0x8]
};


struct FortWeaponRanged_DualWieldable
{
public:
	uint8_t pad_0[0x2888]; // 0x0
	FortWeaponRanged_DualWieldable* PairedWeapon; // 0x2888 [Size: 0x8]
};


struct UModularVehicleBaseComponent
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FModularReplicatedState ReplicatedState; // 0x280 [Size: 0x18]
	uint8_t pad_298[0x40]; // 0x298
	TArray<FConstructionData> ConstructionDatas; // 0x2d8 [Size: 0x10]
};


struct UChainsawAttributeSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData Overheat; // 0x30 [Size: 0x28]
};


struct FortCreativeStreamingComponent
{
public:
	uint8_t pad_0[0x291]; // 0x0
	enum EFortStreamingVideoSelectionMode StreamingMode; // 0x291 [Size: 0x1]
};


struct UThrowingToyTrackerComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FThrowingToyDataArray ThrowingToysData; // 0xc0 [Size: 0x58]
};


struct FortSkilledInteractionPlayerComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	Actor* InteractionDevice; // 0xd0 [Size: 0x8]
	enum EFortSkilledInteractionState InteractionState; // 0xd8 [Size: 0x1]
	uint8_t pad_d9[0x3]; // 0xd9
	int SuccessCount; // 0xdc [Size: 0x4]
	int FailureCount; // 0xe0 [Size: 0x4]
};


struct FortSkilledInteractionPlayerListComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	int SuccessTarget; // 0xd0 [Size: 0x4]
	int FailureLimit; // 0xd4 [Size: 0x4]
};


struct UCRDPostProcessDeviceControllerComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FPostProcessDeviceMessageRingBuffer PostProcessDeviceMessageBatch; // 0xe0 [Size: 0x70]
};


struct AtomGeometryAssemblyComponent
{
public:
	uint8_t pad_0[0x130]; // 0x0
	enum EAtomAssemblyEventFlags AssemblyEventFlags; // 0x130 [Size: 0x1]
	uint8_t pad_131[0x3]; // 0x131
	AtomAssemblyState AssemblyState; // 0x134 [Size: 0xc]
	AtomAssemblyCollision AssemblyCollision; // 0x140 [Size: 0x2]
	uint8_t pad_142[0x6]; // 0x142
	AtomAssemblyRange MarshalledRange; // 0x148 [Size: 0x18]
};


struct ULimeAssembleComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	Actor* ContextActor; // 0xf0 [Size: 0x8]
};


struct ULimeAssembleContextActorComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	TArray<Actor*> TargetActors; // 0x128 [Size: 0x10]
	FBox Bounds; // 0x138 [Size: 0x38]
	enum ELimeAssemblyEvent LastEvent; // 0x170 [Size: 0x1]
};


struct ULimeGeometryAssemblyComponent
{
public:
	uint8_t pad_0[0x1a8]; // 0x0
	bool bWantsPreviewActorVisible : 1; // 0x1a8 [Mask: 0x1] [Bit: 0]
};


struct ULimeGeometryAssemblyComponent_BrickRain
{
public:
	uint8_t pad_0[0x1c4]; // 0x0
	float GeometryAssemblyRate; // 0x1c4 [Size: 0x4]
};


struct ALevelInstanceGameplayVolume
{
public:
	uint8_t pad_0[0x3d1]; // 0x0
	bool bEditMode : 1; // 0x3d1 [Mask: 0x1] [Bit: 0]
	bool bDisabled : 1; // 0x3d2 [Mask: 0x1] [Bit: 0]
	enum ESpatialLoadingState LoadingState; // 0x3d3 [Size: 0x1]
	uint8_t pad_3d4[0x4]; // 0x3d4
	FString LevelInstanceName; // 0x3d8 [Size: 0x10]
	bool bInstanceLoaded : 1; // 0x3e8 [Mask: 0x1] [Bit: 0]
	bool bWantsLevelLoaded : 1; // 0x3e9 [Mask: 0x1] [Bit: 0]
};


struct FabricSongSyncComponent
{
public:
	uint8_t pad_0[0x140]; // 0x0
	FSongSyncPlaybackRequest ServerPlaybackRequest; // 0x140 [Size: 0xc]
	uint8_t pad_14c[0x8c]; // 0x14c
	FSongSyncMidiSource MidiSource; // 0x1d8 [Size: 0x18]
	uint8_t pad_1f0[0x18]; // 0x1f0
	FSongSyncSequenceActor ServerLevelSequenceActor; // 0x208 [Size: 0xc]
};


struct FabricInteractionTool
{
public:
	uint8_t pad_0[0x294c]; // 0x0
	FInteractionData ServerInteractionData; // 0x294c [Size: 0xc]
	uint8_t pad_2958[0x11]; // 0x2958
	bool bServerTriggerPressed : 1; // 0x2969 [Mask: 0x1] [Bit: 0]
	uint8_t pad_296a[0x1]; // 0x296a
	bool bServerIsHoldingCable : 1; // 0x296b [Mask: 0x1] [Bit: 0]
	uint8_t pad_296c[0x14]; // 0x296c
	FInteractionSplinePoints ServerSplinePoints; // 0x2980 [Size: 0x60]
	float ServerContinuousInteractableValue; // 0x29e0 [Size: 0x4]
};


struct FabricSpeakerManagerComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	float ReplicatedReceivedSignalBufferDuration; // 0xf0 [Size: 0x4]
};


struct FabricStepSequencerComponent
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FabricStepTablePacked PackedStepTable; // 0x280 [Size: 0x28]
};


struct FabricStepSequencerGridComponent
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	int MaxTrackIndexToLoadSquares; // 0x2f0 [Size: 0x4]
};


struct FabricTimelineSyncComponent
{
public:
	uint8_t pad_0[0x118]; // 0x0
	FabricTimelineSyncServerSongPosition ServerTimelineSyncServerSongPosition; // 0x118 [Size: 0x1c]
};


struct FabricMusicRandomizer
{
public:
	uint8_t pad_0[0x6a8]; // 0x0
	int RandomSeed; // 0x6a8 [Size: 0x4]
	uint8_t pad_6ac[0x4]; // 0x6ac
	FabricZoneSystem* OwnerZoneSystem; // 0x6b0 [Size: 0x8]
};


struct FabricZoneSystem
{
public:
	uint8_t pad_0[0x278]; // 0x0
	FabricZoneComponent* OwnerZoneComponent; // 0x278 [Size: 0x8]
	FabricMusicRandomizer* MusicRandomizer; // 0x280 [Size: 0x8]
};


struct FabricDeviceComponentBase
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FabricGlobalSystem* ServerFabricGlobalSystem; // 0xe0 [Size: 0x8]
	uint8_t pad_e8[0x8]; // 0xe8
	FabricZoneSystem* ServerFabricZoneSystem; // 0xf0 [Size: 0x8]
};


struct FabricZoneComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FabricZoneSystem* ZoneSystem; // 0xc8 [Size: 0x8]
	UPlayspaceComponent_Fabric* FabricPlayspaceComponent; // 0xd0 [Size: 0x8]
	TArray<FabricDeviceComponentBase*> DevicesInZone; // 0xd8 [Size: 0x10]
};


struct UPlayspaceComponent_Fabric
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FabricGlobalSystem* GlobalSystem; // 0xc0 [Size: 0x8]
	FabricZoneSystem* GlobalZoneSystem; // 0xc8 [Size: 0x8]
	TArray<FabricDeviceComponentBase*> RegisteredDevices; // 0xd0 [Size: 0x10]
	TArray<FabricDeviceComponentBase*> GlobalDevices; // 0xe0 [Size: 0x10]
	TArray<FabricZoneComponent*> RegisteredZoneSystems; // 0xf0 [Size: 0x10]
};


struct UDanceSynchronizerComponent
{
public:
	uint8_t pad_0[0xc4]; // 0x0
	FDanceBeatInfo BeatInfo; // 0xc4 [Size: 0x8]
	enum EDanceBeatSyncMode SyncMode; // 0xcc [Size: 0x1]
	uint8_t pad_cd[0x3]; // 0xcd
	float Tempo; // 0xd0 [Size: 0x4]
};


struct UCustomControlOptions_Base
{
public:
	uint8_t pad_0[0x28]; // 0x0
	FortMovementMode_BaseCCLogic* MovementModeLogic; // 0x28 [Size: 0x8]
	float RangedAttackStateDuration; // 0x30 [Size: 0x4]
	float MeleeAttackStateDuration; // 0x34 [Size: 0x4]
	TArray<UCustomControlInputBindings_Base*> InputBindingsClasses; // 0x38 [Size: 0x10]
	FortWeaponReticleData FortWeaponReticleData; // 0x48 [Size: 0x14]
	FInteractionPointOptions InteractionPointOptions; // 0x5c [Size: 0x10]
	uint8_t pad_6c[0xc]; // 0x6c
	float BuildingPlacementDistanceOffset; // 0x78 [Size: 0x4]
	bool bShouldAffectNPC : 1; // 0x7c [Mask: 0x1] [Bit: 0]
};


struct UCustomControlOptions_SideScroller
{
public:
	uint8_t pad_0[0x1c8]; // 0x0
	FortMovementMode_CCSideScrollerCreationData MovementModeCreationData; // 0x1c8 [Size: 0x48]
	FInputOptions_SideScroller InputOptions; // 0x210 [Size: 0x6]
};


struct UCustomControlOptions_Targeting
{
public:
	uint8_t pad_0[0xa0]; // 0x0
	float AngleToClampFireHorizontal; // 0xa0 [Size: 0x4]
	float AngleToClampFireVertical; // 0xa4 [Size: 0x4]
	UTargetingPreset* RangedTargetingPresetTemplate; // 0xa8 [Size: 0x8]
	UTargetingPreset* RetentionTargetingPresetTemplate; // 0xb0 [Size: 0x8]
	UTargetingPreset* RangedAimingTargetingPresetTemplate; // 0xb8 [Size: 0x8]
	UTargetingPreset* MeleeTargetingPresetTemplate; // 0xc0 [Size: 0x8]
	uint8_t pad_c8[0x20]; // 0xc8
	bool bTargetingEnabled : 1; // 0xe8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_e9[0x7]; // 0xe9
	FCustomControlTargetingData RangedTargetingData; // 0xf0 [Size: 0x48]
	FCustomControlTargetingData MeleeTargetingData; // 0x138 [Size: 0x48]
	FCustomControlTargetingData AimingTargetingData; // 0x180 [Size: 0x48]
};


struct UCustomControlOptions_ThirdPerson
{
public:
	uint8_t pad_0[0x1c8]; // 0x0
	FortMovementMode_CCThirdPersonCreationData MovementModeCreationData; // 0x1c8 [Size: 0x38]
	FInputOptions_ThirdPerson InputOptions; // 0x200 [Size: 0x1]
};


struct FortControllerComponent_BaseCC
{
public:
	uint8_t pad_0[0x100]; // 0x0
	UCustomControlOptions_Base* HighestPriorityOptions; // 0x100 [Size: 0x8]
	uint8_t pad_108[0x10]; // 0x108
	TArray<UCustomControlOptions_Base*> OwnedOptions; // 0x118 [Size: 0x10]
};


struct FortPawnComponent_BaseCC
{
public:
	uint8_t pad_0[0x100]; // 0x0
	UCustomControlOptions_Base* HighestPriorityOptions; // 0x100 [Size: 0x8]
	uint8_t pad_108[0x10]; // 0x108
	TArray<UCustomControlOptions_Base*> OwnedOptions; // 0x118 [Size: 0x10]
};


struct ACinematicSequenceDeviceBase
{
public:
	uint8_t pad_0[0xb90]; // 0x0
	FortPlayerController* InstigatingController; // 0xb90 [Size: 0x8]
	uint8_t InstigatingTeam; // 0xb98 [Size: 0x1]
};


struct ACreativeAudioPlayerReplicationProxy
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FCreativeAudioPlayerData InstigatorData; // 0x280 [Size: 0x40]
};


struct UCreativeAudioComponent
{
public:
	uint8_t pad_0[0x180]; // 0x0
	FCreativeAudioPlayerData ServerInstigatorData; // 0x180 [Size: 0x40]
	uint8_t pad_1c0[0x70]; // 0x1c0
	TArray<UniqueNetIdRepl> RegisteredPlayerIds; // 0x230 [Size: 0x10]
};


struct ACreativeAudioMixerReplicationProxy
{
public:
	uint8_t pad_0[0x280]; // 0x0
	bool bIsActive : 1; // 0x280 [Mask: 0x1] [Bit: 0]
};


struct ULLMPersonaConversationComponent
{
public:
	uint8_t pad_0[0xb8]; // 0x0
	FGuid ConversationId; // 0xb8 [Size: 0x10]
};


struct ULLMPersonaConversationComponentHolder
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	ULLMPersonaConversationComponent* LLMPersonaConversationComponent; // 0xc0 [Size: 0x8]
};


struct UPersonaOratorComponent
{
public:
	uint8_t pad_0[0x318]; // 0x0
	FPersonaOratorAudioParams PersonaOratorAudioParams; // 0x318 [Size: 0x30]
	FGuid PersonaConversationGuid; // 0x348 [Size: 0x10]
	bool bHasLinkedAnimationLayer : 1; // 0x358 [Mask: 0x1] [Bit: 0]
};


struct UOratorComponent
{
public:
	uint8_t pad_0[0x250]; // 0x0
	FGuid OratorSourceId; // 0x250 [Size: 0x10]
	uint8_t pad_260[0x30]; // 0x260
	FName SubjectName; // 0x290 [Size: 0x4]
};


struct UOratorDialogueComponent
{
public:
	uint8_t pad_0[0x1d8]; // 0x0
	FGuid OratorSourceId; // 0x1d8 [Size: 0x10]
};


struct UOratorInputControllerComponent
{
public:
	uint8_t pad_0[0x1b8]; // 0x0
	FGuid OratorSourceId; // 0x1b8 [Size: 0x10]
	bool bVoiceCaptureEnabled : 1; // 0x1c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1c9[0x3f]; // 0x1c9
	double CooldownEndTime; // 0x208 [Size: 0x8]
};


struct UOratorMusicComponent
{
public:
	uint8_t pad_0[0x168]; // 0x0
	FGuid OratorSourceId; // 0x168 [Size: 0x10]
};


struct FNFeelingsComponent
{
public:
	uint8_t pad_0[0x238]; // 0x0
	FNFeelingsStateRuntime RuntimeData; // 0x238 [Size: 0x50]
};


struct ABuilderTool
{
public:
	uint8_t pad_0[0x1950]; // 0x0
	TArray<UBuilderToolBehavior*> Behaviors; // 0x1950 [Size: 0x10]
};


struct UBuilderToolBehavior
{
public:
	uint8_t pad_0[0x1d8]; // 0x0
	TArray<FBuilderToolSpawnedSelection> ServerSpawnedSelections; // 0x1d8 [Size: 0x10]
};


struct ABGA_RolyPolyOnPlayer
{
public:
	uint8_t pad_0[0x92d]; // 0x0
	bool bInWater : 1; // 0x92d [Mask: 0x1] [Bit: 0]
};


struct FortComponent_BouncyBugInstance
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	ABGA_RolyPolyOnPlayer* OnPlayerBGA; // 0xc0 [Size: 0x8]
};


struct FortGameStateComponent_BlastBerryManager
{
public:
	uint8_t pad_0[0x150]; // 0x0
	float ServerTimeForRespawnsDisabled; // 0x150 [Size: 0x4]
	uint8_t pad_154[0x4]; // 0x154
	TArray<FortPlayerStateAthena*> RespawnPendingPlayerStates; // 0x158 [Size: 0x10]
	uint8_t pad_168[0x2e0]; // 0x168
	TArray<FBlastBerryTeamLives> TeamLives; // 0x448 [Size: 0x10]
};


struct FortAthenaMutator_YokeHopKeeperGameState
{
public:
	uint8_t pad_0[0x448]; // 0x0
	FYokeHopKeeper_StormRidingPhaseInfo StormRidingPhase; // 0x448 [Size: 0x8]
	TArray<FVector> SquadSpawnLocations; // 0x450 [Size: 0x10]
};


struct FortControllerComponent_YokeHopKeeperSpawning
{
public:
	uint8_t pad_0[0x101]; // 0x0
	bool bWasTeleportedToMainIsland : 1; // 0x101 [Mask: 0x1] [Bit: 0]
};


struct FortGameStateComponent_YokeHopKeeper
{
public:
	uint8_t pad_0[0x1f0]; // 0x0
	AYokeHopKeeperWallActor* StormWallActor; // 0x1f0 [Size: 0x8]
	uint8_t pad_1f8[0x78]; // 0x1f8
	bool bWaveActive : 1; // 0x270 [Mask: 0x1] [Bit: 0]
};


struct FortPawnComponent_StormRiding
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	FVector_NetQuantize LateLaunchTeleportLocation; // 0xf0 [Size: 0x18]
};


struct FortGameStateComponent_YokeHopUnkind
{
public:
	uint8_t pad_0[0x4d8]; // 0x0
	FStormShapeConfigNew ActiveStormShapeConfig; // 0x4d8 [Size: 0x278]
	FStormShapeConfigNew PreviousStormShapeConfig; // 0x750 [Size: 0x278]
	TArray<USafeZoneShapeProviderSet*> CurrentValidShapeProviderSets; // 0x9c8 [Size: 0x10]
	int CurrentShapeProviderSetIndex; // 0x9d8 [Size: 0x4]
	uint8_t pad_9dc[0x4]; // 0x9dc
	USafeZoneShapeProvider* PrevStormShapeProvider; // 0x9e0 [Size: 0x8]
	USafeZoneShapeProvider* ActiveStormShapeProvider; // 0x9e8 [Size: 0x8]
	uint8_t pad_9f0[0x4]; // 0x9f0
	float ShapeConfigRotation; // 0x9f4 [Size: 0x4]
	bool bPrevOverrideRotation : 1; // 0x9f8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9f9[0x3]; // 0x9f9
	float PrevShapeProviderRotation; // 0x9fc [Size: 0x4]
	bool bCurrentOverrideRotation : 1; // 0xa00 [Mask: 0x1] [Bit: 0]
	uint8_t pad_a01[0x3]; // 0xa01
	float CurrentShapeProviderRotation; // 0xa04 [Size: 0x4]
	uint8_t pad_a08[0x18]; // 0xa08
	FCurrentStormPhaseInfo StormPhaseInfo; // 0xa20 [Size: 0x10]
	uint8_t pad_a30[0x168]; // 0xa30
	int CurrentPhaseDataIndex; // 0xb98 [Size: 0x4]
	uint8_t pad_b9c[0x1c]; // 0xb9c
	bool bIsEnabled : 1; // 0xbb8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_bb9[0x17]; // 0xbb9
	TArray<FVector_NetQuantize10> CachedLandscapeSplinePoints; // 0xbd0 [Size: 0x10]
	TArray<FStormShapeSafeZonePhaseData> CachedSafeZonePhases; // 0xbe0 [Size: 0x10]
	uint8_t pad_bf0[0x18]; // 0xbf0
	bool bIsRadialFirstPhaseActive : 1; // 0xc08 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c09[0x147]; // 0xc09
	bool bForceConformFirstStormShapeToLand : 1; // 0xd50 [Mask: 0x1] [Bit: 0]
	bool bForceEnforceShrinkTimes : 1; // 0xd51 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d52[0xe]; // 0xd52
	float ShrinkPhaseCompletionAlpha_Replicated; // 0xd60 [Size: 0x4]
	uint8_t pad_d64[0x4]; // 0xd64
	float ShapePhaseCompletionAlpha_Replicated; // 0xd68 [Size: 0x4]
	uint8_t pad_d6c[0xc]; // 0xd6c
	enum EWaveInfillStatus WaveInfillEnabledStatus; // 0xd78 [Size: 0x1]
	uint8_t pad_d79[0x3]; // 0xd79
	uint32_t WaveInfillSeed; // 0xd7c [Size: 0x4]
};


struct FortBikeKid
{
public:
	uint8_t pad_0[0x6bc]; // 0x0
	bool bExploded : 1; // 0x6bc [Mask: 0x1] [Bit: 0]
	uint8_t pad_6bd[0x23]; // 0x6bd
	FortPawn* ControllingPlayerPawn; // 0x6e0 [Size: 0x8]
	uint8_t pad_6e8[0xb0]; // 0x6e8
	float ServerWorldCreationTime; // 0x798 [Size: 0x4]
};


struct FortBikeKidControllingComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FRotator CachedControllerRotator; // 0xc8 [Size: 0x18]
	uint8_t pad_e0[0x38]; // 0xe0
	FortBikeKid* ControlledBikeKid; // 0x118 [Size: 0x8]
};


struct FortChargingSet_BikeKidEnergy
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Energy; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxEnergy; // 0x70 [Size: 0x28]
	FortGameplayAttributeData EnergyChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeEnergyIncrements; // 0xc0 [Size: 0x28]
};


struct FortGameplayAbility_BikeKid_PassiveMark
{
public:
	uint8_t pad_0[0xb40]; // 0x0
	FBikeKidStatusData CurrentTargetStatus; // 0xb40 [Size: 0x8]
};


struct UMontageBeatSyncComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	UMusicClockComponent* WeakMusicClockPtr; // 0xe0 [Size: 0x8]
	uint8_t pad_e8[0x8]; // 0xe8
	bool bBeatSyncingPermission : 1; // 0xf0 [Mask: 0x1] [Bit: 0]
};


struct ABeastGirlStandInPawn
{
public:
	uint8_t pad_0[0x5d10]; // 0x0
	FBeastGirlTransformationData ReplicatedTransformationData; // 0x5d10 [Size: 0x1]
	uint8_t pad_5d11[0x3b]; // 0x5d11
	bool bHadSpriteEquipped : 1; // 0x5d4c [Mask: 0x1] [Bit: 0]
	uint8_t pad_5d4d[0x1f]; // 0x5d4d
	float CachedPreviousHealth; // 0x5d6c [Size: 0x4]
	uint8_t pad_5d70[0xc]; // 0x5d70
	UPrimitiveComponent* AttachedBaseForTransformation; // 0x5d7c [Size: 0x8]
	FortWorldItem* DefaultWeaponInstance; // 0x5d84 [Size: 0x8]
};


struct UBeastGirlTransformationManager
{
public:
	uint8_t pad_0[0x1c0]; // 0x0
	ABeastGirlStandInPawn* SpawnedBeastGirlPawn; // 0x1c0 [Size: 0x8]
};


struct UBeanObstacleMovementComponent
{
public:
	uint8_t pad_0[0x198]; // 0x0
	FBeanObstacleMotionRuntimeState ObstacleMotionRuntimeState; // 0x198 [Size: 0x30]
};


struct ABeanCharacter
{
public:
	uint8_t pad_0[0x5f28]; // 0x0
	bool bEnableInventoryMode : 1; // 0x5f28 [Mask: 0x1] [Bit: 0]
};


struct UBeanCharCollisionManagerComponent
{
public:
	uint8_t pad_0[0x128]; // 0x0
	float RagdollThresholdMultiplier; // 0x128 [Size: 0x4]
};


struct UBeanCharGrabComponent
{
public:
	uint8_t pad_0[0x150]; // 0x0
	Actor* GrabTarget; // 0x150 [Size: 0x8]
	uint8_t pad_158[0x10]; // 0x158
	float ServerLatestHoldStartTime; // 0x168 [Size: 0x4]
};


struct UBeanCharRagdollComponent
{
public:
	uint8_t pad_0[0x190]; // 0x0
	FTransform StartingMeshTransform; // 0x190 [Size: 0x60]
};


struct UBeanCharStateMachine
{
public:
	uint8_t pad_0[0x1a6]; // 0x0
	uint16_t SimulatedProxyStateData; // 0x1a6 [Size: 0x2]
	uint32_t AutonomousProxyServerStateData; // 0x1a8 [Size: 0x4]
};


struct USparksSongPlayerPlayCoordinator
{
public:
	uint8_t pad_0[0x154]; // 0x0
	float ServerStartTime; // 0x154 [Size: 0x4]
};


struct FortPawnComponent_AISparksRelay
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	bool bAuraEnabled : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
};


struct UPlayspaceComponent_SparksSongOwnership
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	TArray<FName> AvailableSongs; // 0xe0 [Size: 0x10]
};


struct USparksSongOwnershipControllerComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	TArray<FSparksOwnedSongData> OwnedSongs; // 0xd8 [Size: 0x10]
};


struct FMCoreMusicManagerComponent
{
public:
	uint8_t pad_0[0x138]; // 0x0
	enum EMusicKey ServerKey; // 0x138 [Size: 0x1]
	enum EMusicKeyMode ServerMode; // 0x139 [Size: 0x1]
	uint8_t pad_13a[0x2]; // 0x13a
	float ServerTempo; // 0x13c [Size: 0x4]
	float ServerSpeed; // 0x140 [Size: 0x4]
	FMCoreTimeSignature ServerTimeSignature; // 0x144 [Size: 0x8]
};


struct UMusicTimeNetSyncComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	FMusicTimeNetSyncServerSongPosition ServerTimelineSyncServerSongPosition; // 0x108 [Size: 0x18]
};


struct FortWeaponJetpack
{
public:
	uint8_t pad_0[0x18fc]; // 0x0
	float NativeCurrentHeightAboveWorld; // 0x18fc [Size: 0x4]
};


struct FlyingAttributeSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData MaxFuel; // 0x38 [Size: 0x28]
	FortGameplayAttributeData FuelUsageRate; // 0x60 [Size: 0x28]
	FortGameplayAttributeData LocalFuel; // 0x88 [Size: 0x28]
};


struct AttachableWheel
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	AttachableWheelAttachData AttachData; // 0x2a0 [Size: 0x58]
	uint8_t pad_2f8[0x4]; // 0x2f8
	AttachableWheelRuntimeData RuntimeData; // 0x2fc [Size: 0xc]
};


struct FortAscenderZipline
{
public:
	uint8_t pad_0[0xee0]; // 0x0
	FVector InitialSplineEndLocation; // 0xee0 [Size: 0x18]
	uint8_t pad_ef8[0x18]; // 0xef8
	FVector TargetSplineEndLocation; // 0xf10 [Size: 0x18]
	uint8_t pad_f28[0x20]; // 0xf28
	FortPlayerPawn* PawnUsingHandle; // 0xf48 [Size: 0x8]
};


struct EntityInteractProxyActor
{
public:
	uint8_t pad_0[0x320]; // 0x0
	TArray<AController*> InteractingControllers; // 0x320 [Size: 0x10]
	Object* CachedInteractComponent; // 0x330 [Size: 0x8]
	uint8_t pad_338[0x18]; // 0x338
	bool bInteractEnabled : 1; // 0x350 [Mask: 0x1] [Bit: 0]
};


struct EntityEasingModifierBase
{
public:
	uint8_t pad_0[0x98]; // 0x0
	EntitySampledEasingModifierNative SampledEaseIn; // 0x98 [Size: 0x40]
	EntitySampledEasingModifierNative SampledEaseOut; // 0xd8 [Size: 0x40]
	double SampledEaseInDuration; // 0x118 [Size: 0x8]
	double SampledEaseInOffset; // 0x120 [Size: 0x8]
	double SampledEaseOutDuration; // 0x128 [Size: 0x8]
	double SampledEaseOutOffset; // 0x130 [Size: 0x8]
	EntityEasingModifierEaseOutRequest EaseOutRequest; // 0x138 [Size: 0x4c]
};


struct EntityModifierBase
{
public:
	uint8_t pad_0[0x40]; // 0x0
	Object* Entity; // 0x40 [Size: 0x8]
};


struct FortActorComponent_ChainLightning
{
public:
	uint8_t pad_0[0x408]; // 0x0
	TArray<FChainLightningArcData> ActiveArcData; // 0x408 [Size: 0x10]
	uint8_t pad_418[0x60]; // 0x418
	bool bLightningActive : 1; // 0x478 [Mask: 0x1] [Bit: 0]
};


struct FortChargingSet_AloeCrouton
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ChargeIncrementAmount; // 0xc0 [Size: 0x28]
	FortGameplayAttributeData ChargeRegenThreshold; // 0xe8 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0x110 [Size: 0x28]
};


struct AdHocSquadPawnOutlineComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	uint8_t AdHocSquadId; // 0x120 [Size: 0x1]
};


struct FortControllerComponent_AccoladeCollection
{
public:
	uint8_t pad_0[0x118]; // 0x0
	FName PinnedAccoladeName; // 0x118 [Size: 0x4]
	uint8_t pad_11c[0x44]; // 0x11c
	FortAccoladeCollectionDataArray AccoladeCollectionDataArray; // 0x160 [Size: 0x60]
};


struct FortControllerComponent_Accolades
{
public:
	uint8_t pad_0[0x188]; // 0x0
	FortUpdatedTrackedAccoladeDataArray UpdatedTrackedAccoladeDataArray; // 0x188 [Size: 0x60]
	FortCompletedAccoladeDataArray CompletedAccoladeDataArray; // 0x1e8 [Size: 0x60]
};


struct AChallengeManagerBase
{
public:
	uint8_t pad_0[0x318]; // 0x0
	bool bIsBossReadyForFinalFight : 1; // 0x318 [Mask: 0x1] [Bit: 0]
	uint8_t pad_319[0x1f]; // 0x319
	double BossProgress; // 0x338 [Size: 0x8]
	enum EChallengeState CurrentState; // 0x340 [Size: 0x1]
	uint8_t pad_341[0x27]; // 0x341
	int TotalProgress; // 0x368 [Size: 0x4]
};


struct FortAthenaLivingWorldPrefab
{
public:
	uint8_t pad_0[0x8f0]; // 0x0
	bool bShouldLevelBeVisible : 1; // 0x8f0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaLivingWorldDebugContainer_DensityGrid
{
public:
	uint8_t pad_0[0x28]; // 0x0
	TArray<float> DensityGridValues; // 0x28 [Size: 0x10]
	float DensityGridMaxValue; // 0x38 [Size: 0x4]
	uint8_t pad_3c[0x4]; // 0x3c
	FVector DensityGridValuesMinLocation; // 0x40 [Size: 0x18]
	FIntVector DensityGridValuesSize; // 0x58 [Size: 0xc]
	float CellSize; // 0x64 [Size: 0x4]
	float BudgetMaxDensity; // 0x68 [Size: 0x4]
};


struct FortAthenaLivingWorldDebugDensityMiniMapIndicator
{
public:
	uint8_t pad_0[0x160]; // 0x0
	TArray<FortAthenaActorDensityDebugInfo> ActorDebugInfos; // 0x160 [Size: 0x10]
	TArray<float> DensityGridValues; // 0x170 [Size: 0x10]
	FVector DensityGridValuesMinLocation; // 0x180 [Size: 0x18]
	FIntVector DensityGridValuesSize; // 0x198 [Size: 0xc]
	float CellSize; // 0x1a4 [Size: 0x4]
	float MaxDensity; // 0x1a8 [Size: 0x4]
	uint8_t pad_1ac[0x4]; // 0x1ac
	FString DisplayName; // 0x1b0 [Size: 0x10]
};


struct FortAthenaLivingWorldManager
{
public:
	uint8_t pad_0[0x3f8]; // 0x0
	TArray<SoftClassProperty> ActorClassToPreloadOnClient; // 0x3f8 [Size: 0x10]
	uint8_t pad_408[0x230]; // 0x408
	FortAthenaLivingWorldGridInjectionManager WorldGridInjectionManager; // 0x638 [Size: 0x60]
	uint8_t pad_698[0x3d0]; // 0x698
	FortAthenaLivingWorldDebugDensityMiniMapIndicator* DebugDensityMinimapIndicator; // 0xa68 [Size: 0x8]
	FortAthenaLivingWorldDebugContainersHandler DebugContainers; // 0xa70 [Size: 0x18]
};


struct FortControllerComponent_AIDebugger
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	uint8_t EnabledVisualizers; // 0xe0 [Size: 0x1]
	uint8_t NumNavMeshes; // 0xe1 [Size: 0x1]
};


struct FortWeaponBoardBase
{
public:
	uint8_t pad_0[0x2a8]; // 0x0
	FortWeaponBoardWeaponLists WeaponLists; // 0x2a8 [Size: 0x20]
};


struct FortAIComponent_RandomCustomization
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	int CharacterRandomSeed; // 0xd0 [Size: 0x4]
};


struct FortPawnComponent_AICompanionProxy
{
public:
	uint8_t pad_0[0xd9]; // 0x0
	bool bAnticsEnabled : 1; // 0xd9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_da[0x2e]; // 0xda
	AnimMontage* ReactionMontage; // 0x108 [Size: 0x20]
	uint8_t pad_128[0x20]; // 0x128
	AnimSequence* AnimSequenceToPlay; // 0x148 [Size: 0x20]
	uint8_t pad_168[0x28]; // 0x168
	float BlendInTime; // 0x190 [Size: 0x4]
	float BlendOutTime; // 0x194 [Size: 0x4]
	bool bAboutToStop : 1; // 0x198 [Mask: 0x1] [Bit: 0]
	uint8_t pad_199[0x7]; // 0x199
	FortAthenaLoadout AthenaLoadout; // 0x1a0 [Size: 0x108]
	FCosmeticLoadout CosmeticLoadout; // 0x2a8 [Size: 0x18]
};


struct FortPawnComponent_Scale
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FortPawnScaleComponentParams ScaleParams; // 0xc8 [Size: 0x8]
};


struct UNPCCharacterDefinitionComponent
{
public:
	uint8_t pad_0[0x150]; // 0x0
	UNPCCharacterDefinition* NPCCharacterDefinition; // 0x150 [Size: 0x20]
	uint8_t pad_170[0x20]; // 0x170
	TArray<UNPCCharacterModifier*> NPCCharacterModifiers; // 0x190 [Size: 0x10]
};


struct UNPCIndicatorComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EPlayerIndicatorFlags AllyIndicators; // 0xc0 [Size: 0x1]
	enum EPlayerIndicatorFlags HostileIndicators; // 0xc1 [Size: 0x1]
	enum EPlayerIndicatorFlags NeutralIndicators; // 0xc2 [Size: 0x1]
};


struct UParticipantDefinitionComponent
{
public:
	uint8_t pad_0[0x150]; // 0x0
	UNPCCharacterDefinition* ParticipantDefinition; // 0x150 [Size: 0x20]
};


struct UVerseUIUserWidget
{
public:
	uint8_t pad_0[0x170]; // 0x0
	FVerseUIUserWidgetViewmodelList ReplicatedViewmodelList; // 0x170 [Size: 0x60]
	FVerseUIUserWidgetPropertyList ReplicatedPropertyList; // 0x1d0 [Size: 0x60]
};


struct FortPlayspaceComponent_SimulationManager
{
public:
	uint8_t pad_0[0x178]; // 0x0
	Object* GameLifetimeSimulationEntity; // 0x178 [Size: 0x8]
	Object* RoundLifetimeSimulationEntity; // 0x180 [Size: 0x8]
};


struct UVerseFortniteUtilitiesComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EPreferredRenderingMode PreferredRenderingMode; // 0xc0 [Size: 0x1]
};


struct USceneGraphCameraDirectorLocatorComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	Object* CameraDirector; // 0xc0 [Size: 0x8]
};


struct FortEnergyAttrSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData MaxEnergy; // 0x30 [Size: 0x28]
	FortGameplayAttributeData RechargeAmountPerSecond; // 0x58 [Size: 0x28]
	FortGameplayAttributeData EnergyUsageMultiplier; // 0x80 [Size: 0x28]
};


struct FortQuestManagerVolume
{
public:
	uint8_t pad_0[0x3c0]; // 0x0
	FTrackingVolumeParticipantList VolumeParticipants; // 0x3c0 [Size: 0x78]
};


struct FortGameFrameworkComponent_MatchStats
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FortMatchStatFastArray ReplicatedMatchStats; // 0xe0 [Size: 0x60]
};


struct AConditionalReplicationFilterObject
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FConditionalParticipantPhaseArray PhasedTransitions; // 0x270 [Size: 0x68]
	FConditionalTransitionHashedInstigatorId HashedID; // 0x2d8 [Size: 0x4]
};


struct UConditionalTransitionComponent
{
public:
	uint8_t pad_0[0xc4]; // 0x0
	FConditionalTransitionPersistentId PersistentGuid; // 0xc4 [Size: 0x10]
};


struct FortAIBotDebugActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	AthenaAIBotDebugMiniMapIndicator* BotDebugMiniMapIndicator; // 0x270 [Size: 0x8]
};


struct FortAIBotPOIDebugActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	AthenaAIBotPOIDebugMiniMapIndicator* BotPOIDebugMiniMapIndicator; // 0x270 [Size: 0x8]
};


struct FortAthenaAIBotController
{
public:
	uint8_t pad_0[0x7d0]; // 0x0
	InterfaceProperty Inventory; // 0x7d0 [Size: 0x10]
};


struct FortCreativePatrolPath
{
public:
	uint8_t pad_0[0x450]; // 0x0
	TArray<FortCreativeDeviceProp*> CreativePatrolPoints; // 0x450 [Size: 0x10]
};


struct FortThreatVisualsManager
{
public:
	uint8_t pad_0[0x28d]; // 0x0
	bool bHideClouds : 1; // 0x28d [Mask: 0x1] [Bit: 0]
	uint8_t pad_28e[0x3a]; // 0x28e
	FThreatLocationArray ThreatLocations; // 0x2c8 [Size: 0x58]
	FStormWindArray StormWindArray; // 0x320 [Size: 0x58]
	TArray<FVector> GoalActorLocations; // 0x378 [Size: 0x10]
};


struct AthenaAIBotDebugMiniMapIndicator
{
public:
	uint8_t pad_0[0x160]; // 0x0
	TArray<FBotDebugInfo> BotDebugInfoList; // 0x160 [Size: 0x10]
	FSlateBrush DebugMinimapIconBrush; // 0x170 [Size: 0xb0]
};


struct AthenaAIBotPOIDebugMiniMapIndicator
{
public:
	uint8_t pad_0[0x160]; // 0x0
	TArray<FBotPOIDebugInfo> BotPOIDebugInfoList; // 0x160 [Size: 0x10]
	TArray<FBotPOIExcludedZonesDebugInfo> BotPOIExcludedZonesDebugInfoList; // 0x170 [Size: 0x10]
	TArray<FVector> ClusteredLootLocationsDebug; // 0x180 [Size: 0x10]
	TArray<FString> ClusteredLootNamesDebug; // 0x190 [Size: 0x10]
	int ClusteredLootDrawDebugLevel; // 0x1a0 [Size: 0x4]
	int DynamicPOIDrawDebugLevel; // 0x1a4 [Size: 0x4]
};


struct FortAIComponent_Animation
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	UProxyTable* ProxyTable; // 0xc0 [Size: 0x8]
};


struct FortAIComponent_Voice
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortTaggedSoundBank* VoiceSoundBank; // 0xc0 [Size: 0x8]
};


struct FortAISmartObjectUserComponent
{
public:
	uint8_t pad_0[0x32c]; // 0x0
	USmartObjectComponent* RunningSmartObjectComponent; // 0x32c [Size: 0x8]
};


struct FortActorFocusComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FInstancedStruct TurningStrategy; // 0xc0 [Size: 0x10]
	uint8_t pad_d0[0x8]; // 0xd0
	Actor* TargetActor; // 0xd8 [Size: 0x20]
	FVector TargetLocation; // 0xf8 [Size: 0x18]
	bool bIsPaused : 1; // 0x110 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaAILODComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EFortAILODLevel CurrentFortAILODLevel; // 0xc0 [Size: 0x1]
	uint8_t pad_c1[0x2]; // 0xc1
	bool bCouldBeVisibleToPlayers : 1; // 0xc3 [Mask: 0x2] [Bit: 1]
};


struct FortAthenaAlertStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float StealthMeterTarget; // 0xc0 [Size: 0x4]
	float StealthMeterTargetTime; // 0xc4 [Size: 0x4]
	float StealthMeterPercentage; // 0xc8 [Size: 0x4]
	bool StealthMeterUsePercentage : 1; // 0xcc [Mask: 0x1] [Bit: 0]
};


struct FortAthenaNPCLoopStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bSpawnOutsideTheLoop : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
};


struct FortNavPathRendererComponent
{
public:
	uint8_t pad_0[0x108]; // 0x0
	TArray<FVector4f> AllPathsPoints; // 0x108 [Size: 0x10]
	uint8_t pad_118[0x20]; // 0x118
	enum EPatrollingMode PathMode; // 0x138 [Size: 0x1]
	uint8_t pad_139[0x3]; // 0x139
	int CurrentPathColorIndex; // 0x13c [Size: 0x4]
};


struct FortPawnComponent_AICustomEffects
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FNPCCustomEffect> CustomEffects; // 0xc0 [Size: 0x10]
};


struct FortPawnComponent_AIEnergy
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	float CurrentEnergy; // 0xf0 [Size: 0x4]
	float CurrentMaxEnergy; // 0xf4 [Size: 0x4]
};


struct FortPawnComponent_AIPatrol
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	bool bIsPatrolling : 1; // 0xf0 [Mask: 0x1] [Bit: 0]
};


struct FortPawnComponent_BarkComponent
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	UChooserTable* SoftChooserTable; // 0xc8 [Size: 0x20]
};


struct FortPawnComponent_LookAt
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	Actor* CurrentTarget; // 0xc8 [Size: 0x8]
};


struct FortPawnComponent_Sleep
{
public:
	uint8_t pad_0[0x118]; // 0x0
	bool bIsSleeping : 1; // 0x118 [Mask: 0x2] [Bit: 1]
	bool bShouldStartSleeping : 1; // 0x118 [Mask: 0x4] [Bit: 2]
};


struct AthenaBarrierFlag
{
public:
	uint8_t pad_0[0x920]; // 0x0
	enum EBarrierFlagState CurrentState; // 0x920 [Size: 0x1]
	enum EBarrierFoodTeam FoodTeam; // 0x921 [Size: 0x1]
};


struct AthenaBarrierObjective
{
public:
	uint8_t pad_0[0x9d0]; // 0x0
	enum EBarrierFoodTeam FoodTeam; // 0x9d0 [Size: 0x1]
	enum EBarrierObjectiveDamageState ObjectiveDamageState; // 0x9d1 [Size: 0x1]
	uint8_t pad_9d2[0x2]; // 0x9d2
	float HeadRotationYaw; // 0x9d4 [Size: 0x4]
	bool bAllowDamage : 1; // 0x9d8 [Mask: 0x1] [Bit: 0]
};


struct AthenaBigBaseWall
{
public:
	uint8_t pad_0[0x920]; // 0x0
	float WallGravity; // 0x920 [Size: 0x4]
	float TimeUntilWallComesDown; // 0x924 [Size: 0x4]
	bool bResetBool : 1; // 0x928 [Mask: 0x1] [Bit: 0]
	enum EBarrierState BarrierState; // 0x929 [Size: 0x1]
};


struct AthenaBuildingFoundationObjective
{
public:
	uint8_t pad_0[0x1030]; // 0x0
	float CurrentHealth; // 0x1030 [Size: 0x4]
	float MaxHealth; // 0x1034 [Size: 0x4]
};


struct AthenaCapturePoint
{
public:
	uint8_t pad_0[0xb40]; // 0x0
	int IconMaterialIndexParameter; // 0xb40 [Size: 0x4]
	bool bPermanentShutdown : 1; // 0xb44 [Mask: 0x1] [Bit: 0]
	uint8_t pad_b45[0xeb]; // 0xb45
	bool bActivated : 1; // 0xc30 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c31[0xc7]; // 0xc31
	bool bLocked : 1; // 0xcf8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_cf9[0xb]; // 0xcf9
	int NumCapturingPoint; // 0xd04 [Size: 0x4]
	uint8_t TeamCapturingPoint; // 0xd08 [Size: 0x1]
	uint8_t TeamControllingPoint; // 0xd09 [Size: 0x1]
	uint8_t pad_d0a[0xe]; // 0xd0a
	uint8_t TeamOwningPoint; // 0xd18 [Size: 0x1]
	enum ECapturePointState CaptureState; // 0xd19 [Size: 0x1]
	uint8_t pad_d1a[0x6]; // 0xd1a
	float ReplicatedCapturePercentage; // 0xd20 [Size: 0x4]
};


struct AthenaCobaltStormShield
{
public:
	uint8_t pad_0[0x570]; // 0x0
	FortAthenaMutator_Cobalt* CachedMutator; // 0x570 [Size: 0x8]
	uint8_t pad_578[0x28]; // 0x578
	float ClientStormShieldShrinkTimerValue; // 0x5a0 [Size: 0x4]
};


struct AthenaHoldingArea
{
public:
	uint8_t pad_0[0x928]; // 0x0
	bool bHoldingAreaActive : 1; // 0x928 [Mask: 0x1] [Bit: 0]
	uint8_t pad_929[0x7]; // 0x929
	FIgnoredPlayerPawnArray IgnoredPlayerPawns; // 0x930 [Size: 0x60]
};


struct AthenaSkyCap
{
public:
	uint8_t pad_0[0x290]; // 0x0
	enum ESkyCapState SkyCapState; // 0x290 [Size: 0x1]
};


struct AthenaTraversePoint
{
public:
	uint8_t pad_0[0xaa1]; // 0x0
	enum ETraversePointState CurrentState; // 0xaa1 [Size: 0x1]
};


struct ABattleLabDeviceGameplayActor_VendingMachine
{
public:
	uint8_t pad_0[0x948]; // 0x0
	FortPickup* DroppedIntoFunnelPickup; // 0x948 [Size: 0x8]
};


struct ABuildingActor
{
public:
	uint8_t pad_0[0x37c]; // 0x0
	int16_t OwnerPersistentID; // 0x37c [Size: 0x2]
	uint8_t pad_37e[0x32]; // 0x37e
	TArray<FortAthenaVehicle*> InitialOverlappingVehicles; // 0x3b0 [Size: 0x10]
	int CurrentBuildingLevel; // 0x3c0 [Size: 0x4]
	int HealthBarIndicatorDifficultyRating; // 0x3c4 [Size: 0x4]
	uint8_t pad_3c8[0x18]; // 0x3c8
	FortBuildingActorSet* ReplicatedBuildingAttributeSet; // 0x3e0 [Size: 0x8]
	uint8_t pad_3e8[0x28]; // 0x3e8
	FortAbilitySystemComponent* ReplicatedAbilitySystemComponent; // 0x410 [Size: 0x8]
	uint8_t pad_418[0x18]; // 0x418
	uint8_t ForceMetadataRelevant; // 0x430 [Size: 0x1]
	uint8_t pad_431[0xb]; // 0x431
	bool bIsInvulnerable : 1; // 0x43c [Mask: 0x2] [Bit: 1]
	bool bPreviewBuildingActor : 1; // 0x43c [Mask: 0x4] [Bit: 2]
	bool bLockedFromGameEditing : 1; // 0x43c [Mask: 0x8] [Bit: 3]
	bool bSurpressHealthBar : 1; // 0x43d [Mask: 0x40] [Bit: 6]
	bool bDestroyed : 1; // 0x43e [Mask: 0x40] [Bit: 6]
	uint8_t pad_43f[0x3]; // 0x43f
	bool bPlayerPlaced : 1; // 0x442 [Mask: 0x40] [Bit: 6]
	bool bPlayerPlacedForDestruction : 1; // 0x442 [Mask: 0x80] [Bit: 7]
	uint8_t pad_443[0x1]; // 0x443
	bool bInstantDeath : 1; // 0x444 [Mask: 0x20] [Bit: 5]
	bool bDoNotBlockBuildings : 1; // 0x444 [Mask: 0x40] [Bit: 6]
	bool bForceBlockBuildings : 1; // 0x444 [Mask: 0x80] [Bit: 7]
	bool bDestroyOnPlayerBuildingPlacement : 1; // 0x445 [Mask: 0x1] [Bit: 0]
	bool bUseCentroidForBlockBuildingsCheck : 1; // 0x445 [Mask: 0x2] [Bit: 1]
	uint8_t pad_446[0x1]; // 0x446
	bool bCollisionBlockedByPawns : 1; // 0x447 [Mask: 0x1] [Bit: 0]
	uint8_t pad_448[0x3]; // 0x448
	uint8_t TeamIndex; // 0x44b [Size: 0x1]
	uint8_t pad_44c[0x44]; // 0x44c
	int DeviceTrackingGUID; // 0x490 [Size: 0x4]
	int DeviceNameIndex; // 0x494 [Size: 0x4]
	uint8_t pad_498[0x40]; // 0x498
	FortMission* AssociatedMissionParam; // 0x4d8 [Size: 0x8]
	FortPlacementActor* OriginatingPlacementActor; // 0x4e0 [Size: 0x8]
	uint8_t pad_4e8[0xcc]; // 0x4e8
	float BaselineScale; // 0x5b4 [Size: 0x4]
	FString CustomState; // 0x5b8 [Size: 0x10]
};


struct ABuildingContainer
{
public:
	uint8_t pad_0[0xb50]; // 0x0
	UStaticMesh* SearchedMesh; // 0xb50 [Size: 0x8]
	uint8_t pad_b58[0x68]; // 0xb58
	int ReplicatedLootTier; // 0xbc0 [Size: 0x4]
	int ChosenRandomUpgrade; // 0xbc4 [Size: 0x4]
	uint8_t pad_bc8[0x11a]; // 0xbc8
	bool bAlreadySearched : 1; // 0xce2 [Mask: 0x10] [Bit: 4]
	uint8_t pad_ce3[0x2d]; // 0xce3
	FortSearchBounceData SearchBounceData; // 0xd10 [Size: 0x18]
};


struct ABuildingCustomizableSpawnContainer
{
public:
	uint8_t pad_0[0xd70]; // 0x0
	TArray<FortItemQuantityPair> SpawnItems; // 0xd70 [Size: 0x10]
	FortMinigameItemListComponent* ItemListComponent; // 0xd80 [Size: 0x8]
};


struct ABuildingFillFloor
{
public:
	uint8_t pad_0[0x988]; // 0x0
	int StepIndex; // 0x988 [Size: 0x4]
	float FloorZ; // 0x98c [Size: 0x4]
	uint8_t pad_990[0xd4]; // 0x990
	float FloorMovementSpeed; // 0xa64 [Size: 0x4]
	uint8_t pad_a68[0x18]; // 0xa68
	bool bIsMoving : 1; // 0xa80 [Mask: 0x1] [Bit: 0]
};


struct ABuildingFoundation
{
public:
	uint8_t pad_0[0xb28]; // 0x0
	bool bServerStreamedInLevel : 1; // 0xb28 [Mask: 0x2] [Bit: 1]
	uint8_t pad_b29[0x4f]; // 0xb29
	FName LevelToStream; // 0xb78 [Size: 0x4]
	uint8_t pad_b7c[0x2ac]; // 0xb7c
	FDynamicBuildingFoundationRepData DynamicFoundationRepData; // 0xe28 [Size: 0x38]
};


struct ABuildingGameplayActorBalloon
{
public:
	uint8_t pad_0[0x920]; // 0x0
	int BalloonLocationSelection; // 0x920 [Size: 0x4]
};


struct ABuildingGameplayActorCampFire
{
public:
	uint8_t pad_0[0x9a0]; // 0x0
	bool bStokedNative : 1; // 0x9a0 [Mask: 0x1] [Bit: 0]
	bool bHasBeenLitNative : 1; // 0x9a0 [Mask: 0x2] [Bit: 1]
	bool bBeenUsedNative : 1; // 0x9a0 [Mask: 0x4] [Bit: 2]
	bool bHotfixEnabledNative : 1; // 0x9a0 [Mask: 0x10] [Bit: 4]
	bool bBlockInteractionNative : 1; // 0x9a0 [Mask: 0x40] [Bit: 6]
	uint8_t pad_9a1[0x3]; // 0x9a1
	int LitRepBoolNative; // 0x9a4 [Size: 0x4]
	uint8_t pad_9a8[0x10]; // 0x9a8
	FortPawn* InteractingPawnNative; // 0x9b8 [Size: 0x8]
};


struct ABuildingGameplayActorChaser
{
public:
	uint8_t pad_0[0xc08]; // 0x0
	FChaserPatrolTurnData PatrolTurnData; // 0xc08 [Size: 0x40]
};


struct ABuildingGameplayActorCloneMachine
{
public:
	uint8_t pad_0[0x9e0]; // 0x0
	float ActivationServerEndTime; // 0x9e0 [Size: 0x4]
	float RespawnServerEndTime; // 0x9e4 [Size: 0x4]
};


struct ABuildingGameplayActorConsumable
{
public:
	uint8_t pad_0[0x920]; // 0x0
	FortWorldItemDefinition* ItemDefinition; // 0x920 [Size: 0x8]
};


struct ABuildingGameplayActorLockOnConsumable
{
public:
	uint8_t pad_0[0x9b0]; // 0x0
	FortPlayerPawn* InteractingPawn; // 0x9b0 [Size: 0x8]
};


struct ABuildingGameplayActorPetrol
{
public:
	uint8_t pad_0[0x9b0]; // 0x0
	Actor* PrevPetrol; // 0x9b0 [Size: 0x8]
	FVector ImpactDirection; // 0x9b8 [Size: 0x18]
	bool bIgnited : 1; // 0x9d0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9d1[0x3]; // 0x9d1
	int ProjectileCount; // 0x9d4 [Size: 0x4]
};


struct ABuildingGameplayActorSentry
{
public:
	uint8_t pad_0[0x95a]; // 0x0
	enum EBuildingGameplayActorSentry_State CurrentSentryState; // 0x95a [Size: 0x1]
	uint8_t pad_95b[0x5]; // 0x95b
	Actor* ActorBeingTracked; // 0x960 [Size: 0x8]
	uint8_t pad_968[0xe8]; // 0x968
	enum EBuildingGameplayActorSentry_IdleBehavior IdleBehavior; // 0xa50 [Size: 0x1]
	uint8_t pad_a51[0x5f]; // 0xa51
	FRotator ExactIdleRotationForInitialization; // 0xab0 [Size: 0x18]
	FRotator ForceReplicateTargetRotation; // 0xac8 [Size: 0x18]
	uint8_t pad_ae0[0x40]; // 0xae0
	FRotator StartingIdleRotation; // 0xb20 [Size: 0x18]
	FRotator FixedRotationGoalReplicated; // 0xb38 [Size: 0x18]
	uint8_t pad_b50[0x18]; // 0xb50
	FRotator LocatingDamage_OvershootRotationDestination; // 0xb68 [Size: 0x18]
	uint8_t pad_b80[0x58]; // 0xb80
	float LocatingDamage_RotationSpeedScalar; // 0xbd8 [Size: 0x4]
};


struct ABuildingGameplayActorSpawnChip
{
public:
	uint8_t pad_0[0x988]; // 0x0
	FRebootCardReplicatedState RebootCardReplicatedState; // 0x988 [Size: 0x10]
	uint8_t pad_998[0x51]; // 0x998
	uint8_t SquadId; // 0x9e9 [Size: 0x1]
};


struct ABuildingGameplayActorSpawnMachine
{
public:
	uint8_t pad_0[0x94a]; // 0x0
	enum ESpawnMachineState SpawnMachineState; // 0x94a [Size: 0x1]
	uint8_t pad_94b[0x18d]; // 0x94b
	int HandleIntoGameState; // 0xad8 [Size: 0x4]
};


struct ABuildingItemCollectorActor
{
public:
	uint8_t pad_0[0x943]; // 0x0
	enum EFortItemCollectorState ItemCollectorState; // 0x943 [Size: 0x1]
	enum EFortItemCollectorTrackingType TrackingType; // 0x944 [Size: 0x1]
	uint8_t pad_945[0x3]; // 0x945
	FortPlayerController* ControllingPlayer; // 0x948 [Size: 0x8]
	uint8_t pad_950[0x19]; // 0x950
	bool bUseInstanceLootValueOverrides : 1; // 0x969 [Mask: 0x1] [Bit: 0]
	uint8_t pad_96a[0x6]; // 0x96a
	TArray<FortItemQuantityPair> OverrideOutputItems; // 0x970 [Size: 0x10]
	uint8_t pad_980[0x60]; // 0x980
	TArray<FCollectorUnitInfo> ItemCollections; // 0x9e0 [Size: 0x10]
	uint8_t pad_9f0[0x10]; // 0x9f0
	FortWorldItemDefinition* ActiveInputItem; // 0xa00 [Size: 0x8]
	uint8_t pad_a08[0x134]; // 0xa08
	int StartingGoalLevel; // 0xb3c [Size: 0x4]
	uint8_t pad_b40[0x38]; // 0xb40
	TArray<FCollectorTrackedData> TrackedInteractionData; // 0xb78 [Size: 0x10]
};


struct ABuildingItemWeaponUpgradeActor
{
public:
	uint8_t pad_0[0xb90]; // 0x0
	bool bAllowSecondInteraction : 1; // 0xb90 [Mask: 0x1] [Bit: 0]
};


struct ABuildingLayoutRequirement
{
public:
	uint8_t pad_0[0xb53]; // 0x0
	bool bRequirementSatisfied : 1; // 0xb53 [Mask: 0x1] [Bit: 0]
	enum ELayoutRequirementStatus RequirementStatus; // 0xb54 [Size: 0x1]
};


struct ABuildingLevelInstance
{
public:
	uint8_t pad_0[0x6d0]; // 0x0
	FGuid LevelInstanceSpawnGuid; // 0x6d0 [Size: 0x10]
};


struct ABuildingPhoenixItemCollectorActor
{
public:
	uint8_t pad_0[0xbb0]; // 0x0
	TArray<FRecipe> OutputItemRecipes; // 0xbb0 [Size: 0x10]
};


struct ABuildingPropBigHealth
{
public:
	uint8_t pad_0[0xb18]; // 0x0
	int64_t BigHealth; // 0xb18 [Size: 0x8]
	int64_t BigHealthMax; // 0xb20 [Size: 0x8]
};


struct ABuildingPropLedge
{
public:
	uint8_t pad_0[0xb18]; // 0x0
	bool bIsLedgeEnabled : 1; // 0xb18 [Mask: 0x1] [Bit: 0]
};


struct ABuildingPropMusicPlayer
{
public:
	uint8_t pad_0[0xb38]; // 0x0
	TArray<Object*> MusicArray; // 0xb38 [Size: 0x10]
	FMusicPlayerData PlayingSongData; // 0xb48 [Size: 0x8]
};


struct ABuildingProp_BountyBoard
{
public:
	uint8_t pad_0[0xc70]; // 0x0
	TArray<FortPlayerStateAthena*> PlayersGrantedBounty; // 0xc70 [Size: 0x10]
};


struct ABuildingProp_LockDevice
{
public:
	uint8_t pad_0[0xb60]; // 0x0
	Actor* LockableObject; // 0xb60 [Size: 0x8]
	enum ELockState CurrentLockState; // 0xb68 [Size: 0x1]
	bool HideInteractionWhenLocked : 1; // 0xb69 [Mask: 0x1] [Bit: 0]
};


struct ABuildingRift
{
public:
	uint8_t pad_0[0x8d0]; // 0x0
	bool bRiftIsVisible : 1; // 0x8d0 [Mask: 0x1] [Bit: 0]
	bool bRiftIsActive : 1; // 0x8d0 [Mask: 0x2] [Bit: 1]
	uint8_t pad_8d1[0x1c7]; // 0x8d1
	enum ERiftCosmeticState CosmeticState; // 0xa98 [Size: 0x1]
};


struct ABuildingSMActor
{
public:
	uint8_t pad_0[0x6d8]; // 0x0
	UBuildingTextureData* TextureData; // 0x6d8 [Size: 0x20]
	UStaticMesh* StaticMesh; // 0x6f8 [Size: 0x8]
	bool bNoPhysicsCollision : 1; // 0x700 [Mask: 0x2] [Bit: 1]
	bool bNoCameraCollision : 1; // 0x700 [Mask: 0x4] [Bit: 2]
	enum EFortResourceType ResourceType; // 0x701 [Size: 0x1]
	uint8_t pad_702[0x2]; // 0x702
	int AltMeshIdx; // 0x704 [Size: 0x4]
	bool bMirrored : 1; // 0x708 [Mask: 0x2] [Bit: 1]
	bool bNoCollision : 1; // 0x708 [Mask: 0x4] [Bit: 2]
	bool bSupportsRepairing : 1; // 0x708 [Mask: 0x10] [Bit: 4]
	bool bHiddenDueToTrapPlacement : 1; // 0x708 [Mask: 0x20] [Bit: 5]
	bool bAttachmentPlacementBlockedFront : 1; // 0x708 [Mask: 0x40] [Bit: 6]
	bool bAttachmentPlacementBlockedBack : 1; // 0x708 [Mask: 0x80] [Bit: 7]
	bool bUnderConstruction : 1; // 0x709 [Mask: 0x1] [Bit: 0]
	bool bUnderRepair : 1; // 0x709 [Mask: 0x2] [Bit: 1]
	bool bIsInitiallyBuilding : 1; // 0x709 [Mask: 0x4] [Bit: 2]
	bool bIncludeChildMeshComponentsInCollision : 1; // 0x70a [Mask: 0x8] [Bit: 3]
	uint8_t pad_70b[0x3]; // 0x70b
	enum EBuildingAnim BuildingAnimation; // 0x70e [Size: 0x1]
	uint8_t pad_70f[0x49]; // 0x70f
	FVector3f ReplicatedDrawScale3D; // 0x758 [Size: 0xc]
	uint8_t pad_764[0x74]; // 0x764
	FBuildingActorMinimalReplicationProxy MinimalReplicationProxy; // 0x7d8 [Size: 0x4]
	uint8_t pad_7dc[0x15c]; // 0x7dc
	enum EBuildingReplacementType BuildingReplacementType; // 0x938 [Size: 0x1]
	uint8_t pad_939[0xb]; // 0x939
	enum EBuildingAttachmentSlot BuildingAttachmentSlot; // 0x944 [Size: 0x1]
	uint8_t pad_945[0x1b]; // 0x945
	FortPlayerStateZone* EditingPlayer; // 0x960 [Size: 0x8]
	uint8_t pad_968[0xf0]; // 0x968
	ABuildingSMActor* DamagerOwner; // 0xa58 [Size: 0x8]
	FortConstructorBASE* RelevantBASE; // 0xa60 [Size: 0x8]
	uint8_t pad_a68[0x38]; // 0xa68
	FProxyGameplayCueDamage ProxyGameplayCueDamage; // 0xaa0 [Size: 0x20]
};


struct ABuildingStaticGeo
{
public:
	uint8_t pad_0[0x300]; // 0x0
	UBuildingTextureData* TextureData; // 0x300 [Size: 0x20]
	uint8_t pad_320[0x5c]; // 0x320
	FVector3f ReplicatedDrawScale3D; // 0x37c [Size: 0xc]
};


struct ABuildingTrap
{
public:
	uint8_t pad_0[0xb60]; // 0x0
	FortTrapItemDefinition* TrapData; // 0xb60 [Size: 0x8]
	uint8_t pad_b68[0x80]; // 0xb68
	TArray<FortAlterationItemDefinition*> AppliedAlterations; // 0xbe8 [Size: 0x10]
	uint8_t pad_bf8[0x10]; // 0xbf8
	ABuildingSMActor* AttachedTo; // 0xc08 [Size: 0x8]
	uint8_t pad_c10[0x150]; // 0xc10
	int TrapLevel; // 0xd60 [Size: 0x4]
	int OriginalTrapLevel; // 0xd64 [Size: 0x4]
	bool bTrapRecharging : 1; // 0xd68 [Mask: 0x1] [Bit: 0]
};


struct ABuildingTrapDefender
{
public:
	uint8_t pad_0[0xdc0]; // 0x0
	FortAIPawn* DefenderPawn; // 0xdc0 [Size: 0x8]
	FortDefenderItemDefinition* DefenderItemDefinition; // 0xdc8 [Size: 0x8]
	int DefenderItemLevel; // 0xdd0 [Size: 0x4]
};


struct ABuildingTrapFloor_TargetDummy
{
public:
	uint8_t pad_0[0xdb8]; // 0x0
	TArray<FVector> PathPointLocations; // 0xdb8 [Size: 0x10]
};


struct ABuildingTrapFloor_Turret
{
public:
	uint8_t pad_0[0xdf8]; // 0x0
	FortPawn* Target; // 0xdf8 [Size: 0x8]
	uint8_t pad_e00[0x8]; // 0xe00
	float CurrentRotationalSpeed; // 0xe08 [Size: 0x4]
	uint8_t pad_e0c[0x10]; // 0xe0c
	bool bCurrentlyActive : 1; // 0xe1c [Mask: 0x1] [Bit: 0]
	uint8_t pad_e1d[0x3]; // 0xe1d
	FVector ShootLocation; // 0xe20 [Size: 0x18]
	uint8_t pad_e38[0x50]; // 0xe38
	bool bIsSearching : 1; // 0xe88 [Mask: 0x1] [Bit: 0]
};


struct ABuildingWall
{
public:
	uint8_t pad_0[0xbf8]; // 0x0
	UMaterialInterface* DoorAnimatingMaterial; // 0xbf8 [Size: 0x8]
	uint8_t pad_c00[0x8]; // 0xc00
	UStaticMesh* DoorMesh; // 0xc08 [Size: 0x8]
	UStaticMesh* DoubleDoorMesh; // 0xc10 [Size: 0x8]
	uint8_t pad_c18[0x79]; // 0xc18
	enum EDoorOpenStyle DoorOpenStyle; // 0xc91 [Size: 0x1]
	bool bDoorOpen : 1; // 0xc92 [Mask: 0x80] [Bit: 7]
	bool bDoorCollisionDisabled : 1; // 0xc93 [Mask: 0x2] [Bit: 1]
	bool bFastOpenCloseRequested : 1; // 0xc93 [Mask: 0x40] [Bit: 6]
};


struct AContentBeaconClientV2
{
public:
	uint8_t pad_0[0x308]; // 0x0
	FContentMessageArrayV2 ContentMessagesArray; // 0x308 [Size: 0x70]
	uint8_t pad_378[0x150]; // 0x378
	FString DebugRootIdentiferString; // 0x4c8 [Size: 0x10]
	uint8_t pad_4d8[0x1]; // 0x4d8
	bool bIsClientInSync : 1; // 0x4d9 [Mask: 0x1] [Bit: 0]
	bool bIsGeneratingManifests : 1; // 0x4da [Mask: 0x1] [Bit: 0]
	uint8_t pad_4db[0x5]; // 0x4db
	FContentBeaconClientReplicatedModuleFastArray ClientContentModules; // 0x4e0 [Size: 0x58]
	uint8_t pad_538[0x10]; // 0x538
	TArray<FContentBeaconPinnedVersePath> PinnedVersePaths; // 0x548 [Size: 0x10]
	TArray<FContentBeaconPinnedResolvedModule> PinnedResolvedModules; // 0x558 [Size: 0x10]
	TArray<FContentBeaconPinnedResolvedContent> PinnedResolvedContent; // 0x568 [Size: 0x10]
};


struct ACreativeMoveToolBlueprintPreview
{
public:
	uint8_t pad_0[0x410]; // 0x0
	FTransform DropStartTransform; // 0x410 [Size: 0x60]
	uint8_t pad_470[0x260]; // 0x470
	UObjectInteractionBehavior* ObjectManipulationBehavior; // 0x6d0 [Size: 0x8]
	uint8_t pad_6d8[0xb0]; // 0x6d8
	enum ECreativeMoveToolPreviewFX FXState; // 0x788 [Size: 0x1]
	uint8_t pad_789[0x67]; // 0x789
	bool bPlayTransitionBackwardsWhenAnimEnds : 1; // 0x7f0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_7f1[0x9f]; // 0x7f1
	Object* BaseObject; // 0x890 [Size: 0x8]
};


struct ACreativePlayerReplicationProxy
{
public:
	uint8_t pad_0[0x270]; // 0x0
	UCreativeProxyManagerComponent* ProxyManagerOwnerComponent; // 0x270 [Size: 0x8]
	UCreativeProxyManagerComponent* ProxyManagerOwnerComponentWeakPtr; // 0x278 [Size: 0x8]
};


struct ADeployableBasePlot
{
public:
	uint8_t pad_0[0x928]; // 0x0
	UniqueNetIdRepl OccupantNetID; // 0x928 [Size: 0x30]
	uint8_t pad_958[0x84]; // 0x958
	enum EDeployableBaseBuildingState CurrentBuildingState; // 0x9dc [Size: 0x1]
	uint8_t pad_9dd[0x63]; // 0x9dd
	FortInventory* PlotInventory; // 0xa40 [Size: 0x8]
	uint8_t pad_a48[0x20]; // 0xa48
	FIntVector BuildableSpaceExpansionVector; // 0xa68 [Size: 0xc]
	uint8_t pad_a74[0x3c]; // 0xa74
	FBox BuildableAreasStructuralSupportBoxesArray; // 0xab0 [Size: 0xa8]
};


struct FortAIPawn
{
public:
	uint8_t pad_0[0x1f90]; // 0x0
	FortAIAttributeReplicationProxy AttributeReplicationProxy; // 0x1f90 [Size: 0x10]
	FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x1fa0 [Size: 0x38]
	FGameplayAbilityRepSharedAnim RepSharedAnimInfo; // 0x1fd8 [Size: 0x10]
	uint8_t pad_1fe8[0x8]; // 0x1fe8
	FMinimalGameplayCueReplicationProxy SimulatedProxyGameplayCues; // 0x1ff0 [Size: 0x2c0]
	bool bHasGoalActor : 1; // 0x22b0 [Mask: 0x40] [Bit: 6]
	bool bFrozen : 1; // 0x22b0 [Mask: 0x80] [Bit: 7]
	uint8_t pad_22b1[0x29]; // 0x22b1
	bool bIsCharging : 1; // 0x22da [Mask: 0x4] [Bit: 2]
	bool bIsCowering : 1; // 0x22da [Mask: 0x8] [Bit: 3]
	bool bEnableBlockingCollisionWithOtherAI : 1; // 0x22db [Mask: 0x10] [Bit: 4]
	bool bEnableBlockingCollisionWithPawns : 1; // 0x22db [Mask: 0x20] [Bit: 5]
	uint8_t pad_22dc[0x4]; // 0x22dc
	FMinimalReplicationTagCountMap FastReplicationMinimalReplicationTags; // 0x22e0 [Size: 0x28]
	FMinimalReplicationTagCountMap FastReplicationReplicatedLooseTags; // 0x2308 [Size: 0x28]
	FMinimalGameplayCueReplicationProxy FastReplicationMinimalGameplayCueProxy; // 0x2330 [Size: 0x2c0]
	uint8_t pad_25f0[0x60]; // 0x25f0
	float AIDifficultyLevel; // 0x2650 [Size: 0x4]
	uint8_t pad_2654[0x3c]; // 0x2654
	Actor* SpawnRift; // 0x2690 [Size: 0x8]
	uint8_t pad_2698[0x48]; // 0x2698
	float DBNOInteractionDuration; // 0x26e0 [Size: 0x4]
	uint8_t pad_26e4[0x14]; // 0x26e4
	enum TInteractionType DBNOInteractionType; // 0x26f8 [Size: 0x1]
	uint8_t pad_26f9[0xfb]; // 0x26f9
	float LocomotionPlayRateScale; // 0x27f4 [Size: 0x4]
	uint8_t pad_27f8[0x1d8]; // 0x27f8
	int8_t MinimapGoalByTagColorIndex; // 0x29d0 [Size: 0x1]
	uint8_t pad_29d1[0xa8]; // 0x29d1
	bool bCanLookAtGoal : 1; // 0x2a79 [Mask: 0x10] [Bit: 4]
	bool bCanBeBaseForOtherPawns : 1; // 0x2a7a [Mask: 0x10] [Bit: 4]
	bool bCanInteract : 1; // 0x2a7b [Mask: 0x80] [Bit: 7]
	uint8_t pad_2a7c[0x14]; // 0x2a7c
	FortPlayerState* BeingControlledBy; // 0x2a90 [Size: 0x8]
	enum EFortMovementUrgency MovementUrgency; // 0x2a98 [Size: 0x1]
	bool bIsEncounterAI : 1; // 0x2a99 [Mask: 0x1] [Bit: 0]
	uint8_t Team; // 0x2a9a [Size: 0x1]
	uint8_t pad_2a9b[0x5]; // 0x2a9b
	FortAISpawnGroupUpgradeUIData UpgradeUIData; // 0x2aa0 [Size: 0x68]
	uint8_t pad_2b08[0xe0]; // 0x2b08
	FortPlayerStateZone* PlayerManager; // 0x2be8 [Size: 0x8]
	FString DefenderItemInstanceId; // 0x2bf0 [Size: 0x10]
	FName DefenderSquadId; // 0x2c00 [Size: 0x4]
	float DefenderPlacedTime; // 0x2c04 [Size: 0x4]
	uint8_t pad_2c08[0x8]; // 0x2c08
	FRotator CurrentAIRotationRate; // 0x2c10 [Size: 0x18]
	uint8_t pad_2c28[0x20]; // 0x2c28
	FortInventory* Inventory; // 0x2c48 [Size: 0x8]
	uint8_t pad_2c50[0x40]; // 0x2c50
	int AppearanceOverrideEntryIndex; // 0x2c90 [Size: 0x4]
	uint8_t pad_2c94[0x7c]; // 0x2c94
	float MinimapViewableDistance; // 0x2d10 [Size: 0x4]
	uint8_t pad_2d14[0x2d4]; // 0x2d14
	TArray<FortGameplayModifierItemDefinition*> SpawnModifierDefinitions; // 0x2fe8 [Size: 0x10]
	uint8_t pad_2ff8[0xa0]; // 0x2ff8
	Actor* CurrentAimTarget; // 0x3098 [Size: 0x8]
	FVector CurrentAimLocation; // 0x30a0 [Size: 0x18]
	uint8_t pad_30b8[0x8]; // 0x30b8
	float CurrentPathLength; // 0x30c0 [Size: 0x4]
	float CurrentMaxSpeed; // 0x30c4 [Size: 0x4]
	uint8_t pad_30c8[0x448]; // 0x30c8
	FortPawn* TetheredFollower; // 0x3510 [Size: 0x8]
	uint8_t pad_3518[0x20]; // 0x3518
	bool bIsTetheredBoosting : 1; // 0x3538 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3539[0x37]; // 0x3539
	FortAIPawnCustomizationDefinition* CustomizationsToLoad; // 0x3570 [Size: 0x8]
	bool bCanUnloadCustomization : 1; // 0x3578 [Mask: 0x1] [Bit: 0]
};


struct FortAircraft
{
public:
	uint8_t pad_0[0x270]; // 0x0
	int JumpFlashCount; // 0x270 [Size: 0x4]
};


struct FortAmbientAudioSpline
{
public:
	uint8_t pad_0[0x288]; // 0x0
	bool bEnabled : 1; // 0x288 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaAircraft
{
public:
	uint8_t pad_0[0x301]; // 0x0
	bool bFlightExternalAuthoritative : 1; // 0x301 [Mask: 0x1] [Bit: 0]
	uint8_t pad_302[0x1e]; // 0x302
	AircraftFlightInfo FlightInfo; // 0x320 [Size: 0x48]
	float FlightStartTime; // 0x368 [Size: 0x4]
	float FlightEndTime; // 0x36c [Size: 0x4]
	float DropStartTime; // 0x370 [Size: 0x4]
	float DropEndTime; // 0x374 [Size: 0x4]
	uint8_t pad_378[0x4]; // 0x378
	float ReplicatedFlightTimestamp; // 0x37c [Size: 0x4]
	uint8_t pad_380[0x1a8]; // 0x380
	int AircraftIndex; // 0x528 [Size: 0x4]
};


struct FortAthenaCreativePortal
{
public:
	uint8_t pad_0[0x9c0]; // 0x0
	bool bReturnToCreativeHub : 1; // 0x9c0 [Mask: 0x1] [Bit: 0]
	bool bInErrorState : 1; // 0x9c1 [Mask: 0x1] [Bit: 0]
	bool bUserInitiatedLoad : 1; // 0x9c2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9c3[0x5]; // 0x9c3
	FCreativeIslandData CachedEditIslandData; // 0x9c8 [Size: 0x70]
	FCreativeLoadedLinkData IslandInfo; // 0xa38 [Size: 0x2e8]
	FText VolumeStatus; // 0xd20 [Size: 0x10]
	FString EditOverridePlaylist; // 0xd30 [Size: 0x10]
	uint8_t pad_d40[0x20]; // 0xd40
	bool bIsPlotLoadTimeOut : 1; // 0xd60 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d61[0x4f]; // 0xd61
	uint8_t CurrentPopulation; // 0xdb0 [Size: 0x1]
	uint8_t MaxAvailablePopulation; // 0xdb1 [Size: 0x1]
	uint8_t pad_db2[0x6]; // 0xdb2
	UniqueNetIdRepl OwningPlayer; // 0xdb8 [Size: 0x30]
	TArray<UniqueNetIdRepl> PlayersReady; // 0xde8 [Size: 0x10]
	bool bIsPublishedPortal : 1; // 0xdf8 [Mask: 0x1] [Bit: 0]
	bool bIsUsingUGC : 1; // 0xdf9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_dfa[0x6]; // 0xdfa
	FVector TeleportLocation; // 0xe00 [Size: 0x18]
	uint8_t pad_e18[0x2b]; // 0xe18
	bool bPortalOpen : 1; // 0xe43 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaCreativeSupplyDrop
{
public:
	uint8_t pad_0[0xab0]; // 0x0
	TArray<FortItemQuantityPair> SpawnItems; // 0xab0 [Size: 0x10]
	FortMinigameItemListComponent* ItemListComponent; // 0xac0 [Size: 0x8]
};


struct FortAthenaDoghouseVehicle
{
public:
	uint8_t pad_0[0x2294]; // 0x0
	float StallAltitudeZOverride; // 0x2294 [Size: 0x4]
	uint8_t pad_2298[0x488]; // 0x2298
	FReplicatedControlState ControlState; // 0x2720 [Size: 0x38]
};


struct FortAthenaExitCraft
{
public:
	uint8_t pad_0[0x1f98]; // 0x0
	FortAthenaExitCraftInfo* ExitCraftInfo; // 0x1f98 [Size: 0x8]
	uint8_t pad_1fa0[0x30]; // 0x1fa0
	bool bCorrectionMade : 1; // 0x1fd0 [Mask: 0x1] [Bit: 0]
	enum EExitCraftState CurrentState; // 0x1fd1 [Size: 0x1]
	uint8_t pad_1fd2[0x6]; // 0x1fd2
	TArray<FortPlayerPawnAthena*> OverlappingPawns; // 0x1fd8 [Size: 0x10]
	uint8_t pad_1fe8[0x110]; // 0x1fe8
	FortAthenaExitCraftBalloon* BalloonActor; // 0x20f8 [Size: 0x8]
	uint8_t pad_2100[0x60]; // 0x2100
	int VehicleSkinIndex; // 0x2160 [Size: 0x4]
	uint8_t pad_2164[0x5c]; // 0x2164
	bool bUseCheatExtract : 1; // 0x21c0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_21c1[0x17]; // 0x21c1
	FLocationLerpData LocationLerpData; // 0x21d8 [Size: 0x60]
	uint8_t pad_2238[0x8]; // 0x2238
	FRotationLerpData RotationLerpData; // 0x2240 [Size: 0x80]
};


struct FortAthenaFerretVehicle
{
public:
	uint8_t pad_0[0x28a8]; // 0x0
	float MaxHealthToDestroyPropWhileBoosting; // 0x28a8 [Size: 0x4]
	float MaxHealthToDestroyPropWithDirectHit; // 0x28ac [Size: 0x4]
	float MaxHealthToDestroyProp; // 0x28b0 [Size: 0x4]
};


struct FortAthenaMutator_AdHocSquads
{
public:
	uint8_t pad_0[0x538]; // 0x0
	uint8_t FirstAdHocTeamAndSquadId; // 0x538 [Size: 0x1]
	uint8_t pad_539[0x3f]; // 0x539
	AdHocSquad_InviteDataArray InviteDataArray; // 0x578 [Size: 0x60]
};


struct FortAthenaMutator_AddBarrier
{
public:
	uint8_t pad_0[0x368]; // 0x0
	AthenaBigBaseWall* BigBaseWall; // 0x368 [Size: 0x8]
};


struct FortAthenaMutator_AllowItemDrop
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bAllowItemDrop : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_AllowItemPickUp
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bAllowItemPickUp : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_AllowSpectateOtherTeams
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bAllowSpectateOtherTeams : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Ashton
{
public:
	uint8_t pad_0[0x334]; // 0x0
	int MaxScore; // 0x334 [Size: 0x4]
	uint8_t pad_338[0xa28]; // 0x338
	TArray<AshtonStoneState> StoneList; // 0xd60 [Size: 0x10]
	uint8_t pad_d70[0x10]; // 0xd70
	FVector_NetQuantize VillainLeaderLocationForSnapSound; // 0xd80 [Size: 0x18]
	FVector_NetQuantize VillainLeaderLocationForDeathSound; // 0xd98 [Size: 0x18]
	FVector_NetQuantize VillainLeaderLocationForSound; // 0xdb0 [Size: 0x18]
	uint8_t pad_dc8[0x298]; // 0xdc8
	int NumVillainLivesRemaining; // 0x1060 [Size: 0x4]
	bool bVillainRespawnEnabled : 1; // 0x1064 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1065[0x3]; // 0x1065
	int TotalNumHeroLivesRemaining; // 0x1068 [Size: 0x4]
	int CurrentNumHeroLivesRemaining; // 0x106c [Size: 0x4]
	uint8_t pad_1070[0x6c]; // 0x1070
	int CachedNumCapturedStones; // 0x10dc [Size: 0x4]
	uint8_t pad_10e0[0x7a0]; // 0x10e0
	TArray<FortPlayerStateAthena*> HeroesWithOneLifeLeft; // 0x1880 [Size: 0x10]
	TArray<AController*> RespawningVillainPlayers; // 0x1890 [Size: 0x10]
};


struct FortAthenaMutator_AutoPickup
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	enum EFortCreativeAutoPickupSetting AutoPickupDefaultItems; // 0x2e0 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupAmmoItems; // 0x2e1 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupConsumableItems; // 0x2e2 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupGadgetItems; // 0x2e3 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupTrapItems; // 0x2e4 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupWeaponItems; // 0x2e5 [Size: 0x1]
	enum EFortCreativeAutoPickupSetting AutoPickupWorldResourceItems; // 0x2e6 [Size: 0x1]
};


struct FortAthenaMutator_Bagel
{
public:
	uint8_t pad_0[0x13c9]; // 0x0
	bool bIsRespawningAllowed : 1; // 0x13c9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_13ca[0x1]; // 0x13ca
	uint8_t TotalObjectiveAreaCount; // 0x13cb [Size: 0x1]
	uint8_t pad_13cc[0x30]; // 0x13cc
	uint8_t TeamScoreMultiplier; // 0x13fc [Size: 0x1]
	uint8_t pad_13fd[0x3]; // 0x13fd
	FBagelPlayerDataArray PlayerDataArray; // 0x1400 [Size: 0x58]
	enum EBagelPhase CurrentPhase; // 0x1458 [Size: 0x1]
	uint8_t pad_1459[0x1f]; // 0x1459
	FortAIPawn* FinalBoss; // 0x1478 [Size: 0x8]
};


struct FortAthenaMutator_BallerRace
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	float ServerWorldTimeToStartRace; // 0x2f8 [Size: 0x4]
};


struct FortAthenaMutator_Barrier
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	bool bGameEndsWhenObjectiveIsDestroyed : 1; // 0x2f0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2f1[0x57]; // 0x2f1
	AthenaBigBaseWall* BigBaseWall; // 0x348 [Size: 0x8]
	FBarrierTeamState Team_0_State; // 0x350 [Size: 0x28]
	FBarrierTeamState Team_1_State; // 0x378 [Size: 0x28]
};


struct FortAthenaMutator_BasicLimitedLives
{
public:
	uint8_t pad_0[0x328]; // 0x0
	FLimitedLifeDataArray LiveData; // 0x328 [Size: 0x58]
};


struct FortAthenaMutator_BlockEmotes
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bGlobalEmoteBlock : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2e1[0x7]; // 0x2e1
	FGameplayTagContainer BlockEmotesWithTags; // 0x2e8 [Size: 0x20]
	FGameplayTagContainer OnlyAllowEmotesWithTags; // 0x308 [Size: 0x20]
	TArray<FPrimaryAssetId> SpecificEmotesToBlock; // 0x328 [Size: 0x10]
};


struct FortAthenaMutator_BossHealthInfo
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	enum ECreativeBossDisplayMode DisplayMode; // 0x2e0 [Size: 0x1]
};


struct FortAthenaMutator_Chrome
{
public:
	uint8_t pad_0[0x688]; // 0x0
	AthenaChromeTraversePoint* FinishTraversePoint; // 0x688 [Size: 0x8]
	uint8_t pad_690[0x28]; // 0x690
	bool bRaceStarted : 1; // 0x6b8 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Cobalt
{
public:
	uint8_t pad_0[0xb8b]; // 0x0
	bool bTeleportComplete : 1; // 0xb8b [Mask: 0x1] [Bit: 0]
	bool bRoundStartWidgetSequenceRunning : 1; // 0xb8c [Mask: 0x1] [Bit: 0]
	uint8_t pad_b8d[0xb]; // 0xb8d
	FCobaltCombatStormShieldArray CombatStormShieldArray; // 0xb98 [Size: 0x58]
	int8_t ActiveRound; // 0xbf0 [Size: 0x1]
	bool bIsCobaltFinished : 1; // 0xbf1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_bf2[0x1]; // 0xbf2
	int8_t FirstRound; // 0xbf3 [Size: 0x1]
	uint8_t pad_bf4[0x4]; // 0xbf4
	TArray<uint8_t> TeamWinners; // 0xbf8 [Size: 0x10]
	TArray<uint8_t> TeamLosers; // 0xc08 [Size: 0x10]
	uint8_t pad_c18[0x48]; // 0xc18
	bool bClientPlaylistTimerStarted : 1; // 0xc60 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c61[0x3f]; // 0xc61
	FCobaltWidgetRoundData WidgetRoundData; // 0xca0 [Size: 0x28]
	uint8_t pad_cc8[0x1]; // 0xcc8
	bool bIsFinishedDisplayingRoundEndUI : 1; // 0xcc9 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_CreativeAllowSpectateOtherTeams
{
public:
	uint8_t pad_0[0x2e8]; // 0x0
	enum ECreativeAllowSpectateOtherTeams AllowSpectateOtherTeams; // 0x2e8 [Size: 0x1]
};


struct FortAthenaMutator_CreativePartyRiftIslandSettings
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bAllowGuestPartyRiftsUserSetting : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Crucible
{
public:
	uint8_t pad_0[0x448]; // 0x0
	FCrucibleCourseData CourseData; // 0x448 [Size: 0x10]
	TArray<FCrucibleStatValue> ParticipantBestTimes; // 0x458 [Size: 0x10]
	enum EFortCrucibleControlType CurrentControlType; // 0x468 [Size: 0x1]
	uint8_t pad_469[0x7]; // 0x469
	FCrucibleCourseResults LatestCourseResults; // 0x470 [Size: 0x30]
	float LatestServerTime; // 0x4a0 [Size: 0x4]
};


struct FortAthenaMutator_CustomStormMovement
{
public:
	uint8_t pad_0[0x300]; // 0x0
	TArray<FSafeZoneRoute> SafeZoneRoutes; // 0x300 [Size: 0x10]
	uint8_t pad_310[0xc]; // 0x310
	int SafeZoneRouteIndex; // 0x31c [Size: 0x4]
};


struct FortAthenaMutator_DBNOSetting
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	TArray<FDBNOSettingsByActor> SettingsByActor; // 0x2e0 [Size: 0x10]
};


struct FortAthenaMutator_DadBro
{
public:
	uint8_t pad_0[0x428]; // 0x0
	FortAIPawn* DadBroPawn; // 0x428 [Size: 0x8]
	uint8_t pad_430[0x28]; // 0x430
	enum EDadBroState DadBroCodeState; // 0x458 [Size: 0x4]
	float ServerTimeDadBroStarted; // 0x45c [Size: 0x4]
	float TimeTakenToDefeatDadBro; // 0x460 [Size: 0x4]
};


struct FortAthenaMutator_Disco
{
public:
	uint8_t pad_0[0x4c0]; // 0x0
	int LastRespawnableSafeZoneIndex; // 0x4c0 [Size: 0x4]
};


struct FortAthenaMutator_DrawTaggedPlayerIndicators
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	TArray<FDrawTaggedPlayerIndicatorsData> DrawingDataArray; // 0x2e0 [Size: 0x10]
};


struct FortAthenaMutator_EditModeHUDElements
{
public:
	uint8_t pad_0[0x343]; // 0x0
	bool bPendingNotify : 1; // 0x343 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_FF2
{
public:
	uint8_t pad_0[0x418]; // 0x0
	TArray<AthenaBuildingFoundationObjective*> FoundationsToWatch; // 0x418 [Size: 0x10]
	uint8_t pad_428[0x58]; // 0x428
	int CurrentRound; // 0x480 [Size: 0x4]
	float CurrentHealth; // 0x484 [Size: 0x4]
	float MaxHealth; // 0x488 [Size: 0x4]
	float EndOfLastRoundServerTime; // 0x48c [Size: 0x4]
};


struct FortAthenaMutator_Fill
{
public:
	uint8_t pad_0[0x3c8]; // 0x0
	AthenaFillFloor* LavaFloor; // 0x3c8 [Size: 0x8]
};


struct FortAthenaMutator_GameStartCountdown
{
public:
	uint8_t pad_0[0x360]; // 0x0
	bool bCountdownTimerRunning : 1; // 0x360 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_HUDElementVisibility
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	FHUDElementVisibilityPriorityStacks PriorityStacksRepData; // 0x2e0 [Size: 0x10]
};


struct FortAthenaMutator_Heist
{
public:
	uint8_t pad_0[0x490]; // 0x0
	int NumUnspawnedExitCrafts; // 0x490 [Size: 0x4]
	int NumSpawnedExitCrafts; // 0x494 [Size: 0x4]
	int NumDepartedExitCrafts; // 0x498 [Size: 0x4]
};


struct FortAthenaMutator_Infiltration
{
public:
	uint8_t pad_0[0x488]; // 0x0
	FInfiltrationTeamInfo InfiltrationTeamInfos; // 0x488 [Size: 0x10]
	uint8_t pad_498[0x518]; // 0x498
	FInfiltrationModeState ModeState; // 0x9b0 [Size: 0x30]
	AInfiltrationCarryObjectSpawnPoint* CurrentSpawnPoint; // 0x9e0 [Size: 0x8]
	AInfiltrationCarryObjectCapturePoint* CurrentCapturePoint; // 0x9e8 [Size: 0x8]
	TArray<FInfiltrationPOIInfo> POIInfo; // 0x9f0 [Size: 0x10]
	uint8_t pad_a00[0xc8]; // 0xa00
	FortAthenaMutator_RoundHelper* CachedRoundHelper; // 0xac8 [Size: 0x8]
	uint8_t pad_ad0[0x18]; // 0xad0
	FVector IntelLocation; // 0xae8 [Size: 0x18]
};


struct FortAthenaMutator_InfiltrationRoundPlacard
{
public:
	uint8_t pad_0[0x348]; // 0x0
	Object* RoundInfoInterfaceRedirectReplicationObject; // 0x348 [Size: 0x8]
};


struct FortAthenaMutator_InfiniteResources
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bInfiniteResources : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_IsPlayerTriggeredRespawnAllowed
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bIsPlayerTriggeredRespawnAllowed : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_IsWorldResourceWidgetVisible
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bWoodResourceWidgetVisible : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
	bool bStoneResourceWidgetVisible : 1; // 0x2e1 [Mask: 0x1] [Bit: 0]
	bool bMetalResourceWidgetVisible : 1; // 0x2e2 [Mask: 0x1] [Bit: 0]
	bool bGoldCurrencyResourceWidgetVisible : 1; // 0x2e3 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_LoadoutSwap
{
public:
	uint8_t pad_0[0x368]; // 0x0
	float ServerWorldTimeOfNextSwap; // 0x368 [Size: 0x4]
	uint8_t pad_36c[0x4]; // 0x36c
	TArray<FPlayerLoudoutEntry> NextItemsToGrant; // 0x370 [Size: 0x10]
	uint8_t pad_380[0x20]; // 0x380
	TArray<FortWorldItemDefinition*> ItemsWithInfiniteAmmo; // 0x3a0 [Size: 0x10]
};


struct FortAthenaMutator_LootChoice
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	enum ECustomLootSelection LootSelection; // 0x2e0 [Size: 0x1]
	uint8_t pad_2e1[0x17]; // 0x2e1
	bool bUsingExperimentalTables : 1; // 0x2f8 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_MarkerUtilities
{
public:
	uint8_t pad_0[0x6a8]; // 0x0
	TArray<FMarkerUtilitiesTeamPlacement> ReplicatedTeamPlacements; // 0x6a8 [Size: 0x10]
};


struct FortAthenaMutator_Mash
{
public:
	uint8_t pad_0[0x458]; // 0x0
	FortPawn* BossPawn; // 0x458 [Size: 0x8]
	bool bFinalBossEncounterSpawned : 1; // 0x460 [Mask: 0x1] [Bit: 0]
	uint8_t pad_461[0x3]; // 0x461
	FMashBossHealthShieldData BossHealthShieldData; // 0x464 [Size: 0x10]
	uint8_t pad_474[0x2511]; // 0x474
	bool bIsRespawningAllowed : 1; // 0x2985 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2986[0x1]; // 0x2986
	uint8_t TotalObjectiveAreaCount; // 0x2987 [Size: 0x1]
	uint8_t pad_2988[0x2c]; // 0x2988
	uint8_t TeamScoreMultiplier; // 0x29b4 [Size: 0x1]
	uint8_t pad_29b5[0x3]; // 0x29b5
	FMashPlayerDataArray PlayerDataArray; // 0x29b8 [Size: 0x58]
	bool bScoresAreFinal : 1; // 0x2a10 [Mask: 0x1] [Bit: 0]
	enum EMashPhase CurrentPhase; // 0x2a11 [Size: 0x1]
	uint8_t pad_2a12[0xbe]; // 0x2a12
	int DifficultyLevel; // 0x2ad0 [Size: 0x4]
};


struct FortAthenaMutator_MatchCondition
{
public:
	uint8_t pad_0[0x320]; // 0x0
	FortAthenaMutator_MatchConditionManager* MatchConditionManager; // 0x320 [Size: 0x8]
	bool bSatisfied : 1; // 0x328 [Mask: 0x1] [Bit: 0]
	bool bLocked : 1; // 0x328 [Mask: 0x2] [Bit: 1]
	bool bLockedPermanently : 1; // 0x328 [Mask: 0x4] [Bit: 2]
	uint8_t pad_329[0x7]; // 0x329
	TArray<FMatchConditionMutatorTeamData> TeamDataArray; // 0x330 [Size: 0x10]
};


struct FortAthenaMutator_MatchConditionManager
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	TArray<uint8_t> TeamNums; // 0x2f8 [Size: 0x10]
	TArray<FortAthenaMutator_MatchCondition*> MatchConditionMutators; // 0x308 [Size: 0x10]
};


struct FortAthenaMutator_MaxItemSlots
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	float MaxItemSlots; // 0x2e0 [Size: 0x4]
};


struct FortAthenaMutator_MaxWorldResource
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	int MaxWorldResources; // 0x2e0 [Size: 0x4]
};


struct FortAthenaMutator_NamePlate
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	enum EIndicatorDisplayMode DisplayMode; // 0x2e0 [Size: 0x1]
};


struct FortAthenaMutator_NewHUD
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bUseLatestHUD : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Payback
{
public:
	uint8_t pad_0[0x3a0]; // 0x0
	TArray<FPaybackMutatorEffectData> PaybackEffectDataArray; // 0x3a0 [Size: 0x10]
};


struct FortAthenaMutator_PlayerHealthIndicator
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	enum EPlayerIndicatorDisplayMode DisplayMode; // 0x2e0 [Size: 0x1]
};


struct FortAthenaMutator_PlayerMarker
{
public:
	uint8_t pad_0[0x310]; // 0x0
	TArray<FPlayerMarkerMutatorEffectData> PlayerMarkerEffectDataArray; // 0x310 [Size: 0x10]
};


struct FortAthenaMutator_Pow
{
public:
	uint8_t pad_0[0x5e8]; // 0x0
	FPowPlayerDataArray PlayerData; // 0x5e8 [Size: 0x60]
	uint8_t pad_648[0x2c]; // 0x648
	bool bRespawningCurrentlyAllowed : 1; // 0x674 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_RespawnAndSpectateSelect
{
public:
	uint8_t pad_0[0x568]; // 0x0
	TArray<FRespawnAndSpectateTargetData> RespawnTargetDataArray; // 0x568 [Size: 0x10]
	bool bAreAllRespawnTargetsAvailableToAllPlayersCheat : 1; // 0x578 [Mask: 0x1] [Bit: 0]
	uint8_t pad_579[0x2f]; // 0x579
	Object* ManagerObject; // 0x5a8 [Size: 0x8]
};


struct FortAthenaMutator_RespawnWave
{
public:
	uint8_t pad_0[0x368]; // 0x0
	TArray<FortAthenaMutator_RespawnWaveTeamData> WaveDataArray; // 0x368 [Size: 0x10]
};


struct FortAthenaMutator_Rounds
{
public:
	uint8_t pad_0[0x3f9]; // 0x0
	enum EAthenaRoundsMutatorPhase RoundPhase; // 0x3f9 [Size: 0x1]
	uint8_t pad_3fa[0x2]; // 0x3fa
	int CurrentRoundNum; // 0x3fc [Size: 0x4]
};


struct FortAthenaMutator_SafeZoneOrderOptimize
{
public:
	uint8_t pad_0[0x358]; // 0x0
	bool bInitialized : 1; // 0x358 [Mask: 0x1] [Bit: 0]
	bool bPaused : 1; // 0x359 [Mask: 0x1] [Bit: 0]
	uint8_t pad_35a[0x6]; // 0x35a
	TArray<FSafeZoneOrderOptimizeMutatorRouteDefinition> Routes; // 0x360 [Size: 0x10]
	int MaxRoutesPerOrder; // 0x370 [Size: 0x4]
	uint8_t pad_374[0x14]; // 0x374
	TArray<int> LockedInRouteIDs; // 0x388 [Size: 0x10]
	uint8_t pad_398[0x10]; // 0x398
	FSafeZoneOrderOptimizeMutatorRouteOrder ChosenRouteOrder; // 0x3a8 [Size: 0x18]
	uint8_t pad_3c0[0x8]; // 0x3c0
	FSafeZoneOrderOptimizeMutatorRouteOrder DebugShortestRouteOrder; // 0x3c8 [Size: 0x18]
};


struct FortAthenaMutator_ShouldDestroyActorsOnPlacement
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	bool bShouldDestroyOnPlacement : 1; // 0x2e0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_ShowPlacard
{
public:
	uint8_t pad_0[0x300]; // 0x0
	enum EShowPlacardPhase ShowPlacardPhase; // 0x300 [Size: 0x1]
};


struct FortAthenaMutator_SpecialRelevancy
{
public:
	uint8_t pad_0[0x330]; // 0x0
	FSpecialRelevancyModeData CurrentRelevancyModeData; // 0x330 [Size: 0x8]
	uint8_t pad_338[0x10]; // 0x338
	FReplicatedPlayerRelevancyArray ReplicatedPlayerRelevancyArray; // 0x348 [Size: 0x60]
};


struct FortAthenaMutator_SpyRumble
{
public:
	uint8_t pad_0[0x7c4]; // 0x0
	int NumKillsForNextPerkUnlock; // 0x7c4 [Size: 0x4]
};


struct FortAthenaMutator_SynchronizedTeleport
{
public:
	uint8_t pad_0[0x470]; // 0x0
	TArray<int> InProgressTeleportPlayerIDs; // 0x470 [Size: 0x10]
	uint8_t pad_480[0x20]; // 0x480
	bool bTeleportComplete : 1; // 0x4a0 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Tag
{
public:
	uint8_t pad_0[0x530]; // 0x0
	float ServerEndTime; // 0x530 [Size: 0x4]
	uint8_t pad_534[0x4]; // 0x534
	FTagTeamInfoArray TagTeamInfo; // 0x538 [Size: 0x58]
};


struct FortAthenaMutator_TeamPerformanceMessage
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	FTeamPerformanceMessageReplication MessageTriggerReplicated; // 0x2f0 [Size: 0x8]
};


struct FortAthenaMutator_TimedRespawnHelper
{
public:
	uint8_t pad_0[0x4b0]; // 0x0
	float ServerTimeRespawnIsDisallowed; // 0x4b0 [Size: 0x4]
};


struct FortAthenaMutator_Traverse
{
public:
	uint8_t pad_0[0x400]; // 0x0
	TArray<AthenaTraversePoint*> TraversePoints; // 0x400 [Size: 0x10]
	int CurrentPointIndex; // 0x410 [Size: 0x4]
};


struct FortAthenaMutator_Uranium
{
public:
	uint8_t pad_0[0x540]; // 0x0
	FortPlayerPushableCart* PushCart; // 0x540 [Size: 0x8]
	uint8_t pad_548[0x28]; // 0x548
	FortMissionStormShield* StormShield; // 0x570 [Size: 0x8]
	uint8_t pad_578[0x1f0]; // 0x578
	FVector RespawnLocation_PusherTeam; // 0x768 [Size: 0x18]
	FVector RespawnLocation_DefenderTeam; // 0x780 [Size: 0x18]
	UraniumPOIData CurrentPOI; // 0x798 [Size: 0x14]
	uint8_t pad_7ac[0x11c]; // 0x7ac
	UraniumRoundData RoundData; // 0x8c8 [Size: 0x18]
	uint8_t pad_8e0[0x78]; // 0x8e0
	enum EUraniumRoundPhase CurrentRoundPhase; // 0x958 [Size: 0x1]
	uint8_t pad_959[0x17]; // 0x959
	bool bRoundTimerStarted : 1; // 0x970 [Mask: 0x1] [Bit: 0]
	uint8_t pad_971[0xb3]; // 0x971
	float PushersAbandonedCartStartTime; // 0xa24 [Size: 0x4]
	uint8_t pad_a28[0x8]; // 0xa28
	float PushersAbandonedCartDuration; // 0xa30 [Size: 0x4]
	uint8_t pad_a34[0x1c]; // 0xa34
	bool bInOvertime : 1; // 0xa50 [Mask: 0x1] [Bit: 0]
	uint8_t pad_a51[0x118]; // 0xa51
	bool bIsSafeToTurnOnCameraAfterRespawn : 1; // 0xb69 [Mask: 0x1] [Bit: 0]
	uint8_t pad_b6a[0x106]; // 0xb6a
	uint8_t CheckpointTeleportPlayersReleased; // 0xc70 [Size: 0x1]
	uint8_t CheckpointTeleportComplete; // 0xc71 [Size: 0x1]
};


struct FortAthenaMutator_Valkyrie
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	FVector DefaultSpawnRangeStart; // 0x2e0 [Size: 0x18]
	FVector DefaultSpawnRangeEnd; // 0x2f8 [Size: 0x18]
};


struct FortAthenaMutator_WarmupMovie
{
public:
	uint8_t pad_0[0x2f4]; // 0x0
	bool bServerMovieStart : 1; // 0x2f4 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaMutator_Wax
{
public:
	uint8_t pad_0[0x400]; // 0x0
	TArray<FortPlayerStateAthena*> TeamLeadersInOrder; // 0x400 [Size: 0x10]
	uint8_t pad_410[0xa40]; // 0x410
	FWaxPlayerDataArray PlayerData; // 0xe50 [Size: 0x60]
};


struct FortAthenaMutator_WeaponSettings
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	TArray<FortWeaponSettingsComponent*> WeaponSettings; // 0x2e0 [Size: 0x10]
};


struct FortAthenaPartyRiftPortal
{
public:
	uint8_t pad_0[0x9b0]; // 0x0
	bool bInErrorState : 1; // 0x9b0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9b1[0x7]; // 0x9b1
	UniqueNetIdRepl OwningPlayerNetId; // 0x9b8 [Size: 0x30]
	uint8_t pad_9e8[0x8]; // 0x9e8
	bool bIsPublishedPortal : 1; // 0x9f0 [Mask: 0x1] [Bit: 0]
	bool bPortalOpen : 1; // 0x9f1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9f2[0x1e]; // 0x9f2
	FString PartyJoinInfoJSON; // 0xa10 [Size: 0x10]
	int MaxPartySize; // 0xa20 [Size: 0x4]
	uint8_t pad_a24[0x4]; // 0xa24
	TArray<UniqueNetIdRepl> PartyMemberNetIdList; // 0xa28 [Size: 0x10]
	int InitialDeploymentTime; // 0xa38 [Size: 0x4]
};


struct FortAthenaSKPushCannon
{
public:
	uint8_t pad_0[0x2158]; // 0x0
	bool bPlayerTorquingRepped : 1; // 0x2158 [Mask: 0x1] [Bit: 0]
};


struct FortAthenaSupplyDrop
{
public:
	uint8_t pad_0[0xa48]; // 0x0
	FName SpecialActorID; // 0xa48 [Size: 0x4]
	uint8_t pad_a4c[0x5c]; // 0xa4c
	int NumPlayersInteracting; // 0xaa8 [Size: 0x4]
};


struct FortAthenaTutorialBase
{
public:
	uint8_t pad_0[0x298]; // 0x0
	bool bExecuting : 1; // 0x298 [Mask: 0x1] [Bit: 0]
	uint8_t pad_299[0x3]; // 0x299
	int CurrentStepIndex; // 0x29c [Size: 0x4]
	Actor* CurrentTrackedActor; // 0x2a0 [Size: 0x8]
};


struct FortAthenaTutorialManager
{
public:
	uint8_t pad_0[0x3c0]; // 0x0
	int CurrentTutorialIndex; // 0x3c0 [Size: 0x4]
};


struct FortAthenaVehicle
{
public:
	uint8_t pad_0[0x5b8]; // 0x0
	FPredictionReplicationProxy_AP NetPredictionProxy_AP; // 0x5b8 [Size: 0x18]
	FPredictionReplicationProxy_SP NetPredictionProxy_SP; // 0x5d0 [Size: 0x18]
	uint8_t pad_5e8[0x20]; // 0x5e8
	FString CustomOwnerName; // 0x608 [Size: 0x10]
	FText DefaultOwnerName; // 0x618 [Size: 0x10]
	UniqueNetIdRepl CustomOwnerAccountId; // 0x628 [Size: 0x30]
	FText CustomName; // 0x658 [Size: 0x10]
	AthenaItemWrapDefinition* SoftOverrideItemWrap; // 0x668 [Size: 0x20]
	uint8_t pad_688[0x1b4]; // 0x688
	uint8_t SquadId; // 0x83c [Size: 0x1]
	uint8_t TeamId; // 0x83d [Size: 0x1]
	uint8_t pad_83e[0x1b]; // 0x83e
	bool bShowDamageNumbersToTeam : 1; // 0x859 [Mask: 0x4] [Bit: 2]
	bool bPlayInstantDeathEffects : 1; // 0x85a [Mask: 0x20] [Bit: 5]
	bool bHasDriver : 1; // 0x85a [Mask: 0x40] [Bit: 6]
	bool bHasPassengers : 1; // 0x85a [Mask: 0x80] [Bit: 7]
	uint8_t pad_85b[0x5]; // 0x85b
	bool bServerIsInUndergroundVolume : 1; // 0x860 [Mask: 0x40] [Bit: 6]
	bool bEnforceTeamRestrictionForMiniGame : 1; // 0x861 [Mask: 0x2] [Bit: 1]
	bool bEnforceMinigameClassRestriction : 1; // 0x861 [Mask: 0x4] [Bit: 2]
	bool bEnforceTeamRestriction : 1; // 0x862 [Mask: 0x2] [Bit: 1]
	bool bMoveStickAcceleratesVehicles : 1; // 0x862 [Mask: 0x4] [Bit: 2]
	uint8_t pad_863[0x1d]; // 0x863
	int MinigameClassID; // 0x880 [Size: 0x4]
	uint8_t pad_884[0xf4]; // 0x884
	FGameplayTagContainer AppliedVehicleModTags; // 0x978 [Size: 0x20]
	uint8_t pad_998[0xe8]; // 0x998
	FortAthenaVehicleInputState EmptyDriverInputState; // 0xa80 [Size: 0x40]
	uint8_t pad_ac0[0x143]; // 0xac0
	enum EPhysicalSurface SurfaceTypeVehicleOn; // 0xc03 [Size: 0x1]
	uint8_t pad_c04[0x514]; // 0xc04
	FVehicleRuntimeModifiers RuntimeModifiedProperties; // 0x1118 [Size: 0x18]
	uint8_t pad_1130[0x1a8]; // 0x1130
	FReplicatedAthenaVehicleAttributes VehicleAttributes; // 0x12d8 [Size: 0x20]
	uint8_t pad_12f8[0x20]; // 0x12f8
	TArray<ABuildingActor*> IgnoredBuildingActors; // 0x1318 [Size: 0x10]
	uint8_t pad_1328[0x28]; // 0x1328
	TArray<FVehicleDamageablePart> DamageableParts; // 0x1350 [Size: 0x10]
	TArray<FVehicleToggleablePart> ToggledParts; // 0x1360 [Size: 0x10]
	uint8_t pad_1370[0x268]; // 0x1370
	FVehicleTargetOrientation CorrectTargetOrientation; // 0x15d8 [Size: 0x48]
	uint8_t pad_1620[0x128]; // 0x1620
	FortAbilitySystemComponent* AbilitySystemComponent; // 0x1748 [Size: 0x8]
	FortHealthSet* HealthSet; // 0x1750 [Size: 0x8]
	uint8_t pad_1758[0x68]; // 0x1758
	bool bShouldSleepAtSpawn : 1; // 0x17c0 [Mask: 0x1] [Bit: 0]
	bool bSpawnedSleepLockActive : 1; // 0x17c1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_17c2[0x2]; // 0x17c2
	uint32_t ForceKinematicOnClientCount; // 0x17c4 [Size: 0x4]
	uint8_t pad_17c8[0x320]; // 0x17c8
	FortPhysicsVehicleConfigs* VehicleConfigsClass; // 0x1ae8 [Size: 0x8]
	uint8_t pad_1af0[0x11c]; // 0x1af0
	bool bExploded : 1; // 0x1c0c [Mask: 0x1] [Bit: 0]
	bool bPendingDeath : 1; // 0x1c0c [Mask: 0x2] [Bit: 1]
	bool bOnFire : 1; // 0x1c0c [Mask: 0x4] [Bit: 2]
	uint8_t pad_1c0d[0x83]; // 0x1c0d
	TArray<enum ETireStates> TireStates; // 0x1c90 [Size: 0x10]
	uint8_t pad_1ca0[0xe8]; // 0x1ca0
	FGameplayTagContainer ActiveGameplayEffectGrantedTagsToForceRemove; // 0x1d88 [Size: 0x20]
	uint8_t pad_1da8[0xb9]; // 0x1da8
	bool bIsRefuelingCosmeticsActive : 1; // 0x1e61 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1e62[0xbe]; // 0x1e62
	TArray<FName> OwningSpawnerResolverScopes; // 0x1f20 [Size: 0x10]
};


struct FortAthenaZipline
{
public:
	uint8_t pad_0[0xb68]; // 0x0
	FVector StartPosition; // 0xb68 [Size: 0x18]
	FVector EndPosition; // 0xb80 [Size: 0x18]
	bool bInitialized : 1; // 0xb98 [Mask: 0x1] [Bit: 0]
};


struct FortAttachableProjectileDeprecated
{
public:
	uint8_t pad_0[0xab0]; // 0x0
	AttachedInfo AttachedInfo; // 0xab0 [Size: 0x140]
};


struct FortAutomationRpcTrackedActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	Actor* TrackedActor; // 0x270 [Size: 0x8]
	FString ActorName; // 0x278 [Size: 0x10]
};


struct FortBroadcastRemoteClientInfo
{
public:
	uint8_t pad_0[0x280]; // 0x0
	bool bActive : 1; // 0x280 [Mask: 0x1] [Bit: 0]
	bool bRemoteIsInteracting : 1; // 0x281 [Mask: 0x1] [Bit: 0]
	uint8_t pad_282[0x2]; // 0x282
	ABuildingSMActor* RemoteEditActor; // 0x284 [Size: 0x8]
	uint8_t pad_28c[0x4]; // 0x28c
	TArray<int> RemoteEditTileData; // 0x290 [Size: 0x10]
	ABuildingSMActor* RemoteBuildableClass; // 0x2a0 [Size: 0x8]
	enum EFortResourceType RemoteBuildingMaterial; // 0x2a8 [Size: 0x1]
	uint8_t pad_2a9[0x3]; // 0x2a9
	int RemoteBuildingClockwiseRotationCounter; // 0x2ac [Size: 0x4]
	bool bRemoteIsFullScreenMapActive : 1; // 0x2b0 [Mask: 0x1] [Bit: 0]
	bool bRemoteIsInventoryActive : 1; // 0x2b1 [Mask: 0x1] [Bit: 0]
	bool bRemoteCanDBNORevive : 1; // 0x2b2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2b3[0x5]; // 0x2b3
	AthenaQuickChatActiveEntry RemoteChatEntry; // 0x2b8 [Size: 0x28]
	FBuildingWeakSpotData RemoteWeakspotData; // 0x2e0 [Size: 0x50]
	float RemoteRespawnTime; // 0x330 [Size: 0x4]
	int16_t RemotePoiTagID; // 0x334 [Size: 0x2]
	uint8_t pad_336[0x2]; // 0x336
	int RemoteEventScore; // 0x338 [Size: 0x4]
	uint8_t pad_33c[0x4]; // 0x33c
	FortWorldMarkerSpectatorContainer Markers; // 0x340 [Size: 0x60]
	TArray<FortPlayerAugmentItemDefinition*> RemoteAugments; // 0x3a0 [Size: 0x10]
};


struct FortBroadcastSpectatorInfo
{
public:
	uint8_t pad_0[0x270]; // 0x0
	int TotalNumPlayers; // 0x270 [Size: 0x4]
	int TotalNumTeams; // 0x274 [Size: 0x4]
	TArray<FortTeamPrivateInfo*> TeamPrivateInfos; // 0x278 [Size: 0x10]
	TArray<FortBroadcastInfoPerPlayer> PerPlayerInfo; // 0x288 [Size: 0x10]
};


struct FortCaptureSpectatorController
{
public:
	uint8_t pad_0[0x3830]; // 0x0
	Actor* VisualizedCamera; // 0x3830 [Size: 0x8]
};


struct FortCarriedObject
{
public:
	uint8_t pad_0[0x298]; // 0x0
	FCarriedObjectAttachmentInfo HolderInfo; // 0x298 [Size: 0x40]
	uint8_t pad_2d8[0x151]; // 0x2d8
	uint8_t Team; // 0x429 [Size: 0x1]
	uint8_t pad_42a[0x6]; // 0x42a
	ABuildingFlagSpawn* SpawnPointActor; // 0x430 [Size: 0x8]
};


struct FortCharacterVehicle
{
public:
	uint8_t pad_0[0x5bb8]; // 0x0
	AthenaItemWrapDefinition* SoftOverrideItemWrap; // 0x5bb8 [Size: 0x20]
	uint8_t pad_5bd8[0x88]; // 0x5bd8
	FortAbilitySystemComponent* OverrideAbilitySystemComponent; // 0x5c60 [Size: 0x8]
};


struct FortCharacterVehicle_Ostrich
{
public:
	uint8_t pad_0[0x6008]; // 0x0
	Actor* ShieldActor; // 0x6008 [Size: 0x8]
	uint8_t pad_6010[0x104]; // 0x6010
	bool bDriverStompImmersionBlocked : 1; // 0x6114 [Mask: 0x1] [Bit: 0]
	bool bDriverDashImmersionBlocked : 1; // 0x6115 [Mask: 0x1] [Bit: 0]
	bool bDriverJumpImmersionBlocked : 1; // 0x6116 [Mask: 0x1] [Bit: 0]
	bool bGunnerMissilesImmersionBlocked : 1; // 0x6117 [Mask: 0x1] [Bit: 0]
	bool bGunnerShotgunImmersionBlocked : 1; // 0x6118 [Mask: 0x1] [Bit: 0]
	bool bChargingJump : 1; // 0x6119 [Mask: 0x1] [Bit: 0]
	uint8_t pad_611a[0x1]; // 0x611a
	bool bChargingRockets : 1; // 0x611b [Mask: 0x1] [Bit: 0]
	bool bAutomaticallyFiringShotgun : 1; // 0x611c [Mask: 0x1] [Bit: 0]
	enum EOstrichDetonationState DetonationState; // 0x611d [Size: 0x1]
	uint8_t pad_611e[0x1]; // 0x611e
	bool bDashing : 1; // 0x611f [Mask: 0x1] [Bit: 0]
	bool bKickRep : 1; // 0x6120 [Mask: 0x1] [Bit: 0]
	uint8_t pad_6121[0x23f]; // 0x6121
	FOstrichWeapon_RetainedData CachedWeaponState; // 0x6360 [Size: 0xc]
};


struct FortCheckPointCosmeticActor
{
public:
	uint8_t pad_0[0xb38]; // 0x0
	int CheckpointIndex; // 0xb38 [Size: 0x4]
	bool bIsEndPoint : 1; // 0xb3c [Mask: 0x1] [Bit: 0]
};


struct FortClientAnnouncement
{
public:
	uint8_t pad_0[0x278]; // 0x0
	FGuid AnnouncementID; // 0x278 [Size: 0x10]
	uint8_t pad_288[0x10]; // 0x288
	int Priority; // 0x298 [Size: 0x4]
	bool bInterrupt : 1; // 0x29c [Mask: 0x1] [Bit: 0]
	uint8_t pad_29d[0x2b]; // 0x29d
	TArray<FortPlayerController*> RecipientControllers; // 0x2c8 [Size: 0x10]
};


struct FortClientAnnouncementManager
{
public:
	uint8_t pad_0[0x298]; // 0x0
	TArray<FortClientAnnouncement*> ClientAnnouncements; // 0x298 [Size: 0x10]
	uint8_t pad_2a8[0x10]; // 0x2a8
	TArray<FGuid> CancelledAnnouncements; // 0x2b8 [Size: 0x10]
};


struct FortClientAnnouncement_Basic
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	FortClientAnnouncementData_Basic BasicData; // 0x2e0 [Size: 0x100]
};


struct FortClientAnnouncement_Conversation
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	FortClientAnnouncementData_Conversation ConversationData; // 0x2f0 [Size: 0x10]
};


struct FortClientAnnouncement_Keybinding
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	FortClientAnnouncementData_Keybinding KeybindingData; // 0x2e0 [Size: 0x110]
};


struct FortClientAnnouncement_Tutorial
{
public:
	uint8_t pad_0[0x2f0]; // 0x0
	FortClientAnnouncementData_Tutorial TutorialData; // 0x2f0 [Size: 0x140]
};


struct FortClientAnnouncement_TutorialConversation
{
public:
	uint8_t pad_0[0x370]; // 0x0
	FortClientAnnouncementData_Tutorial TutorialData; // 0x370 [Size: 0x140]
};


struct FortClientAnnouncement_ZoneModifiers
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	float DisplayTime; // 0x2e0 [Size: 0x4]
	uint8_t pad_2e4[0x4]; // 0x2e4
	FortClientAnnouncementData_ZoneModifiers ModifiersData; // 0x2e8 [Size: 0x10]
};


struct FortCreativeMoveTool
{
public:
	uint8_t pad_0[0x19d8]; // 0x0
	AObjectInteractionMode* InteractionModeReplicateToRemoteClients; // 0x19d8 [Size: 0x8]
	uint8_t pad_19e0[0x8]; // 0x19e0
	bool bIsPreviewingMove : 1; // 0x19e8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_19e9[0x1f]; // 0x19e9
	UPlaysetPreview* PlaysetPreviewInteractionBehavior; // 0x1a08 [Size: 0x8]
	uint8_t pad_1a10[0x1b8]; // 0x1a10
	TArray<ACreativeMoveToolBlueprintPreview*> PreviewActors; // 0x1bc8 [Size: 0x10]
	TArray<ACreativeMoveToolBlueprintPreview*> ActivePreviewActors; // 0x1bd8 [Size: 0x10]
	TArray<ACreativeMoveToolBlueprintPreview*> PossessedPreviewActors; // 0x1be8 [Size: 0x10]
	enum ECreativeMoveToolVisualState ActivePhoneVisualState; // 0x1bf8 [Size: 0x1]
	uint8_t pad_1bf9[0x5f]; // 0x1bf9
	TArray<FValidPlacementPair> PlacementObjectValidities; // 0x1c58 [Size: 0x10]
	uint8_t pad_1c68[0x1ab]; // 0x1c68
	FSelectionPropertySettings SelectionPropertySetting; // 0x1e13 [Size: 0x2]
	uint8_t pad_1e15[0x83]; // 0x1e15
	FVector ScaleModifier; // 0x1e98 [Size: 0x18]
	uint8_t pad_1eb0[0x19]; // 0x1eb0
	bool bAllowGravityOnPlace : 1; // 0x1ec9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1eca[0x28]; // 0x1eca
	bool bClientNeedsToProcessNewlyPlacedActors : 1; // 0x1ef2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1ef3[0x75]; // 0x1ef3
	bool bAlwaysMoveFreely : 1; // 0x1f68 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1f69[0x7]; // 0x1f69
	bool bBuildingsAsPropsSnapToCenter : 1; // 0x1f70 [Mask: 0x1] [Bit: 0]
};


struct FortCreativeRealEstatePlotManager
{
public:
	uint8_t pad_0[0x270]; // 0x0
	TArray<ActiveRealEstatePlotInfo> ActiveCreativeRealEstatePlots; // 0x270 [Size: 0x10]
};


struct FortCreativeSplineControlPoint
{
public:
	uint8_t pad_0[0xb28]; // 0x0
	int SplineIndex; // 0xb28 [Size: 0x4]
	bool bInitializedFromOwningSplineProp : 1; // 0xb2c [Mask: 0x1] [Bit: 0]
	uint8_t pad_b2d[0x3]; // 0xb2d
	ABuildingActor* OwningSplineProp; // 0xb30 [Size: 0x8]
	FortCreativeSplineControlPoint* CopiedFrom; // 0xb38 [Size: 0x8]
	FortCreativeSplineControlPoint* CopiedFromCut; // 0xb40 [Size: 0x8]
};


struct FortCreativeStormShield
{
public:
	uint8_t pad_0[0x551]; // 0x0
	enum EAthenaGamePhaseStep GamePhaseStep; // 0x551 [Size: 0x1]
	uint8_t pad_552[0x2]; // 0x552
	float NextTargetRadius; // 0x554 [Size: 0x4]
	FVector NextTargetLocation; // 0x558 [Size: 0x18]
	float NextNextTargetRadius; // 0x570 [Size: 0x4]
	uint8_t pad_574[0x4]; // 0x574
	FVector NextNextTargetLocation; // 0x578 [Size: 0x18]
	float InstancedServerTime; // 0x590 [Size: 0x4]
};


struct FortCreativeStreamingController
{
public:
	uint8_t pad_0[0x2b0]; // 0x0
	FReplicatedStreamingProperties ReplicatedStreamingProperties; // 0x2b0 [Size: 0x50]
};


struct FortCurieGrassFireReplicator
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FortCuriePackedGrassDataArray PackedDataArray; // 0x280 [Size: 0x58]
	uint8_t pad_2d8[0x10]; // 0x2d8
	FortSpatialCellIndex MinGrassGridIndex; // 0x2e8 [Size: 0xc]
	FortSpatialCellIndex MaxGrassGridIndex; // 0x2f4 [Size: 0xc]
	FVector GrassGridOrigin; // 0x300 [Size: 0x18]
	FVector GrassGridCellSize; // 0x318 [Size: 0x18]
};


struct FortCustomCameraController
{
public:
	uint8_t pad_0[0x270]; // 0x0
	TArray<Actor*> POIFramingTrackedActors; // 0x270 [Size: 0x10]
	uint8_t pad_280[0x80]; // 0x280
	FortPlayerPawn* FortPawn; // 0x300 [Size: 0x8]
	uint8_t pad_308[0x10]; // 0x308
	bool bIsCustomCameraModeEnabled : 1; // 0x318 [Mask: 0x1] [Bit: 0]
	uint8_t pad_319[0x3]; // 0x319
	float FieldOfView; // 0x31c [Size: 0x4]
	float NearClipPlane; // 0x320 [Size: 0x4]
	bool bIsDeathCameraOverridden : 1; // 0x324 [Mask: 0x1] [Bit: 0]
	bool bIsDeathCameraRotationOverridden : 1; // 0x325 [Mask: 0x1] [Bit: 0]
	uint8_t pad_326[0x2]; // 0x326
	FVector DeathCameraLocationOffset; // 0x328 [Size: 0x18]
	bool bDeathCameraUsingLocation : 1; // 0x340 [Mask: 0x1] [Bit: 0]
	uint8_t pad_341[0x7]; // 0x341
	FRotator DeathCameraRotation; // 0x348 [Size: 0x18]
	FCustomCameraTransition TransitionInData; // 0x360 [Size: 0x18]
	FCustomCameraTransition TransitionOutData; // 0x378 [Size: 0x18]
	Actor* LookAtTarget; // 0x390 [Size: 0x8]
	bool bEnableLookAtTarget : 1; // 0x398 [Mask: 0x1] [Bit: 0]
};


struct FortDaySequenceActor
{
public:
	uint8_t pad_0[0x3c8]; // 0x0
	bool bPIEWithTimeFrozen : 1; // 0x3c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3c9[0xb7]; // 0x3c9
	float ReplayOverridenSkyRotationYaw; // 0x480 [Size: 0x4]
	uint8_t pad_484[0x34]; // 0x484
	bool bServerTODIsVisible : 1; // 0x4b8 [Mask: 0x1] [Bit: 0]
};


struct FortDecoTool
{
public:
	uint8_t pad_0[0x1900]; // 0x0
	UItemDefinitionBase* ItemDefinition; // 0x1900 [Size: 0x8]
	uint8_t pad_1908[0x8]; // 0x1908
	Actor* CarriedActor; // 0x1910 [Size: 0x8]
};


struct FortDecoTool_ContextTrap
{
public:
	uint8_t pad_0[0x1950]; // 0x0
	FortContextTrapItemDefinition* ContextTrapItemDefinition; // 0x1950 [Size: 0x8]
};


struct FortDeployableBaseManager
{
public:
	uint8_t pad_0[0x270]; // 0x0
	bool bRestrictedBuildingActive : 1; // 0x270 [Mask: 0x1] [Bit: 0]
	bool bBusyWithPlotActions : 1; // 0x270 [Mask: 0x2] [Bit: 1]
	uint8_t pad_271[0xc]; // 0x271
	enum EDeployableBaseUseType DeployableBaseUseType; // 0x27d [Size: 0x1]
	uint8_t pad_27e[0x2]; // 0x27e
	ActiveTieredCollectionLayoutArray ActiveTieredCollectionLayouts; // 0x280 [Size: 0x60]
	uint8_t pad_2e0[0x40]; // 0x2e0
	FDeployableBaseArray DeployableBaseArray; // 0x320 [Size: 0x58]
};


struct FortDeployableBasePickup
{
public:
	uint8_t pad_0[0x6e8]; // 0x0
	UniqueNetIdRepl AssociatedPlotOccupant; // 0x6e8 [Size: 0x30]
};


struct FortFeedbackManager
{
public:
	uint8_t pad_0[0x2a0]; // 0x0
	FortPawn_FeedbackAnnouncer* Announcer; // 0x2a0 [Size: 0x8]
	TArray<AController*> SuppressedControllers; // 0x2a8 [Size: 0x10]
};


struct FortGameModePickup_Wax
{
public:
	uint8_t pad_0[0x750]; // 0x0
	bool bIsFirstGeneration : 1; // 0x750 [Mask: 0x1] [Bit: 0]
	uint8_t pad_751[0x3]; // 0x751
	int AmountOfTokens; // 0x754 [Size: 0x4]
};


struct FortGameState
{
public:
	uint8_t pad_0[0x350]; // 0x0
	FString CurrentWUID; // 0x350 [Size: 0x10]
	int ParTime; // 0x360 [Size: 0x4]
	int WorldLevel; // 0x364 [Size: 0x4]
	int CraftingBonus; // 0x368 [Size: 0x4]
	float CurrentReadyToContinueTimer; // 0x36c [Size: 0x4]
	int TeamCount; // 0x370 [Size: 0x4]
	uint8_t pad_374[0x4]; // 0x374
	FOnlineLinkId MatchmakingLinkId; // 0x378 [Size: 0x18]
	FString MatchmakingLinkType; // 0x390 [Size: 0x10]
	AnalyticsSessionInfo AnalyticsSessionInfo; // 0x3a0 [Size: 0x20]
	FortPoiManager* POIManager; // 0x3c0 [Size: 0x8]
	uint8_t pad_3c8[0x14]; // 0x3c8
	bool bDBNOEnabledForGameMode : 1; // 0x3dc [Mask: 0x1] [Bit: 0]
	uint8_t pad_3dd[0x1b]; // 0x3dd
	bool bFishingCollectionEnabled : 1; // 0x3f8 [Mask: 0x1] [Bit: 0]
	bool bCharacterCollectionEnabled : 1; // 0x3f9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3fa[0x2]; // 0x3fa
	float MatchStartTime; // 0x3fc [Size: 0x4]
	double RealMatchStartTime; // 0x400 [Size: 0x8]
	bool bPlayerRespawningBlocked_Temporarily : 1; // 0x408 [Mask: 0x1] [Bit: 0]
	uint8_t pad_409[0x7]; // 0x409
	double ReplicatedWorldRealTimeSecondsDouble; // 0x410 [Size: 0x8]
	uint8_t pad_418[0x38]; // 0x418
	TArray<AdditionalLevelStreamed> AdditionalPlaylistLevelsStreamed; // 0x450 [Size: 0x10]
	uint8_t pad_460[0x50]; // 0x460
	int WorldDaysElapsed; // 0x4b0 [Size: 0x4]
	uint8_t pad_4b4[0x1c]; // 0x4b4
	FortFeedbackManager* FeedbackManager; // 0x4d0 [Size: 0x8]
	FortMissionManager* MissionManager; // 0x4d8 [Size: 0x8]
	FortClientAnnouncementManager* AnnouncementManager; // 0x4e0 [Size: 0x8]
	uint8_t pad_4e8[0x10]; // 0x4e8
	FortWorldManager* WorldManager; // 0x4f8 [Size: 0x8]
	enum EFortGameplayState GameplayState; // 0x500 [Size: 0x1]
	uint8_t pad_501[0x7]; // 0x501
	FortMusicManager* MusicManagerSubclass; // 0x508 [Size: 0x8]
	FortMusicManagerBank* MusicManagerBank; // 0x510 [Size: 0x8]
	uint8_t pad_518[0x10]; // 0x518
	FString GameSessionId; // 0x528 [Size: 0x10]
	uint8_t pad_538[0x20]; // 0x538
	FortPawn* PawnForReplayRelevancy; // 0x558 [Size: 0x8]
	FortPlayerState* RecorderPlayerState; // 0x560 [Size: 0x8]
	uint8_t pad_568[0x78]; // 0x568
	TArray<FortTeamInfo*> Teams; // 0x5e0 [Size: 0x10]
	uint8_t pad_5f0[0x188]; // 0x5f0
	TArray<FBuildingContainerDebugInfo> TreasureChestInfos; // 0x778 [Size: 0x10]
	TArray<FBuildingContainerDebugInfo> AmmoBoxInfos; // 0x788 [Size: 0x10]
};


struct FortGameStateAthena
{
public:
	uint8_t pad_0[0x1068]; // 0x0
	bool bInSpawningStartup : 1; // 0x1068 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1069[0x7f]; // 0x1069
	bool bIsGrassFireBoundsUpdateEnabled : 1; // 0x10e8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_10e9[0xc7]; // 0x10e9
	bool bIsUsingDownloadOnDemand : 1; // 0x11b0 [Mask: 0x1] [Bit: 0]
	bool bWantsHoldoverPluginOnClient : 1; // 0x11b1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_11b2[0x327]; // 0x11b2
	bool bSkyTubesShuttingDown : 1; // 0x14d9 [Mask: 0x1] [Bit: 0]
	bool bSkyTubesDisabled : 1; // 0x14da [Mask: 0x1] [Bit: 0]
	uint8_t pad_14db[0x9]; // 0x14db
	int ServerChangelistNumber; // 0x14e4 [Size: 0x4]
	FString ServerType; // 0x14e8 [Size: 0x10]
	FortSpecialActorReplicationInfo* SpecialActorData; // 0x14f8 [Size: 0x8]
	FortPropertyOverrideReplShared* ReplOverrideData; // 0x1500 [Size: 0x8]
	uint8_t pad_1508[0xbc]; // 0x1508
	float EndGameStartTime; // 0x15c4 [Size: 0x4]
	float EndGameKickPlayerTime; // 0x15c8 [Size: 0x4]
	int TotalPlayers; // 0x15cc [Size: 0x4]
	int PlayersLeft; // 0x15d0 [Size: 0x4]
	int PlayersLoaded; // 0x15d4 [Size: 0x4]
	TArray<Object*> ClientVehicleClassesToLoad; // 0x15d8 [Size: 0x10]
	TArray<UItemDefinitionBase*> ClientItemDefsToLoad; // 0x15e8 [Size: 0x10]
	uint8_t pad_15f8[0x18]; // 0x15f8
	Actor* FocalPointActor; // 0x1610 [Size: 0x8]
	float FocalPointRotationInterpSpeed; // 0x1618 [Size: 0x4]
	uint8_t pad_161c[0x4]; // 0x161c
	FVector_NetQuantize FocalPointOffset; // 0x1620 [Size: 0x18]
	float FocalPointFOV; // 0x1638 [Size: 0x4]
	uint8_t pad_163c[0x50]; // 0x163c
	bool bCheatRespawnEnabled : 1; // 0x168c [Mask: 0x1] [Bit: 0]
	uint8_t pad_168d[0x3]; // 0x168d
	TArray<int> TeamXPlayersLeft; // 0x1690 [Size: 0x10]
	TArray<FortWinnerPlayerData> WinningPlayerList; // 0x16a0 [Size: 0x10]
	int TeamsLeft; // 0x16b0 [Size: 0x4]
	uint8_t pad_16b4[0x4]; // 0x16b4
	TArray<Object*> ServerToClientPreloadList; // 0x16b8 [Size: 0x10]
	AthenaBattleBusItemDefinition* DefaultBattleBus; // 0x16c8 [Size: 0x8]
	TArray<AircraftFlightInfo> TeamFlightPaths; // 0x16d0 [Size: 0x10]
	AircraftFlightInfo FlightPathMidLine; // 0x16e0 [Size: 0x48]
	uint8_t pad_1728[0x20]; // 0x1728
	FDateTime UtcTimeStartedMatch; // 0x1748 [Size: 0x8]
	bool bIsLargeTeamGame : 1; // 0x1750 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1751[0x7]; // 0x1751
	APlayerState* WinningPlayerState; // 0x1758 [Size: 0x8]
	uint8_t pad_1760[0x10]; // 0x1760
	int WinningTeam; // 0x1770 [Size: 0x4]
	int WinningScore; // 0x1774 [Size: 0x4]
	int CurrentHighScore; // 0x1778 [Size: 0x4]
	int CurrentHighScoreTeam; // 0x177c [Size: 0x4]
	USoundCue* SupplyDropWaveStartedSoundCue; // 0x1780 [Size: 0x8]
	uint8_t pad_1788[0x81]; // 0x1788
	bool bStormReachedFinalPosition : 1; // 0x1809 [Mask: 0x1] [Bit: 0]
	enum EFriendlyFireType FriendlyFireType; // 0x180a [Size: 0x1]
	uint8_t pad_180b[0x1d]; // 0x180b
	bool SpectateAPartyMemberAvailable : 1; // 0x1828 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1829[0x97]; // 0x1829
	FGameMemberInfoArray GameMemberInfoArray; // 0x18c0 [Size: 0x60]
	uint8_t pad_1920[0x90]; // 0x1920
	TArray<uint8_t> ActiveTeamNums; // 0x19b0 [Size: 0x10]
	int CurrentPlaylistId; // 0x19c0 [Size: 0x4]
	uint8_t pad_19c4[0x69c]; // 0x19c4
	bool bDrawSafeZone : 1; // 0x2060 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2061[0x27]; // 0x2061
	FortAthenaMapInfo* MapInfo; // 0x2088 [Size: 0x8]
	uint8_t pad_2090[0x8]; // 0x2090
	FortBroadcastSpectatorInfo* BroadcastSpectatorInfo; // 0x2098 [Size: 0x8]
	uint8_t pad_20a0[0x60]; // 0x20a0
	TArray<AICharacterPartsPreloadData> AICharacterPartsPreloadData; // 0x2100 [Size: 0x10]
	TArray<UProxyTable*> AIAnimationSpawnerDataProxyTables; // 0x2110 [Size: 0x10]
	TArray<AIPawnCustomizationPreloadData> AIPawnCustomizationPreloadData; // 0x2120 [Size: 0x10]
	uint8_t pad_2130[0x30]; // 0x2130
	FString ReasonWereInSetupPhase; // 0x2160 [Size: 0x10]
	FString CustomKeyMatchOwner; // 0x2170 [Size: 0x10]
	FString CustomMatchKey; // 0x2180 [Size: 0x10]
	enum EEventTournamentRound EventTournamentRound; // 0x2190 [Size: 0x1]
	bool bIsCustomMatch : 1; // 0x2191 [Mask: 0x1] [Bit: 0]
	bool bIsTournamentMatch : 1; // 0x2192 [Mask: 0x1] [Bit: 0]
	enum EFortInputFilterLevel TournamentInputFilter; // 0x2193 [Size: 0x1]
	uint8_t pad_2194[0x4]; // 0x2194
	FPlaylistPropertyArray CurrentPlaylistInfo; // 0x2198 [Size: 0xa8]
	uint8_t pad_2240[0x30]; // 0x2240
	int TotalPlayersBots; // 0x2270 [Size: 0x4]
	int PlayerBotsLeft; // 0x2274 [Size: 0x4]
	uint8_t pad_2278[0x10]; // 0x2278
	int LobbyAction; // 0x2288 [Size: 0x4]
	FGameplayMutatorEventData MutatorEventData; // 0x228c [Size: 0x10]
	uint8_t pad_229c[0x4]; // 0x229c
	FGameplayMutatorObjectDataArray MutatorObjectDataArray; // 0x22a0 [Size: 0x58]
	int MutatorGenericInt_0; // 0x22f8 [Size: 0x4]
	int MutatorGenericInt_1; // 0x22fc [Size: 0x4]
	int MutatorGenericInt_2; // 0x2300 [Size: 0x4]
	uint8_t pad_2304[0x14]; // 0x2304
	float DefaultGliderRedeployCanRedeploy; // 0x2318 [Size: 0x4]
	float DefaultRedeployGliderLateralVelocityMult; // 0x231c [Size: 0x4]
	float DefaultRedeployGliderHeightLimit; // 0x2320 [Size: 0x4]
	float DefaultParachuteDeployTraceForGroundDistance; // 0x2324 [Size: 0x4]
	float DefaultAllowNeutralWallEditing; // 0x2328 [Size: 0x4]
	float SignalInStormRegenSpeed; // 0x232c [Size: 0x4]
	float SignalInStormLostSpeed; // 0x2330 [Size: 0x4]
	float StormCNDamageVulnerabilityLevel0; // 0x2334 [Size: 0x4]
	float StormCNDamageVulnerabilityLevel1; // 0x2338 [Size: 0x4]
	float StormCNDamageVulnerabilityLevel2; // 0x233c [Size: 0x4]
	float StormCNDamageVulnerabilityLevel3; // 0x2340 [Size: 0x4]
	FMeshNetworkStatus MeshNetworkStatus; // 0x2344 [Size: 0x3]
	uint8_t pad_2347[0x41]; // 0x2347
	FortVolumeManager* VolumeManager; // 0x2388 [Size: 0x8]
	FortPartyRiftPortalManager* PartyRiftPortalManager; // 0x2390 [Size: 0x8]
	FortLocalizationService* LocalizationService; // 0x2398 [Size: 0x8]
	uint8_t pad_23a0[0x8a8]; // 0x23a0
	FGameplayTagContainer GoldenPoiLocationTags; // 0x2c48 [Size: 0x20]
	uint8_t pad_2c68[0xa8]; // 0x2c68
	FGameplayTagContainer RolledLootGroupTags; // 0x2d10 [Size: 0x20]
	bool bEnvironmentDamageBlocked : 1; // 0x2d30 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2d31[0x7]; // 0x2d31
	TArray<FString> ReticulatedSplineDefinitions; // 0x2d38 [Size: 0x10]
	TArray<AthenaStreamIdOverride> ReticulatedSplineIds; // 0x2d48 [Size: 0x10]
	uint8_t pad_2d58[0x18]; // 0x2d58
	bool bDamageComboHUDEnabled : 1; // 0x2d70 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2d71[0x3]; // 0x2d71
	int DamageComboHUDMinHits; // 0x2d74 [Size: 0x4]
	uint8_t pad_2d78[0x8]; // 0x2d78
	FString MatchesProxyMatchId; // 0x2d80 [Size: 0x10]
	uint8_t pad_2d90[0x38]; // 0x2d90
	float DelayMovementInputReplicated; // 0x2dc8 [Size: 0x4]
	bool bCraftingEnabled : 1; // 0x2dcc [Mask: 0x1] [Bit: 0]
};


struct FortGameStateBase
{
public:
	uint8_t pad_0[0x340]; // 0x0
	InterfaceProperty FortTimeOfDayManager; // 0x340 [Size: 0x10]
};


struct FortGameStateDeployableBase
{
public:
	uint8_t pad_0[0x10c8]; // 0x0
	FortDeployableBaseManager* DeployableBaseManager; // 0x10c8 [Size: 0x8]
};


struct FortGameStateEndless
{
public:
	uint8_t pad_0[0x10c8]; // 0x0
	int WaveNumber; // 0x10c8 [Size: 0x4]
};


struct FortGameStateOutpost
{
public:
	uint8_t pad_0[0x10c8]; // 0x0
	bool bOutpostDefenseActive : 1; // 0x10c8 [Mask: 0x1] [Bit: 0]
	bool bWargameActive : 1; // 0x10c9 [Mask: 0x1] [Bit: 0]
	enum EStormShieldDefense StormShieldDefenseType; // 0x10ca [Size: 0x1]
	bool bOutpostStatusAllowsMissionStart : 1; // 0x10cb [Mask: 0x1] [Bit: 0]
	uint8_t pad_10cc[0x4c]; // 0x10cc
	float PlayerWeaponSkillLevel; // 0x1118 [Size: 0x4]
};


struct FortGameStatePvE
{
public:
	uint8_t pad_0[0x1018]; // 0x0
	bool bAllowMulching : 1; // 0x1018 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1019[0x1f]; // 0x1019
	FortAircraft* Aircraft; // 0x1038 [Size: 0x8]
	uint8_t pad_1040[0x18]; // 0x1040
	bool bUseMoonbeamHUD : 1; // 0x1058 [Mask: 0x1] [Bit: 0]
};


struct FortGameStateZone
{
public:
	uint8_t pad_0[0x7dc]; // 0x0
	int WaitingToLeaveZoneTimeLeft; // 0x7dc [Size: 0x4]
	float HostilityMeterPercent; // 0x7e0 [Size: 0x4]
	float IntensityPercent; // 0x7e4 [Size: 0x4]
	int SpawnPointsCap; // 0x7e8 [Size: 0x4]
	int SpawnPointsAllocated; // 0x7ec [Size: 0x4]
	int MaxTotalAI; // 0x7f0 [Size: 0x4]
	int MaxEncounterAI; // 0x7f4 [Size: 0x4]
	int MaxEncounterSP; // 0x7f8 [Size: 0x4]
	uint8_t pad_7fc[0x4]; // 0x7fc
	FReplicatedMontageMap ReplicatedMontageMap; // 0x800 [Size: 0x18]
	TArray<FortGameplayModifierItemDefinition*> AllSpawnGroupUpgradeModifierDefs; // 0x818 [Size: 0x10]
	enum EFortCompletionResult CompletionResult; // 0x828 [Size: 0x1]
	uint8_t pad_829[0x4b]; // 0x829
	float PlayerBuildingSkillLevel; // 0x874 [Size: 0x4]
	TArray<float> PlayerSharedMaxTrapAttributes; // 0x878 [Size: 0x10]
	uint8_t pad_888[0x80]; // 0x888
	FGameplayTagContainer ExplicitGloballyBlockedAbilityTags; // 0x908 [Size: 0x20]
	uint8_t pad_928[0x20]; // 0x928
	bool bInvitesRestricted : 1; // 0x948 [Mask: 0x1] [Bit: 0]
	bool bDBNODeathEnabled : 1; // 0x949 [Mask: 0x1] [Bit: 0]
	uint8_t pad_94a[0x2]; // 0x94a
	uint32_t ServerGameplayTagIndexHash; // 0x94c [Size: 0x4]
	uint8_t pad_950[0x8c]; // 0x950
	int TotalPlayerStructures; // 0x9dc [Size: 0x4]
	int MaxPlayerStructures; // 0x9e0 [Size: 0x4]
	bool bGlobalCeaseFire : 1; // 0x9e4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9e5[0x1b]; // 0x9e5
	FortGlobalEnvironmentAbilityActor* GlobalEnvironmentAbilityActor; // 0xa00 [Size: 0x8]
	uint8_t pad_a08[0x10]; // 0xa08
	ActiveGameplayModifierArray ActiveGameplayModifiers; // 0xa18 [Size: 0x70]
	uint8_t pad_a88[0x10]; // 0xa88
	FDataTableRowHandle ZoneDifficultyInfoRow; // 0xa98 [Size: 0x10]
	FortZoneTheme* ZoneTheme; // 0xaa8 [Size: 0x8]
	SoftClassProperty MissionGeneratorClass; // 0xab0 [Size: 0x20]
	TArray<FortItemQuantityPair> MissionRewards; // 0xad0 [Size: 0x10]
	TArray<FortZoneDifficultyIncreaseRewardData> DifficultyIncreaseRewards; // 0xae0 [Size: 0x10]
	FortZoneMissionAlertData MissionAlertData; // 0xaf0 [Size: 0x30]
	FManagedValidationArray ManagedObjectData; // 0xb20 [Size: 0x60]
	uint8_t pad_b80[0x98]; // 0xb80
	TArray<FSoftObjectPath> ClientPreloadMissionClasses; // 0xc18 [Size: 0x10]
	FortThreatVisualsManager* ThreatVisualsManager; // 0xc28 [Size: 0x8]
	FortThreatParticleActor* ThreatParticleActor; // 0xc30 [Size: 0x8]
	uint8_t pad_c38[0x1c]; // 0xc38
	float GameDifficulty; // 0xc54 [Size: 0x4]
	uint8_t pad_c58[0x4]; // 0xc58
	bool bIsGroupContent : 1; // 0xc5c [Mask: 0x1] [Bit: 0]
	uint8_t pad_c5d[0x3]; // 0xc5d
	int DifficultyIncreaseRewardTier; // 0xc60 [Size: 0x4]
	uint8_t pad_c64[0x94]; // 0xc64
	FortInGameMapManager* UIMapManager; // 0xcf8 [Size: 0x8]
	uint8_t pad_d00[0x20]; // 0xd00
	FString TheaterUniqueId; // 0xd20 [Size: 0x10]
	FString MissionLogDebugString; // 0xd30 [Size: 0x10]
	uint8_t pad_d40[0x1c]; // 0xd40
	bool bAllowBuildingAtLayoutRequirements : 1; // 0xd5c [Mask: 0x1] [Bit: 0]
	bool bAllowBuildingWithoutLayoutRequirements : 1; // 0xd5d [Mask: 0x1] [Bit: 0]
	bool bAllowLayoutRequirementsFeature : 1; // 0xd5e [Mask: 0x1] [Bit: 0]
	uint8_t pad_d5f[0xd]; // 0xd5f
	int NumSurvivorsRescued; // 0xd6c [Size: 0x4]
	uint8_t pad_d70[0x10]; // 0xd70
	enum EServerStability ServerStability; // 0xd80 [Size: 0x1]
	uint8_t pad_d81[0x7f]; // 0xd81
	TArray<FVoteData> GameplayVotesArray; // 0xe00 [Size: 0x10]
	uint8_t pad_e10[0x18]; // 0xe10
	FortCreativeRealEstatePlotManager* CreativeRealEstatePlotManager; // 0xe28 [Size: 0x8]
	uint8_t pad_e30[0x18]; // 0xe30
	enum EFortServerTickRate ReplicatedServerTickRate; // 0xe48 [Size: 0x1]
	enum EFortPhysicsTickRate ReplicatedPhysicsTickRate; // 0xe49 [Size: 0x1]
};


struct FortGameplayEffectDeliveryActor
{
public:
	uint8_t pad_0[0x440]; // 0x0
	bool bIsBeingKilled : 1; // 0x440 [Mask: 0x1] [Bit: 0]
	bool bHasExploded : 1; // 0x440 [Mask: 0x2] [Bit: 1]
	uint8_t pad_441[0x27]; // 0x441
	FortSpawnContext SpawnContext; // 0x468 [Size: 0x28]
};


struct FortGameplayMutator
{
public:
	uint8_t pad_0[0x278]; // 0x0
	bool bMutatorActive : 1; // 0x278 [Mask: 0x1] [Bit: 0]
};


struct FortHookGunRope
{
public:
	uint8_t pad_0[0x3f4]; // 0x0
	FHookGunRopeRepData HookGunRopeRepData; // 0x3f4 [Size: 0x10]
};


struct FortHotfixBlockingVolume
{
public:
	uint8_t pad_0[0x278]; // 0x0
	FVector ReplicatedExtent; // 0x278 [Size: 0x18]
};


struct FortHotfixComponentTagVolume
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FVector ReplicatedExtent; // 0x280 [Size: 0x18]
	TArray<FName> ReplicatedComponentTags; // 0x298 [Size: 0x10]
};


struct FortHotfixUndergroundVolume
{
public:
	uint8_t pad_0[0x278]; // 0x0
	FVector ReplicatedExtent; // 0x278 [Size: 0x18]
};


struct FortInGameMapManager
{
public:
	uint8_t pad_0[0x2c0]; // 0x0
	TArray<FTeamMapInfo> MapData; // 0x2c0 [Size: 0x10]
	bool bClearAllFog : 1; // 0x2d0 [Mask: 0x1] [Bit: 0]
};


struct FortInventory
{
public:
	uint8_t pad_0[0x2b9]; // 0x0
	enum EFortInventoryType InventoryType; // 0x2b9 [Size: 0x1]
	uint8_t pad_2ba[0x6]; // 0x2ba
	FortItemList Inventory; // 0x2c0 [Size: 0x88]
	uint8_t pad_348[0x1c]; // 0x348
	FortPawn* ReplayPawn; // 0x364 [Size: 0x8]
};


struct FortInventoryOutpost
{
public:
	uint8_t pad_0[0x400]; // 0x0
	bool bHasUnavailableItems : 1; // 0x400 [Mask: 0x1] [Bit: 0]
};


struct FortLauncherAthena
{
public:
	uint8_t pad_0[0xe1c]; // 0x0
	FServerLaunchInfo ReplayLaunchInfo; // 0xe1c [Size: 0xc]
	FServerLaunchInfo ServerLaunchInfo; // 0xe28 [Size: 0xc]
};


struct FortLevelInstanceDeviceBase
{
public:
	uint8_t pad_0[0xb60]; // 0x0
	AGameplayVolume* GameplayVolume; // 0xb60 [Size: 0x8]
	FGuid LevelInstanceSpawnGuid; // 0xb68 [Size: 0x10]
};


struct FortLevelSpawnActor
{
public:
	uint8_t pad_0[0x344]; // 0x0
	FName SpecialActorID; // 0x344 [Size: 0x4]
};


struct FortLobbyBeaconPlayerState
{
public:
	uint8_t pad_0[0x338]; // 0x0
	UniqueNetIdRepl ConsoleUniqueNetId; // 0x338 [Size: 0x30]
	FString Platform; // 0x368 [Size: 0x10]
	uint8_t TeamAffiliation; // 0x378 [Size: 0x1]
	uint8_t pad_379[0x3]; // 0x379
	int CurrentCharXP; // 0x37c [Size: 0x4]
	int MatchmakingLevel; // 0x380 [Size: 0x4]
	uint8_t pad_384[0x4]; // 0x384
	FString HeroId; // 0x388 [Size: 0x10]
	FortHeroType* HeroType; // 0x398 [Size: 0x8]
	FortHeroType* CommanderType; // 0x3a0 [Size: 0x8]
	FortAthenaLoadout AthenaLoadout; // 0x3a8 [Size: 0x108]
	FCosmeticLoadout CosmeticLoadout; // 0x4b0 [Size: 0x18]
	uint8_t pad_4c8[0x8]; // 0x4c8
	int LobbyTimeRemaining; // 0x4d0 [Size: 0x4]
	uint8_t pad_4d4[0x4]; // 0x4d4
	int64_t HomeBaseVersion; // 0x4d8 [Size: 0x8]
	TArray<FString> SelectedGadgets; // 0x4e0 [Size: 0x10]
	FPlayerFORTStats FORTStats; // 0x4f0 [Size: 0x40]
	FPlayerBannerInfo BannerInfo; // 0x530 [Size: 0x28]
	float CampaignBackpackRating; // 0x558 [Size: 0x4]
	float CampaignCommanderLoadoutRating; // 0x55c [Size: 0x4]
};


struct FortLobbyBeaconState
{
public:
	uint8_t pad_0[0x35c]; // 0x0
	int MatchmakingLevel; // 0x35c [Size: 0x4]
	FString MissionGeneratorClassPath; // 0x360 [Size: 0x10]
	uint8_t pad_370[0x8]; // 0x370
	enum ELobbyMissionGeneratorDetailsRequirement MissionGeneratorDetailsRequirement; // 0x378 [Size: 0x1]
};


struct FortLobbyBeaconStateRM
{
public:
	uint8_t pad_0[0x39c]; // 0x0
	int LobbyTimeRemaining; // 0x39c [Size: 0x4]
};


struct FortMarkActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FortPlayerStateZone* OwningPlayer; // 0x270 [Size: 0x8]
	FString MarkString; // 0x278 [Size: 0x10]
	FText PreapprovedMarkString; // 0x288 [Size: 0x10]
	bool bFinishedEditing : 1; // 0x298 [Mask: 0x1] [Bit: 0]
	uint8_t pad_299[0x7]; // 0x299
	Actor* AttachedToActor; // 0x2a0 [Size: 0x8]
	FVector AttachmentOffset; // 0x2a8 [Size: 0x18]
};


struct FortMediaStreamingRadio
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	float MediaStartTimeFromInit; // 0x2e0 [Size: 0x4]
};


struct FortMeshBeaconClient
{
public:
	uint8_t pad_0[0x380]; // 0x0
	uint32_t GameplayTagIndexHash; // 0x380 [Size: 0x4]
};


struct FortMeshNetworkEventsLoader
{
public:
	uint8_t pad_0[0x288]; // 0x0
	FMeshNetworkEventStateDataArray ActiveMeshNetworkEvents; // 0x288 [Size: 0x60]
};


struct FortMinigame
{
public:
	uint8_t pad_0[0x688]; // 0x0
	float TimeLimit; // 0x688 [Size: 0x4]
	int CurrentRound; // 0x68c [Size: 0x4]
	int TotalRounds; // 0x690 [Size: 0x4]
	uint8_t pad_694[0xa1]; // 0x694
	enum ERespawnSpectateBehavior RespawnSpectateBehavior; // 0x735 [Size: 0x1]
	uint8_t pad_736[0xaa]; // 0x736
	FText DisplayName; // 0x7e0 [Size: 0x10]
	enum EFortMinigamePlayerSpawnLocationSetting SpawnLocationSetting; // 0x7f0 [Size: 0x1]
	enum EFortMinigamePostGameSpawnLocationSetting PostGameSpawnLocationSetting; // 0x7f1 [Size: 0x1]
	enum EFortMinigameSpawnPadSelection SpawnPadSelection; // 0x7f2 [Size: 0x1]
	uint8_t pad_7f3[0x1]; // 0x7f3
	float PostGameResetDelay; // 0x7f4 [Size: 0x4]
	uint8_t pad_7f8[0x4]; // 0x7f8
	bool bTimerCountsDown : 1; // 0x7fc [Mask: 0x1] [Bit: 0]
	bool bSlowMotionOnEndOfRound : 1; // 0x7fd [Mask: 0x1] [Bit: 0]
	enum EFortMinigameState CurrentState; // 0x7fe [Size: 0x1]
	bool bRequestPostGameResetUI : 1; // 0x7ff [Mask: 0x1] [Bit: 0]
	uint8_t pad_800[0x4]; // 0x800
	int MaxLivesForPlayer; // 0x804 [Size: 0x4]
	uint8_t pad_808[0x8]; // 0x808
	FortMinigameTimes ServerTime; // 0x810 [Size: 0x14]
	uint8_t pad_824[0x14]; // 0x824
	bool bStopwatchMode : 1; // 0x838 [Mask: 0x1] [Bit: 0]
	uint8_t pad_839[0xd7]; // 0x839
	Actor* Volume; // 0x910 [Size: 0x8]
	uint8_t pad_918[0x1]; // 0x918
	bool bAllowJoinInProgress : 1; // 0x919 [Mask: 0x1] [Bit: 0]
	uint8_t pad_91a[0x4]; // 0x91a
	enum EMinigameWinCondition WinCondition; // 0x91e [Size: 0x1]
	bool bOnlyAllowRespawningIfPlayerStartPadsFound : 1; // 0x91f [Mask: 0x1] [Bit: 0]
	uint8_t pad_920[0x4c]; // 0x920
	int GameEndedCount; // 0x96c [Size: 0x4]
	uint8_t pad_970[0x10]; // 0x970
	int NumMinigameComponentsServer; // 0x980 [Size: 0x4]
	bool bHasSpawningFromSaveFinish : 1; // 0x984 [Mask: 0x1] [Bit: 0]
	uint8_t pad_985[0x23]; // 0x985
	TArray<int> RoundWinHistory; // 0x9a8 [Size: 0x10]
};


struct FortMinigameScoreRegistry
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FortPlaysetItemDefinition* Playset; // 0x270 [Size: 0x8]
	FMinigameScoreTemplate ScoreTemplate; // 0x278 [Size: 0xc]
	uint8_t pad_284[0x24]; // 0x284
	FMinigameScoreArray Scores; // 0x2a8 [Size: 0x70]
};


struct FortMinigameSettingsBuilding
{
public:
	uint8_t pad_0[0x310]; // 0x0
	FGameplayTagContainer GameplayTags; // 0x310 [Size: 0x20]
	uint8_t pad_330[0x8]; // 0x330
	TArray<FText> GameDescriptionData; // 0x338 [Size: 0x10]
	FText GameNameData; // 0x348 [Size: 0x10]
	uint8_t pad_358[0x88]; // 0x358
	FCreativeIslandMatchmakingSettings MatchmakingSettings; // 0x3e0 [Size: 0x50]
	enum EFortCreativeEventSystemType EventSystem; // 0x430 [Size: 0x1]
	uint8_t pad_431[0x7f]; // 0x431
	Actor* SettingsVolume; // 0x4b0 [Size: 0x8]
	uint8_t pad_4b8[0x38]; // 0x4b8
	FMinigamePostGameSettings PostGameSettingsOverride; // 0x4f0 [Size: 0x88]
};


struct FortMission
{
public:
	uint8_t pad_0[0x2b8]; // 0x0
	FortMissionInfo* MissionInfo; // 0x2b8 [Size: 0x8]
	uint8_t pad_2c0[0x30]; // 0x2c0
	enum EMissionGenerationCategory MissionCategory; // 0x2f0 [Size: 0x1]
	uint8_t pad_2f1[0x3]; // 0x2f1
	int UIIndex; // 0x2f4 [Size: 0x4]
	UniqueNetIdRepl QuestOwnerAccount; // 0x2f8 [Size: 0x30]
	uint8_t pad_328[0x80]; // 0x328
	float MissionActivationTime; // 0x3a8 [Size: 0x4]
	uint8_t pad_3ac[0x4]; // 0x3ac
	FortMissionFocusDisplayData CurrentFocusData; // 0x3b0 [Size: 0x18]
	bool bSilentDestroyNextFrame : 1; // 0x3c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3c9[0x7]; // 0x3c9
	TArray<FortObjectiveBase*> ActiveObjectives; // 0x3d0 [Size: 0x10]
	TArray<UniqueNetIdRepl> ParticipatingAccounts; // 0x3e0 [Size: 0x10]
	TArray<UniqueNetIdRepl> ParticipatingButDisconnectedAccounts; // 0x3f0 [Size: 0x10]
	enum EFortMissionStatus MissionStatus; // 0x400 [Size: 0x1]
	uint8_t pad_401[0x27]; // 0x401
	bool bIsMissionVisible : 1; // 0x428 [Mask: 0x1] [Bit: 0]
	enum EFortMissionAudibility MissionAudibility; // 0x429 [Size: 0x1]
	uint8_t pad_42a[0xa]; // 0x42a
	FGuid MissionGUID; // 0x434 [Size: 0x10]
	int StartingDay; // 0x444 [Size: 0x4]
	uint8_t pad_448[0x14]; // 0x448
	int ChosenRewardIdx; // 0x45c [Size: 0x4]
	uint8_t pad_460[0x8]; // 0x460
	FortBadgeCountArray PotentialBadgesArray; // 0x468 [Size: 0x58]
};


struct FortMissionManager
{
public:
	uint8_t pad_0[0x2a8]; // 0x0
	FortBluGloManager* BluGloManager; // 0x2a8 [Size: 0x8]
	uint8_t pad_2b0[0x10]; // 0x2b0
	TArray<FortAIPawn*> AllMissionEnemyClasses; // 0x2c0 [Size: 0x10]
	uint8_t pad_2d0[0x30]; // 0x2d0
	TArray<FortMissionUIActorHandle> MissionUIActors; // 0x300 [Size: 0x10]
	FortMission* CurrentUIFocusedMission; // 0x310 [Size: 0x8]
	FortMission* MissionClosestToPar; // 0x318 [Size: 0x8]
	uint8_t pad_320[0x28]; // 0x320
	EarnedBadgeEntryArray EarnedBadgesArray; // 0x348 [Size: 0x58]
};


struct FortMissionStormSafeZone
{
public:
	uint8_t pad_0[0x2a8]; // 0x0
	bool bSafeZoneInStormStateChanged : 1; // 0x2a8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2a9[0x3]; // 0x2a9
	float SafeZoneRadius; // 0x2ac [Size: 0x4]
};


struct FortMissionStormShield
{
public:
	uint8_t pad_0[0x2cc]; // 0x0
	float ReplicatedRadius; // 0x2cc [Size: 0x4]
	FStormShieldRadiusGrowthData RadiusGrowthData; // 0x2d0 [Size: 0x18]
	FStormShieldMoveData MoveData; // 0x2e8 [Size: 0x40]
	bool UseGrowthRateDirectly : 1; // 0x328 [Mask: 0x1] [Bit: 0]
	bool bAntiStormShield : 1; // 0x329 [Mask: 0x1] [Bit: 0]
	uint8_t pad_32a[0x1ca]; // 0x32a
	int NumPhases; // 0x4f4 [Size: 0x4]
	int CurrentPhase; // 0x4f8 [Size: 0x4]
	uint8_t pad_4fc[0x4]; // 0x4fc
	TArray<FortMissionStormSafeZone*> SafeAreas; // 0x500 [Size: 0x10]
};


struct FortMountedTurret
{
public:
	uint8_t pad_0[0x2020]; // 0x0
	uint8_t TeamIndex; // 0x2020 [Size: 0x1]
	uint8_t pad_2021[0x168]; // 0x2021
	bool bTurretSleeping : 1; // 0x2189 [Mask: 0x1] [Bit: 0]
};


struct FortObjectiveBase
{
public:
	uint8_t pad_0[0x2c8]; // 0x0
	FGameplayTagContainer ObjectiveHandle; // 0x2c8 [Size: 0x20]
	uint8_t pad_2e8[0x11]; // 0x2e8
	bool bIsObjectiveVisible : 1; // 0x2f9 [Mask: 0x1] [Bit: 0]
	enum EFortMissionVisibilityOverride VisibilityOverride; // 0x2fa [Size: 0x1]
	bool bIsProgressBarHidden : 1; // 0x2fb [Mask: 0x1] [Bit: 0]
	enum EFortMissionAudibility ObjectiveAudiblity; // 0x2fc [Size: 0x1]
	uint8_t pad_2fd[0x2]; // 0x2fd
	enum EFortObjectiveStatus ObjectiveStatus; // 0x2ff [Size: 0x1]
};


struct FortOctopusTowhookAttachableProjectile
{
public:
	uint8_t pad_0[0xbf8]; // 0x0
	FortOctopusVehicle* OwningVehicle; // 0xbf8 [Size: 0x8]
};


struct FortOctopusVehicle
{
public:
	uint8_t pad_0[0x2080]; // 0x0
	FTowHookParams BaseTowhookParams; // 0x2080 [Size: 0xd0]
	uint8_t pad_2150[0x178]; // 0x2150
	FNetTowhookAttachState ReplicatedAttachState; // 0x22c8 [Size: 0x38]
	uint8_t pad_2300[0x810]; // 0x2300
	FVector_NetQuantizeNormal NetTowhookAimDir; // 0x2b10 [Size: 0x18]
};


struct FortPartyRiftPortalManager
{
public:
	uint8_t pad_0[0x480]; // 0x0
	TArray<FortAthenaPartyRiftPortal*> AllPortals; // 0x480 [Size: 0x10]
};


struct FortPawn
{
public:
	uint8_t pad_0[0x720]; // 0x0
	bool bIgnoreNextFallingDamage : 1; // 0x720 [Mask: 0x8] [Bit: 3]
	bool bIsDying : 1; // 0x720 [Mask: 0x20] [Bit: 5]
	bool bIsHiddenForDeath : 1; // 0x720 [Mask: 0x80] [Bit: 7]
	bool bIsKnockedback : 1; // 0x721 [Mask: 0x1] [Bit: 0]
	bool bIsStaggered : 1; // 0x721 [Mask: 0x2] [Bit: 1]
	bool bMovingEmote : 1; // 0x721 [Mask: 0x40] [Bit: 6]
	bool bMovingEmoteForwardOnly : 1; // 0x721 [Mask: 0x80] [Bit: 7]
	bool bMovingEmoteFollowingOnly : 1; // 0x722 [Mask: 0x1] [Bit: 0]
	bool bMovingEmoteSkipLandingFX : 1; // 0x722 [Mask: 0x2] [Bit: 1]
	bool bIsInvulnerable : 1; // 0x722 [Mask: 0x4] [Bit: 2]
	bool bSpotted : 1; // 0x722 [Mask: 0x8] [Bit: 3]
	bool bWeaponActivated : 1; // 0x723 [Mask: 0x2] [Bit: 1]
	bool bReplicatedIsInGoop : 1; // 0x723 [Mask: 0x8] [Bit: 3]
	bool bIsSkating : 1; // 0x723 [Mask: 0x20] [Bit: 5]
	uint8_t pad_724[0x25]; // 0x724
	bool bIsSwinging : 1; // 0x749 [Mask: 0x1] [Bit: 0]
	bool bSwingingAttached : 1; // 0x749 [Mask: 0x2] [Bit: 1]
	uint8_t pad_74a[0x6]; // 0x74a
	FVector SwingAttachLocation; // 0x750 [Size: 0x18]
	uint8_t pad_768[0xc9]; // 0x768
	bool bWeaponHolstered : 1; // 0x831 [Mask: 0x10] [Bit: 4]
	bool bPostSequenceMovementReplicationState : 1; // 0x831 [Mask: 0x40] [Bit: 6]
	uint8_t pad_832[0x17]; // 0x832
	bool bIsDBNO : 1; // 0x849 [Mask: 0x80] [Bit: 7]
	bool bWasDBNOOnDeath : 1; // 0x84a [Mask: 0x1] [Bit: 0]
	bool bShouldUseCharacterMovementIdleFastPath : 1; // 0x84a [Mask: 0x4] [Bit: 2]
	enum EFortMovementStyle CurrentMovementStyle; // 0x84b [Size: 0x1]
	uint8_t pad_84c[0x1]; // 0x84c
	uint8_t TeleportCounter; // 0x84d [Size: 0x1]
	uint8_t pad_84e[0x22]; // 0x84e
	FDataTableRowHandle PawnStatHandle; // 0x870 [Size: 0x10]
	FDataTableRowHandle OverridePawnStatHandle; // 0x880 [Size: 0x10]
	uint8_t pad_890[0x4]; // 0x890
	bool bIsSlopeSliding : 1; // 0x894 [Mask: 0x1] [Bit: 0]
	uint8_t pad_895[0x1]; // 0x895
	uint16_t PackedReplicatedSlopeAngles; // 0x896 [Size: 0x2]
	uint8_t pad_898[0x8]; // 0x898
	FortStormShieldComponent* StormShieldComponent; // 0x8a0 [Size: 0x8]
	uint8_t pad_8a8[0xe8]; // 0x8a8
	bool bIsJumping : 1; // 0x990 [Mask: 0x1] [Bit: 0]
	uint8_t pad_991[0x3]; // 0x991
	int PawnUniqueID; // 0x994 [Size: 0x4]
	FortWeapon* CurrentWeapon; // 0x998 [Size: 0x8]
	uint8_t pad_9a0[0x90]; // 0x9a0
	FGameplayTagContainer DeathTags; // 0xa30 [Size: 0x20]
	float SpawnImmunityTime; // 0xa50 [Size: 0x4]
	uint8_t pad_a54[0x14]; // 0xa54
	FortWaterBodyActor* ReplicatedWaterBody; // 0xa68 [Size: 0x8]
	uint8_t pad_a70[0x20]; // 0xa70
	bool bIsStunned : 1; // 0xa90 [Mask: 0x1] [Bit: 0]
	uint8_t pad_a91[0x7]; // 0xa91
	TArray<FWindVolumeData> WindVolumes; // 0xa98 [Size: 0x10]
	uint8_t pad_aa8[0x8]; // 0xaa8
	FVortexParams VortexParams; // 0xab0 [Size: 0x90]
	bool bReplicatedIsInVortex : 1; // 0xb40 [Mask: 0x2] [Bit: 1]
	uint8_t pad_b41[0xf]; // 0xb41
	FortSkyTube* ReplicatedSkyTube; // 0xb50 [Size: 0x8]
	uint8_t pad_b58[0x68]; // 0xb58
	FVector_NetQuantize PushMomentum; // 0xbc0 [Size: 0x18]
	uint8_t pad_bd8[0x4]; // 0xbd8
	float LocalSpin; // 0xbdc [Size: 0x4]
	uint8_t pad_be0[0x1]; // 0xbe0
	bool bTurnTransitionActiveAndControllingRotation : 1; // 0xbe1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_be2[0x20e]; // 0xbe2
	FPawnDamageZones DamageZones; // 0xdf0 [Size: 0x78]
	uint8_t DamageZoneActiveBitMask; // 0xe68 [Size: 0x1]
	uint8_t pad_e69[0x17]; // 0xe69
	uint8_t JumpFlashCountPacked; // 0xe80 [Size: 0x1]
	uint8_t LandingFlashCountPacked; // 0xe81 [Size: 0x1]
	uint8_t pad_e82[0x7e]; // 0xe82
	FortItemDefinition* LastReplicatedEmoteExecuted; // 0xf00 [Size: 0x8]
	uint8_t pad_f08[0x8]; // 0xf08
	float EmoteWalkSpeed; // 0xf10 [Size: 0x4]
	uint8_t pad_f14[0x1c]; // 0xf14
	TArray<FortGameplayModifierItemDefinition*> AdditionalModifierDefinitions; // 0xf30 [Size: 0x10]
	uint8_t pad_f40[0x23c]; // 0xf40
	bool bIgnoreCancelSwimSprintHolster : 1; // 0x117c [Mask: 0x1] [Bit: 0]
	uint8_t pad_117d[0x11b]; // 0x117d
	TArray<FortPawnVocalChord> VocalChords; // 0x1298 [Size: 0x10]
	uint8_t pad_12a8[0x18]; // 0x12a8
	bool bIsDisconnectedPawn : 1; // 0x12c0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_12c1[0xdf]; // 0x12c1
	FText DisplayName; // 0x13a0 [Size: 0x10]
	uint8_t pad_13b0[0x70]; // 0x13b0
	FGameplayTag CurrentCalloutTag; // 0x1420 [Size: 0x4]
	uint8_t pad_1424[0x14c]; // 0x1424
	FortConversationSentence CurrentSentence; // 0x1570 [Size: 0x98]
	uint8_t pad_1608[0x288]; // 0x1608
	FClientAILODSettings ClientAILODSettings; // 0x1890 [Size: 0x2f0]
	FGameplayTag FallbackTag; // 0x1b80 [Size: 0x4]
	uint8_t pad_1b84[0x4]; // 0x1b84
	FString DebugType; // 0x1b88 [Size: 0x10]
	uint8_t pad_1b98[0x90]; // 0x1b98
	TArray<ABuildingActor*> OverlappingBuildings; // 0x1c28 [Size: 0x10]
	uint8_t pad_1c38[0x28]; // 0x1c38
	FRepMovementModeExtension RepMovementModeExtension; // 0x1c60 [Size: 0x38]
	uint8_t pad_1c98[0x68]; // 0x1c98
	float CapsuleRadiusFortPawn; // 0x1d00 [Size: 0x4]
	float CapsuleHalfHeightFortPawn; // 0x1d04 [Size: 0x4]
	uint8_t pad_1d08[0x10]; // 0x1d08
	double MeshHeightAdjustFortPawn; // 0x1d18 [Size: 0x8]
	uint8_t pad_1d20[0x60]; // 0x1d20
	FallDamageBlockedData LastFallDamageBlocked; // 0x1d80 [Size: 0x30]
};


struct FortPhysicsBall
{
public:
	uint8_t pad_0[0x9a5]; // 0x0
	bool bApplyingBackspin : 1; // 0x9a5 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9a6[0xc]; // 0x9a6
	bool bApplyingLift : 1; // 0x9b2 [Mask: 0x1] [Bit: 0]
};


struct FortPhysicsPawn
{
public:
	uint8_t pad_0[0x2f8]; // 0x0
	FVehicleTransformInfo ReplicatedTransformReq; // 0x2f8 [Size: 0x38]
	float GravityMultiplier; // 0x330 [Size: 0x4]
};


struct FortPhysicsPawnObject
{
public:
	uint8_t pad_0[0x710]; // 0x0
	FVehicleTargetOrientation CorrectTargetOrientation; // 0x710 [Size: 0x48]
	uint8_t pad_758[0xb0]; // 0x758
	FortAbilitySystemComponent* AbilitySystemComponent; // 0x808 [Size: 0x8]
	FortHealthSet* HealthSet; // 0x810 [Size: 0x8]
	uint8_t pad_818[0x18]; // 0x818
	bool bPendingDeath : 1; // 0x830 [Mask: 0x1] [Bit: 0]
	uint8_t pad_831[0x48]; // 0x831
	enum EPhysicalSurface SurfaceTypePhysicsObjectOn; // 0x879 [Size: 0x1]
	uint8_t pad_87a[0x36]; // 0x87a
	FTimeStampedPhysicsPawnState CurrentServerPhysicsState; // 0x8b0 [Size: 0x90]
	uint8_t pad_940[0xa0]; // 0x940
	FHitData LastServerConfirmedHit; // 0x9e0 [Size: 0xc0]
	uint8_t pad_aa0[0x110]; // 0xaa0
	FPhysicsPawnObjectInitialParameters InitialParameters; // 0xbb0 [Size: 0x30]
};


struct FortPhysicsPickup
{
public:
	uint8_t pad_0[0x798]; // 0x0
	bool bInitialVelocitySet : 1; // 0x798 [Mask: 0x8] [Bit: 3]
	uint8_t pad_799[0x3]; // 0x799
	float InitialTossSpeed; // 0x79c [Size: 0x4]
	FVector_NetQuantizeNormal InitialTossDirection; // 0x7a0 [Size: 0x18]
	FVector_NetQuantize InitialPhysicsExtent; // 0x7b8 [Size: 0x18]
	FVector_NetQuantize InitialPhysicsRotation; // 0x7d0 [Size: 0x18]
	TArray<Actor*> InitialServerIgnoredActors; // 0x7e8 [Size: 0x10]
	uint8_t pad_7f8[0x10]; // 0x7f8
	FVector_NetQuantize ServerStoppedSimulationLocation; // 0x808 [Size: 0x18]
};


struct FortPhysicsTowHook
{
public:
	uint8_t pad_0[0x270]; // 0x0
	TArray<FNetTowhookAttachState> ReplicatedAttachStates; // 0x270 [Size: 0x10]
};


struct FortPickup
{
public:
	uint8_t pad_0[0x28a]; // 0x0
	uint8_t ServerImpactSoundFlash; // 0x28a [Size: 0x1]
	uint8_t pad_28b[0x1]; // 0x28b
	bool bCanBeMarked : 1; // 0x28c [Mask: 0x2] [Bit: 1]
	bool bPickedUp : 1; // 0x28c [Mask: 0x4] [Bit: 2]
	bool bTossedFromContainer : 1; // 0x28c [Mask: 0x10] [Bit: 4]
	bool bForceHideMinimapIndicator : 1; // 0x28c [Mask: 0x20] [Bit: 5]
	bool bCombinePickupsWhenTossCompletes : 1; // 0x28c [Mask: 0x40] [Bit: 6]
	bool bRandomRotation : 1; // 0x28c [Mask: 0x80] [Bit: 7]
	bool bServerStoppedSimulation : 1; // 0x28d [Mask: 0x1] [Bit: 0]
	uint8_t pad_28e[0xda]; // 0x28e
	FortItemEntry PrimaryPickupItemEntry; // 0x368 [Size: 0x98]
	TArray<FortItemEntry> MultiItemPickupEntries; // 0x400 [Size: 0x10]
	FortPickupLocationData PickupLocationData; // 0x410 [Size: 0xd8]
	Actor* OwnerInstigator; // 0x4e8 [Size: 0x8]
	int16_t OptionalOwnerID; // 0x4f0 [Size: 0x2]
	uint8_t pad_4f2[0x5a]; // 0x4f2
	float OverrideInteractAimRadius; // 0x54c [Size: 0x4]
	uint8_t pad_550[0x20]; // 0x550
	FortPawn* PawnWhoDroppedPickup; // 0x570 [Size: 0x8]
	uint8_t pad_578[0x4]; // 0x578
	FName SpecialActorID; // 0x57c [Size: 0x4]
};


struct FortPickupCreative
{
public:
	uint8_t pad_0[0x728]; // 0x0
	FortCreativeCostComponent* CostComponent; // 0x728 [Size: 0x8]
	uint8_t pad_730[0x4]; // 0x730
	int CachedPickupInstigatorHandle; // 0x734 [Size: 0x4]
};


struct FortPlayerController
{
public:
	uint8_t pad_0[0x848]; // 0x0
	bool bTrapsInNoBuild : 1; // 0x848 [Mask: 0x1] [Bit: 0]
	uint8_t pad_849[0x18f]; // 0x849
	bool bHasInitiallySpawned : 1; // 0x9d8 [Mask: 0x4] [Bit: 2]
	uint8_t pad_9d9[0xc8]; // 0x9d9
	bool bHasServerFinishedLoading : 1; // 0xaa1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_aa2[0x3aa]; // 0xaa2
	bool bHoldingObject : 1; // 0xe4c [Mask: 0x1] [Bit: 0]
	uint8_t pad_e4d[0x3c3]; // 0xe4d
	Actor* DummyCamera; // 0x1210 [Size: 0x8]
	uint8_t pad_1218[0x18]; // 0x1218
	AIDirectorDebugInfo IntensityGraphInfo; // 0x1230 [Size: 0x28]
	AIDirectorDebugInfo PIDValuesGraphInfo; // 0x1258 [Size: 0x28]
	AIDirectorDebugInfo PIDContributionsGraphInfo; // 0x1280 [Size: 0x28]
	uint8_t pad_12a8[0x3ec]; // 0x12a8
	bool bBuildFree : 1; // 0x1694 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1695[0x63]; // 0x1695
	bool bCraftFree : 1; // 0x16f8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_16f9[0x25f]; // 0x16f9
	FDelayedQuickBarActionContainer DelayedQuickBarActions; // 0x1958 [Size: 0x60]
	uint8_t pad_19b8[0x110]; // 0x19b8
	bool bAutoEquipBetterItems : 1; // 0x1ac8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1ac9[0xf]; // 0x1ac9
	InterfaceProperty WorldInventory; // 0x1ad8 [Size: 0x10]
	FortInventory* OutpostInventory; // 0x1ae8 [Size: 0x8]
	InterfaceProperty ViewTargetInventory; // 0x1af0 [Size: 0x10]
	uint8_t pad_1b00[0x2a8]; // 0x1b00
	FortRewardReport LatestRewardReport; // 0x1da8 [Size: 0x58]
	uint8_t pad_1e00[0x8]; // 0x1e00
	TArray<FortUpdatedObjectiveStat> UpdatedObjectiveStats; // 0x1e08 [Size: 0x10]
	bool bHasUnsavedPrimaryMissionProgress : 1; // 0x1e18 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1e19[0xdf]; // 0x1e19
	enum EFortPCTutorialCompletedState TutorialCompletedState; // 0x1ef8 [Size: 0x1]
	uint8_t pad_1ef9[0x97]; // 0x1ef9
	TArray<FortPlayerController*> CustomVoicePriorityListPlayers; // 0x1f90 [Size: 0x10]
	uint8_t pad_1fa0[0x70]; // 0x1fa0
	FortProximityChatSettingsProviderBase* ProximityChatSettingsProvider; // 0x2010 [Size: 0x8]
	uint8_t pad_2018[0x8]; // 0x2018
	FortProximityChatPriorityListProviderBase* ProximityChatPriorityListProviderClass; // 0x2020 [Size: 0x8]
	uint8_t pad_2028[0x10]; // 0x2028
	enum EFortVoiceChatRenderMode VoiceChatRenderMode; // 0x2038 [Size: 0x4]
	uint8_t pad_203c[0x60]; // 0x203c
	bool bInfiniteAmmo : 1; // 0x209c [Mask: 0x4] [Bit: 2]
	bool bInfiniteConsumables : 1; // 0x209c [Mask: 0x8] [Bit: 3]
	bool bNoCoolDown : 1; // 0x209d [Mask: 0x1] [Bit: 0]
	bool bInfiniteDurability : 1; // 0x209d [Mask: 0x2] [Bit: 1]
	bool bCheatGhost : 1; // 0x209d [Mask: 0x20] [Bit: 5]
	bool bCheatFly : 1; // 0x209d [Mask: 0x40] [Bit: 6]
	bool bEnableShotLogging : 1; // 0x209e [Mask: 0x1] [Bit: 0]
	bool bIsNearActiveEncounters : 1; // 0x209e [Mask: 0x2] [Bit: 1]
	uint8_t pad_209f[0x1]; // 0x209f
	int OverriddenBackpackSize; // 0x20a0 [Size: 0x4]
	uint8_t pad_20a4[0x4]; // 0x20a4
	FortReplayMovableSpotLight* CurrentReplaySpotLight; // 0x20a8 [Size: 0x8]
	uint32_t AimHelpMode; // 0x20b0 [Size: 0x4]
	enum EFortJumpStaminaCost JumpStaminaCost; // 0x20b4 [Size: 0x1]
	uint8_t pad_20b5[0x3]; // 0x20b5
	FName CameraPrototypeName; // 0x20b8 [Size: 0x4]
	uint8_t pad_20bc[0x50c]; // 0x20bc
	bool bFinalXPUpdateFailed : 1; // 0x25c8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_25c9[0x16f]; // 0x25c9
	TArray<FString> MeshParentIds; // 0x2738 [Size: 0x10]
};


struct FortPlayerControllerAthena
{
public:
	uint8_t pad_0[0x3708]; // 0x0
	Actor* FocalPoint; // 0x3708 [Size: 0x8]
	FVector_NetQuantize FocalPointOffset; // 0x3710 [Size: 0x18]
	float FocalPointFOV; // 0x3728 [Size: 0x4]
	uint8_t pad_372c[0xcc]; // 0x372c
	FortPlayerState* SkydiveLeader; // 0x37f8 [Size: 0x8]
	bool bSkydiveLeaderIsDropMaster : 1; // 0x3800 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3801[0x17]; // 0x3801
	FortPlayerStateAthena* LastDownedVictim; // 0x3818 [Size: 0x8]
	FortPlayerStateAthena* LastElimVictim; // 0x3820 [Size: 0x8]
	uint8_t pad_3828[0x3f2]; // 0x3828
	bool bKeepLoadingScreen : 1; // 0x3c1a [Mask: 0x1] [Bit: 0]
	enum EFortMinigameState KeepLoadingScreenUntilMinigameState; // 0x3c1b [Size: 0x1]
	uint8_t pad_3c1c[0x4]; // 0x3c1c
	int MaxPlotCount; // 0x3c20 [Size: 0x4]
	uint8_t pad_3c24[0x17c]; // 0x3c24
	bool bMarkedAlive : 1; // 0x3da0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3da1[0x7]; // 0x3da1
	TArray<FCreativeIslandData> CreativeIslands; // 0x3da8 [Size: 0x10]
	bool bIsAllowedToPublish : 1; // 0x3db8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3db9[0xef]; // 0x3db9
	FortBroadcastRemoteClientInfo* BroadcastRemoteClientInfo; // 0x3ea8 [Size: 0x8]
	uint8_t pad_3eb0[0x388]; // 0x3eb0
	FortVolume* CreativePlotLinkedVolume; // 0x4238 [Size: 0x8]
	uint8_t pad_4240[0x18]; // 0x4240
	FortAthenaCreativePortal* OwnedPortal; // 0x4258 [Size: 0x8]
	FortAthenaPartyRiftPortal* OwnedPartyRiftPortal; // 0x4260 [Size: 0x8]
	FMinigameReadyState MinigameReadyState; // 0x4268 [Size: 0x2]
	uint8_t pad_426a[0x5e]; // 0x426a
	TArray<FItemAndCount> CachedPurchasedItems; // 0x42c8 [Size: 0x10]
	FMinigameSpawnData PendingMinigameSpawnData; // 0x42d8 [Size: 0x3]
	uint8_t pad_42db[0x2d]; // 0x42db
	FortPlaysetItemDefinition* CurrentPlayset; // 0x4308 [Size: 0x8]
	uint8_t pad_4310[0x1d0]; // 0x4310
	UCreativeUserContentManager* CreativeUserContentManager; // 0x44e0 [Size: 0x8]
	uint8_t pad_44e8[0x30]; // 0x44e8
	FortCreativeObjectTrackingComponent* CreativeObjectTrackingComponent; // 0x4518 [Size: 0x8]
	FortCreativeEntitlementComponent* CreativeEntitlementComponent; // 0x4520 [Size: 0x8]
};


struct FortPlayerControllerGameplay
{
public:
	uint8_t pad_0[0x2910]; // 0x0
	int16_t PoiTagContainerTableID; // 0x2910 [Size: 0x2]
	uint8_t pad_2912[0x2b6]; // 0x2912
	UCreativeQuickbarComponent* CreativeQuickbarComponent; // 0x2bc8 [Size: 0x8]
	uint8_t pad_2bd0[0x198]; // 0x2bd0
	FGhostModeRepData GhostModeRepData; // 0x2d68 [Size: 0x18]
	uint8_t pad_2d80[0x4c]; // 0x2d80
	uint16_t ServerNumNPCs; // 0x2dcc [Size: 0x2]
	uint16_t ServerMaxNumNPCs; // 0x2dce [Size: 0x2]
	uint8_t pad_2dd0[0x8]; // 0x2dd0
	bool bDisplayNPCNumbers : 1; // 0x2dd8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2dd9[0x87]; // 0x2dd9
	int FlyingModifierIndex; // 0x2e60 [Size: 0x4]
	uint8_t pad_2e64[0x2c]; // 0x2e64
	int UIMetricsDisplayIndex; // 0x2e90 [Size: 0x4]
	uint8_t pad_2e94[0x4]; // 0x2e94
	bool bIsFlightSprinting : 1; // 0x2e98 [Mask: 0x1] [Bit: 0]
	bool bIsCreativeModeEnabled : 1; // 0x2e99 [Mask: 0x1] [Bit: 0]
	bool bIsCreativeQuickbarEnabled : 1; // 0x2e99 [Mask: 0x2] [Bit: 1]
	bool bCreativeMCPProfileIsMatchamkingEnabled : 1; // 0x2e99 [Mask: 0x20] [Bit: 5]
	bool bIsCreativeThermometerNewUIEnabled : 1; // 0x2e9a [Mask: 0x10] [Bit: 4]
	bool bIsCreativeIslandExporterEnabled : 1; // 0x2e9a [Mask: 0x20] [Bit: 5]
	bool bIsCreativeModeratorModeEnabled : 1; // 0x2e9a [Mask: 0x40] [Bit: 6]
	bool bIsCreativeModeratorModeActive : 1; // 0x2e9a [Mask: 0x80] [Bit: 7]
};


struct FortPlayerControllerOutpost
{
public:
	uint8_t pad_0[0x38b0]; // 0x0
	TArray<FortDepositedResources> PostDepositedResources; // 0x38b0 [Size: 0x10]
};


struct FortPlayerControllerSpectating
{
public:
	uint8_t pad_0[0x3760]; // 0x0
	FortBroadcastRemoteClientInfo* FollowedPlayerRemoteClientInfo; // 0x3760 [Size: 0x8]
};


struct FortPlayerControllerZone
{
public:
	uint8_t pad_0[0x3254]; // 0x0
	enum ELeecherStatus PlayerLeecherStatus; // 0x3254 [Size: 0x1]
	uint8_t pad_3255[0x173]; // 0x3255
	FVoiceChatChannelInfo VoiceChatChannel; // 0x33c8 [Size: 0x28]
	uint8_t pad_33f0[0x60]; // 0x33f0
	TArray<Actor*> DesyncNotifyList; // 0x3450 [Size: 0x10]
};


struct FortPlayerPawn
{
public:
	uint8_t pad_0[0x1f78]; // 0x0
	FortAthenaVehicleInputStateReliable VehicleInputStateReliable; // 0x1f78 [Size: 0x2]
	bool bIsNearSafeZoneEdge : 1; // 0x1f7a [Mask: 0x1] [Bit: 0]
	bool bIsTacticalSprinting : 1; // 0x1f7a [Mask: 0x80] [Bit: 7]
	bool bIsWaterJump : 1; // 0x1f7b [Mask: 0x2] [Bit: 1]
	bool bIsWaterSprintBoost : 1; // 0x1f7b [Mask: 0x4] [Bit: 2]
	bool bIsWaterSprintBoostPending : 1; // 0x1f7b [Mask: 0x8] [Bit: 3]
	bool bIsTargeting : 1; // 0x1f7c [Mask: 0x2] [Bit: 1]
	bool bIsTargetingConsumableThrow : 1; // 0x1f7c [Mask: 0x4] [Bit: 2]
	bool bIsSwappingCharacterParts : 1; // 0x1f7c [Mask: 0x8] [Bit: 3]
	uint8_t pad_1f7d[0x3]; // 0x1f7d
	TArray<enum EFortPawnStasisMode> StasisModes; // 0x1f80 [Size: 0x10]
	uint8_t pad_1f90[0x10]; // 0x1f90
	enum EFortBuildingState BuildingState; // 0x1fa0 [Size: 0x1]
	int8_t AccelerationZPack; // 0x1fa1 [Size: 0x1]
	uint8_t pad_1fa2[0x142]; // 0x1fa2
	bool bIsInWaterVolume : 1; // 0x20e4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_20e5[0x5b]; // 0x20e5
	FPlayerPawnShallowWaterVolumeData ShallowWaterVolumeData; // 0x2140 [Size: 0x8]
	uint8_t pad_2148[0x24]; // 0x2148
	uint8_t CachedTeamControllingRC; // 0x216c [Size: 0x1]
	uint8_t BalloonActiveCount; // 0x216d [Size: 0x1]
	uint8_t pad_216e[0x1]; // 0x216e
	bool bIsSkydiving : 1; // 0x216f [Mask: 0x1] [Bit: 0]
	bool bIsParachuteOpen : 1; // 0x2170 [Mask: 0x1] [Bit: 0]
	bool bIsParachuteForcedOpen : 1; // 0x2171 [Mask: 0x4] [Bit: 2]
	bool bIsSkydivingFromBus : 1; // 0x2171 [Mask: 0x8] [Bit: 3]
	bool bIsSkydivingFromLaunchPad : 1; // 0x2171 [Mask: 0x10] [Bit: 4]
	bool bAllowPickupInteractionWhileSkydiving : 1; // 0x2171 [Mask: 0x40] [Bit: 6]
	bool bIsProxySimulationTimedOut : 1; // 0x2172 [Mask: 0x1] [Bit: 0]
	bool bInGliderRedeploy : 1; // 0x2172 [Mask: 0x4] [Bit: 2]
	bool bStartedInteractSearch : 1; // 0x2173 [Mask: 0x10] [Bit: 4]
	bool bIsUsingJetpack : 1; // 0x2173 [Mask: 0x40] [Bit: 6]
	bool bIsPlayingEmote : 1; // 0x2173 [Mask: 0x80] [Bit: 7]
	uint8_t pad_2174[0x99]; // 0x2174
	bool bIsRespawning : 1; // 0x220d [Mask: 0x2] [Bit: 1]
	bool bIsRespawningInAir : 1; // 0x220d [Mask: 0x4] [Bit: 2]
	bool bCanShowDefaultSkin : 1; // 0x220d [Mask: 0x20] [Bit: 5]
	bool bDisabledTetheringSupport : 1; // 0x220d [Mask: 0x40] [Bit: 6]
	uint8_t pad_220e[0x57]; // 0x220e
	bool bIsWaitingForEmoteInteraction : 1; // 0x2265 [Mask: 0x2] [Bit: 1]
	bool bIsEmoteLeader : 1; // 0x2265 [Mask: 0x4] [Bit: 2]
	bool bShouldSyncAnimationWithEmoteLeader : 1; // 0x2265 [Mask: 0x8] [Bit: 3]
	bool bShouldJitterAnimationSyncWithEmoteLeader : 1; // 0x2265 [Mask: 0x10] [Bit: 4]
	bool bDoubleFileEmoteSecondLine : 1; // 0x2265 [Mask: 0x20] [Bit: 5]
	bool bLockGroupEmoteLeaderRotation : 1; // 0x2265 [Mask: 0x80] [Bit: 7]
	uint8_t pad_2266[0x6]; // 0x2266
	int EmoteBandLeaderIndex; // 0x226c [Size: 0x4]
	FortPlayerPawn* GroupEmoteLookTarget; // 0x2270 [Size: 0x8]
	FortPlayerPawn* GroupEmoteTailTarget; // 0x2278 [Size: 0x8]
	uint8_t pad_2280[0x70]; // 0x2280
	float GroupEmoteAnimOffset; // 0x22f0 [Size: 0x4]
	float GroupEmoteLeaderRotationYawOffset; // 0x22f4 [Size: 0x4]
	uint8_t pad_22f8[0x90]; // 0x22f8
	uint8_t GroupEmoteSyncValue; // 0x2388 [Size: 0x1]
	uint8_t pad_2389[0x3]; // 0x2389
	int EmoteRandomSeed; // 0x238c [Size: 0x4]
	uint8_t pad_2390[0x140]; // 0x2390
	uint16_t ReplicatedCustomMeshHeightAdjustTarget; // 0x24d0 [Size: 0x2]
	uint8_t pad_24d2[0x96]; // 0x24d2
	bool bIsInAnyStorm : 1; // 0x2568 [Mask: 0x1] [Bit: 0]
	bool bIsInsideSafeZone : 1; // 0x2568 [Mask: 0x2] [Bit: 1]
	uint8_t pad_2569[0x213]; // 0x2569
	bool bHasStartedFloating : 1; // 0x277c [Mask: 0x1] [Bit: 0]
	uint8_t pad_277d[0x3]; // 0x277d
	FZiplinePawnState ZiplineState; // 0x2780 [Size: 0x68]
	uint8_t pad_27e8[0x13c]; // 0x27e8
	bool bCanPredictJumpApex : 1; // 0x2924 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2925[0x1cb]; // 0x2925
	FortPlayerControllerGameplay* InteractingPCRep; // 0x2af0 [Size: 0x8]
	uint8_t pad_2af8[0xd8]; // 0x2af8
	ABuildingGameplayActorPlayerPropAttachment* PossessedProp; // 0x2bd0 [Size: 0x8]
	uint8_t pad_2bd8[0x3b8]; // 0x2bd8
	FortAthenaLoadout BaseCosmeticLoadout; // 0x2f90 [Size: 0x108]
	uint8_t pad_3098[0x128]; // 0x3098
	FortSwapItemAndVariantDataSoftArray AppliedSwapsSoft; // 0x31c0 [Size: 0x20]
	uint8_t pad_31e0[0x8]; // 0x31e0
	FortAthenaLoadoutReplicator BaseCosmeticLoadoutReplicator; // 0x31e8 [Size: 0x150]
	uint8_t pad_3338[0x108]; // 0x3338
	uint32_t ServerLoadoutChangeSync; // 0x3440 [Size: 0x4]
	uint8_t pad_3444[0x5c]; // 0x3444
	TArray<FortPawnMaterialOverride> MaterialOverrides; // 0x34a0 [Size: 0x10]
	uint8_t pad_34b0[0x30]; // 0x34b0
	FortCharacterPartsRepMontageInfo RepCharPartAnimMontageInfo; // 0x34e0 [Size: 0x20]
	FortClientObservedStatArray ClientObservedStats; // 0x3500 [Size: 0x78]
	uint8_t pad_3578[0x8]; // 0x3578
	FortAIPawnCustomizationDefinition* NPCCustomizationInfo; // 0x3580 [Size: 0x8]
	uint8_t pad_3588[0x20]; // 0x3588
	AnimInstance* AnimBPOverride; // 0x35a8 [Size: 0x8]
	uint8_t pad_35b0[0x8]; // 0x35b0
	FortFootstepAudioBank* FootstepBankOverride; // 0x35b8 [Size: 0x8]
	uint8_t pad_35c0[0x10]; // 0x35c0
	FortWeaponAnimSet* WeaponAnimSetOverride; // 0x35d0 [Size: 0x8]
	TArray<AnimInstance*> AnimLayersOverride; // 0x35d8 [Size: 0x10]
	uint8_t pad_35e8[0x458]; // 0x35e8
	FortDBNOCarryHoisterData DBNOHoisterData; // 0x3a40 [Size: 0x10]
	FortPlayerPawn* DBNOHoistee; // 0x3a50 [Size: 0x8]
	uint8_t pad_3a58[0x230]; // 0x3a58
	uint32_t PlayerStatus; // 0x3c88 [Size: 0x4]
	uint16_t AccelerationPack; // 0x3c8c [Size: 0x2]
	uint8_t pad_3c8e[0x2]; // 0x3c8e
	FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x3c90 [Size: 0x38]
	FortEmoteRepInfo ReplicatedEmoteInfo; // 0x3cc8 [Size: 0x28]
	int RepAnimMontageStartSection; // 0x3cf0 [Size: 0x4]
	bool bNetMovementPrioritized : 1; // 0x3cf4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3cf5[0x3]; // 0x3cf5
	FReplicatedMontagePair LandingMontagePair; // 0x3cf8 [Size: 0x20]
	uint8_t pad_3d18[0x26c]; // 0x3d18
	bool bParachuteLockedOpen : 1; // 0x3f84 [Mask: 0x1] [Bit: 0]
	uint8_t pad_3f85[0x3]; // 0x3f85
	FRepFortMeshAttachment AttachmentMesh; // 0x3f88 [Size: 0x10]
	uint8_t pad_3f98[0x2e8]; // 0x3f98
	FortPlayerPetRepState* PetState; // 0x4280 [Size: 0x8]
	uint8_t pad_4288[0x30]; // 0x4288
	TArray<AthenaGliderItemDefinition*> GliderOverrideStack; // 0x42b8 [Size: 0x10]
	uint8_t pad_42c8[0x2b0]; // 0x42c8
	uint32_t RemoteViewData32; // 0x4578 [Size: 0x4]
	uint8_t pad_457c[0x28]; // 0x457c
	FortRemoteControlledPawnAthena* ControlledRCPawn; // 0x45a4 [Size: 0x8]
	uint8_t pad_45ac[0x4]; // 0x45ac
	FRotator StoredControlRotation; // 0x45b0 [Size: 0x18]
	uint8_t pad_45c8[0x8]; // 0x45c8
	enum EFortFacialAnimTypes FacialTypeOverride; // 0x45d0 [Size: 0x1]
	uint8_t pad_45d1[0x297]; // 0x45d1
	FortStandInPlayerPawn* ReplacedByPawn; // 0x4868 [Size: 0x8]
};


struct FortPlayerPawnAthena
{
public:
	uint8_t pad_0[0x4918]; // 0x0
	Actor* ItemInteractionActor; // 0x4918 [Size: 0x8]
	uint8_t pad_4920[0x78]; // 0x4920
	float ServerWorldTimeRevivalTime; // 0x4998 [Size: 0x4]
	uint8_t pad_499c[0x1c]; // 0x499c
	FName ItemSpecialActorID; // 0x49b8 [Size: 0x4]
	FGameplayTag ItemSpecialActorCategoryTag; // 0x49bc [Size: 0x4]
	uint8_t pad_49c0[0xd0]; // 0x49c0
	FortPlayerAthenaAttributeReplicationProxy AttributeReplicationProxy; // 0x4a90 [Size: 0x2c]
	FortPlayerAthenaGravityAttributeReplicationProxy GravityAttributeReplicationProxy; // 0x4abc [Size: 0x10]
	uint8_t pad_4acc[0x4]; // 0x4acc
	FGameplayAbilityRepAnimMontage ReplayRepAnimMontageInfo; // 0x4ad0 [Size: 0x38]
	uint8_t pad_4b08[0x8]; // 0x4b08
	FMinimalGameplayCueReplicationProxy SimulatedProxyActiveGameplayCues; // 0x4b10 [Size: 0x2c0]
	FMinimalGameplayCueReplicationProxy SimulatedProxyMinimalReplicationGameplayCues; // 0x4dd0 [Size: 0x2c0]
	FMinimalReplicationTagCountMap FastReplicationMinimalReplicationTags; // 0x5090 [Size: 0x28]
	uint8_t pad_50b8[0x290]; // 0x50b8
	FMinimalReplicationTagCountMap FastReplicationReplicatedLooseTags; // 0x5348 [Size: 0x28]
	uint8_t pad_5370[0x228]; // 0x5370
	AthenaPawnReplayData EncryptedPawnReplayData; // 0x5598 [Size: 0x30]
	uint8_t pad_55c8[0x1b8]; // 0x55c8
	bool bIsCreativeGhostModeActivated : 1; // 0x5780 [Mask: 0x1] [Bit: 0]
	bool bIsCreativeModeratorModeActivated : 1; // 0x5781 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5782[0x1ce]; // 0x5782
	bool bShowMarkerIcon : 1; // 0x5950 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5951[0x12f]; // 0x5951
	int UpdateSharedReplicationWhileAttachedCount; // 0x5a80 [Size: 0x4]
	uint8_t pad_5a84[0x6a]; // 0x5a84
	bool bImprovedDBNOEnabled : 1; // 0x5aee [Mask: 0x1] [Bit: 0]
	uint8_t DBNORevivingActorsCount; // 0x5aef [Size: 0x1]
};


struct FortPlayerPetRepState
{
public:
	uint8_t pad_0[0x278]; // 0x0
	Actor* LookAtTarget; // 0x278 [Size: 0x8]
	AthenaPetItemDefinition* PetItemDef; // 0x280 [Size: 0x8]
	FPetStimuliRepData StimuliTag; // 0x288 [Size: 0x8]
};


struct FortPlayerPushableCart
{
public:
	uint8_t pad_0[0x9a0]; // 0x0
	USplineComponent* SplineComponent; // 0x9a0 [Size: 0x8]
	TArray<int> SplineCheckPointIndices; // 0x9a8 [Size: 0x10]
	uint8_t CurrentCheckpoint; // 0x9b8 [Size: 0x1]
	FTeamRoles TeamRoles; // 0x9b9 [Size: 0x2]
	uint8_t pad_9bb[0x25]; // 0x9bb
	uint8_t TotalActivePushers; // 0x9e0 [Size: 0x1]
	uint8_t TotalActiveDefenders; // 0x9e1 [Size: 0x1]
	bool bIsPushable : 1; // 0x9e2 [Mask: 0x1] [Bit: 0]
	uint8_t pad_9e3[0xe5]; // 0x9e3
	bool bIsNearCheckpoint : 1; // 0xac8 [Mask: 0x1] [Bit: 0]
};


struct FortPlayerStartupController
{
public:
	uint8_t pad_0[0x278]; // 0x0
	float ContainmentTimer; // 0x278 [Size: 0x4]
};


struct FortPlayerState
{
public:
	uint8_t pad_0[0x388]; // 0x0
	bool bIsWorldDataOwner : 1; // 0x388 [Mask: 0x1] [Bit: 0]
	bool bIsGameSessionOwner : 1; // 0x388 [Mask: 0x2] [Bit: 1]
	bool bIsGameSessionAdmin : 1; // 0x388 [Mask: 0x4] [Bit: 2]
	bool bIsReadyToContinue : 1; // 0x388 [Mask: 0x8] [Bit: 3]
	bool bHasFinishedLoading : 1; // 0x388 [Mask: 0x10] [Bit: 4]
	bool bHasStartedPlaying : 1; // 0x388 [Mask: 0x20] [Bit: 5]
	bool bRepFlag1 : 1; // 0x388 [Mask: 0x40] [Bit: 6]
	uint8_t pad_389[0x3]; // 0x389
	enum EFortPlayerRole PlayerRole; // 0x38c [Size: 0x1]
	uint8_t pad_38d[0x1]; // 0x38d
	int16_t WorldPlayerId; // 0x38e [Size: 0x2]
	UniqueNetIdRepl PartyOwnerUniqueId; // 0x390 [Size: 0x30]
	FString HeroId; // 0x3c0 [Size: 0x10]
	FortHeroType* HeroType; // 0x3d0 [Size: 0x8]
	int CurrentCharXP; // 0x3d8 [Size: 0x4]
	FortPickup* MyBackpackPickup; // 0x3dc [Size: 0x8]
	int InitialExperienceLevel; // 0x3e4 [Size: 0x4]
	int InitialExperienceAmount; // 0x3e8 [Size: 0x4]
	uint8_t pad_3ec[0x4]; // 0x3ec
	TArray<FortExperienceDelta> ExperienceDeltas; // 0x3f0 [Size: 0x10]
	FString Platform; // 0x400 [Size: 0x10]
	FPlayerBannerInfo Banner; // 0x410 [Size: 0x28]
	FCachedLoadoutCharacterInfo CachedLoadoutCharacterInfo; // 0x438 [Size: 0x10]
	uint8_t pad_448[0x8]; // 0x448
	bool bIsSimulatingDamage : 1; // 0x450 [Mask: 0x1] [Bit: 0]
	uint8_t pad_451[0x14f]; // 0x451
	FCustomCharacterData CharacterData; // 0x5a0 [Size: 0x58]
	uint8_t pad_5f8[0x40]; // 0x5f8
	FortTeamInfo* PlayerTeam; // 0x638 [Size: 0x8]
	FortTeamPrivateInfo* PlayerTeamPrivate; // 0x640 [Size: 0x8]
	uint8_t pad_648[0x1c]; // 0x648
	FReplicatedStatValues ReplicatedStats_Campaign; // 0x664 [Size: 0x118]
	FReplicatedStatValues ReplicatedStats_Zone; // 0x77c [Size: 0x118]
	uint8_t pad_894[0x4]; // 0x894
	bool bAreZoneStatsFinalized : 1; // 0x898 [Mask: 0x1] [Bit: 0]
	enum EReadyCheckState ReadyCheckState; // 0x899 [Size: 0x1]
	uint8_t pad_89a[0x6]; // 0x89a
	Actor* HomeActor; // 0x8a0 [Size: 0x8]
	uint8_t pad_8a8[0x70]; // 0x8a8
	UniqueNetIdRepl PlatformUniqueNetId; // 0x918 [Size: 0x30]
	uint8_t pad_948[0x88]; // 0x948
	bool bInGhostMode : 1; // 0x9d0 [Mask: 0x1] [Bit: 0]
};


struct FortPlayerStateAthena
{
public:
	uint8_t pad_0[0xe34]; // 0x0
	int PersonalLobbyAction; // 0xe34 [Size: 0x4]
	uint8_t pad_e38[0xb4]; // 0xe38
	int TeamKillScore; // 0xeec [Size: 0x4]
	uint8_t pad_ef0[0x21]; // 0xef0
	uint8_t TeamIndex; // 0xf11 [Size: 0x1]
	uint8_t pad_f12[0x2]; // 0xf12
	int TeamScorePlacement; // 0xf14 [Size: 0x4]
	int TeamScore; // 0xf18 [Size: 0x4]
	bool bTeamPlacementLocked : 1; // 0xf1c [Mask: 0x1] [Bit: 0]
	uint8_t pad_f1d[0x3]; // 0xf1d
	int Place; // 0xf20 [Size: 0x4]
	int DownScore; // 0xf24 [Size: 0x4]
	int KillScore; // 0xf28 [Size: 0x4]
	int SeasonLevelUIDisplay; // 0xf2c [Size: 0x4]
	uint8_t pad_f30[0x4c]; // 0xf30
	int NumChestsOpened; // 0xf7c [Size: 0x4]
	uint8_t pad_f80[0x4]; // 0xf80
	int NumAmmoCansOpened; // 0xf84 [Size: 0x4]
	uint8_t pad_f88[0x4]; // 0xf88
	int NumSupplyDropsOpened; // 0xf8c [Size: 0x4]
	uint8_t pad_f90[0x4]; // 0xf90
	int NumLlamasOpened; // 0xf94 [Size: 0x4]
	uint8_t pad_f98[0x4]; // 0xf98
	int NumForagedItemsConsumed; // 0xf9c [Size: 0x4]
	uint8_t pad_fa0[0x4]; // 0xfa0
	int NumMinutesAlive; // 0xfa4 [Size: 0x4]
	uint8_t pad_fa8[0x4]; // 0xfa8
	int NumBronzeCoinsCollected; // 0xfac [Size: 0x4]
	uint8_t pad_fb0[0x4]; // 0xfb0
	int NumSilverCoinsCollected; // 0xfb4 [Size: 0x4]
	uint8_t pad_fb8[0x4]; // 0xfb8
	int NumGoldCoinsCollected; // 0xfbc [Size: 0x4]
	uint8_t pad_fc0[0x4]; // 0xfc0
	int TotalPlayerScore; // 0xfc4 [Size: 0x4]
	uint8_t pad_fc8[0xa0]; // 0xfc8
	uint8_t StormSurgeEffectCount; // 0x1068 [Size: 0x1]
	uint8_t pad_1069[0x1]; // 0x1069
	int16_t TeamAverageDamage; // 0x106a [Size: 0x2]
	uint8_t SquadId; // 0x106c [Size: 0x1]
	bool bThankedBusDriver : 1; // 0x106d [Mask: 0x1] [Bit: 0]
	bool bDidNotThankBusDriver : 1; // 0x106d [Mask: 0x2] [Bit: 1]
	bool bUsingAnonymousMode : 1; // 0x106d [Mask: 0x4] [Bit: 2]
	bool bUsingAnonymousCharacterMode : 1; // 0x106d [Mask: 0x8] [Bit: 3]
	bool bShowingSeasonLevel : 1; // 0x106d [Mask: 0x10] [Bit: 4]
	uint8_t pad_106e[0x2]; // 0x106e
	FText PlayerNameCustomOverride; // 0x1070 [Size: 0x10]
	bool bHidingOtherPlayersNames : 1; // 0x1080 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1081[0x2c7]; // 0x1081
	FDetailedMetricInformation MetricInformation; // 0x1348 [Size: 0x10]
	FSimpleMetricInformation SimpleMetricInformation; // 0x1358 [Size: 0x78]
	uint8_t pad_13d0[0x8]; // 0x13d0
	bool bActiveBeingRebooted : 1; // 0x13d8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_13d9[0x1]; // 0x13d9
	bool bIsDisconnected : 1; // 0x13da [Mask: 0x1] [Bit: 0]
	uint8_t pad_13db[0x55]; // 0x13db
	FDeathInfo DeathInfo; // 0x1430 [Size: 0xc0]
	FChangeTeamInfo ChangeTeamInfo; // 0x14f0 [Size: 0x28]
	float ServerTimeForRespawn; // 0x1518 [Size: 0x4]
	uint8_t pad_151c[0x64]; // 0x151c
	FortResurrectionData ResurrectionChipAvailable; // 0x1580 [Size: 0x28]
	bool bResurrectingNow : 1; // 0x15a8 [Mask: 0x1] [Bit: 0]
	bool bRespawningFromRespawnData : 1; // 0x15a9 [Mask: 0x1] [Bit: 0]
	uint8_t pad_15aa[0x2]; // 0x15aa
	int RebootCounter; // 0x15ac [Size: 0x4]
	InterfaceProperty InteractingRebootVan; // 0x15b0 [Size: 0x10]
	uint8_t pad_15c0[0x14]; // 0x15c0
	enum EMatchAbandonState MatchAbandonState; // 0x15d4 [Size: 0x1]
	uint8_t pad_15d5[0x1]; // 0x15d5
	bool bIsAModerationBot : 1; // 0x15d6 [Mask: 0x1] [Bit: 0]
	bool bIsAnAthenaGameParticipant : 1; // 0x15d7 [Mask: 0x1] [Bit: 0]
	bool bIsContributingToOverbudgetHeatmap : 1; // 0x15d7 [Mask: 0x2] [Bit: 1]
	FString EOSProductUserId; // 0x15d8 [Size: 0x10]
	UniqueNetIdRepl BotUniqueId; // 0x15e8 [Size: 0x30]
	uint8_t pad_1618[0x10]; // 0x1618
	bool bPreserveSquad : 1; // 0x1628 [Mask: 0x1] [Bit: 0]
	uint8_t pad_1629[0x1f]; // 0x1629
	enum EKeepPlayingTogetherVotingStatus KeepPlayingTogetherVotingStatus; // 0x1648 [Size: 0x1]
	uint8_t pad_1649[0x1f]; // 0x1649
	FString KeepPlayingTogetherMatchmakingRegion; // 0x1668 [Size: 0x10]
	uint8_t pad_1678[0x18]; // 0x1678
	FString KeepPlayingTogetherMatchmakingId; // 0x1690 [Size: 0x10]
	uint8_t pad_16a0[0x18]; // 0x16a0
	uint8_t InitialSquadSize; // 0x16b8 [Size: 0x1]
	uint8_t SquadSizeIncrements; // 0x16b9 [Size: 0x1]
	uint8_t SquadSizeDecrements; // 0x16ba [Size: 0x1]
	uint8_t pad_16bb[0x45]; // 0x16bb
	enum ECreativePersistenceErrorTypes PersistenceErrorType; // 0x1700 [Size: 0x1]
	uint8_t pad_1701[0x7]; // 0x1701
	FortSpecialActorReplicationInfo* LocalSpecialActorData; // 0x1708 [Size: 0x8]
};


struct FortPlayerStateOutpost
{
public:
	uint8_t pad_0[0xe50]; // 0x0
	bool bHasPermissionToEditOutpost : 1; // 0xe50 [Mask: 0x1] [Bit: 0]
};


struct FortPlayerStatePvE
{
public:
	uint8_t pad_0[0xe48]; // 0x0
	float CampaignBackpackRating; // 0xe48 [Size: 0x4]
	float CampaignCommanderLoadoutRating; // 0xe4c [Size: 0x4]
};


struct FortPlayerStateZone
{
public:
	uint8_t pad_0[0xa68]; // 0x0
	FortPlayerStateZone* SpectatingTarget; // 0xa68 [Size: 0x8]
	FortSpectatorZoneArray Spectators; // 0xa70 [Size: 0x60]
	uint8_t pad_ad0[0x88]; // 0xad0
	enum EFortKickReason KickedFromSessionReason; // 0xb58 [Size: 0x1]
	uint8_t pad_b59[0x11f]; // 0xb59
	TArray<FortPlayerStateZone*> OtherPlayersSpectatingCurrentTarget; // 0xc78 [Size: 0x10]
	FortCarriedObject* CarriedObject; // 0xc88 [Size: 0x8]
	int NumRejoins; // 0xc90 [Size: 0x4]
	uint8_t pad_c94[0x1c]; // 0xc94
	bool bInvincibleDueToUI : 1; // 0xcb0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_cb1[0x3]; // 0xcb1
	float CurrentHealth; // 0xcb4 [Size: 0x4]
	float MaxHealth; // 0xcb8 [Size: 0x4]
	float CurrentShield; // 0xcbc [Size: 0x4]
	float MaxShield; // 0xcc0 [Size: 0x4]
	float CurrentOvershield; // 0xcc4 [Size: 0x4]
	float MaxOvershield; // 0xcc8 [Size: 0x4]
	float CurrentSignalInStorm; // 0xccc [Size: 0x4]
	float MaxSignalInStorm; // 0xcd0 [Size: 0x4]
	bool bOvershieldBarVisible : 1; // 0xcd4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_cd5[0x2b]; // 0xcd5
	TArray<AccumulatedItemEntry> AccumulatedItems; // 0xd00 [Size: 0x10]
	uint8_t pad_d10[0x10]; // 0xd10
	FSimulatedAttributeArray SimulatedAttributes; // 0xd20 [Size: 0x68]
	uint8_t pad_d88[0x30]; // 0xd88
	bool bInAircraft : 1; // 0xdb8 [Mask: 0x1] [Bit: 0]
	bool bHasEverSkydivedFromBus : 1; // 0xdb8 [Mask: 0x2] [Bit: 1]
	bool bHasEverSkydivedFromBusAndLanded : 1; // 0xdb8 [Mask: 0x4] [Bit: 2]
	uint8_t pad_db9[0x7]; // 0xdb9
	TArray<FortItemDefinition*> QuickbarEquippedItems; // 0xdc0 [Size: 0x10]
	uint8_t pad_dd0[0x28]; // 0xdd0
	enum ETeamMemberState ReplicatedTeamMemberState; // 0xdf8 [Size: 0x1]
};


struct FortPlayspace
{
public:
	uint8_t pad_0[0x578]; // 0x0
	FortInactivePlayspaceUserList InactivePlayspaceUsers; // 0x578 [Size: 0x78]
	uint8_t pad_5f0[0x38]; // 0x5f0
	FortPlayspaceReplicatedState* ReplicatedState; // 0x628 [Size: 0x8]
	uint8_t pad_630[0x8]; // 0x630
	bool bShouldCreateEventRouter : 1; // 0x638 [Mask: 0x1] [Bit: 0]
};


struct FortPoiManager
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FortPoiGridInfo FortPoiGridInfo; // 0x270 [Size: 0x48]
	uint8_t pad_2b8[0x80]; // 0x2b8
	TArray<FGameplayTagContainer> PoiTagContainerTable; // 0x338 [Size: 0x10]
	int PoiTagContainerTableSize; // 0x348 [Size: 0x4]
	uint8_t pad_34c[0x1c]; // 0x34c
	TArray<int16_t> PoiGridForDebugDisplay; // 0x368 [Size: 0x10]
};


struct FortProjectileAthena
{
public:
	uint8_t pad_0[0xab8]; // 0x0
	FHitResult PawnHitResult; // 0xab8 [Size: 0xf8]
	FVector_NetQuantize FireStartLoc; // 0xbb0 [Size: 0x18]
};


struct FortProjectileBase
{
public:
	uint8_t pad_0[0x6c0]; // 0x0
	float ReplicatedMaxSpeed; // 0x6c0 [Size: 0x4]
	float GravityScale; // 0x6c4 [Size: 0x4]
	uint8_t pad_6c8[0x8]; // 0x6c8
	float ChargePercent; // 0x6d0 [Size: 0x4]
	uint8_t pad_6d4[0xa7]; // 0x6d4
	bool bIsPredictedProjectile : 1; // 0x77b [Mask: 0x1] [Bit: 0]
	uint8_t pad_77c[0x4]; // 0x77c
	FortProjectilePredictionKey PredictionKey; // 0x780 [Size: 0x8]
	uint8_t pad_788[0xc]; // 0x788
	int ResumeSimulationCount; // 0x794 [Size: 0x4]
	uint8_t pad_798[0x4]; // 0x798
	uint16_t SyncID; // 0x79c [Size: 0x2]
	uint8_t pad_79e[0x2]; // 0x79e
	FHitResult SimulationStoppingHit; // 0x7a0 [Size: 0xf8]
	uint8_t pad_898[0xd0]; // 0x898
	FortSkyTube* CurrentSkyTube; // 0x968 [Size: 0x8]
	uint8_t pad_970[0x110]; // 0x970
	float MaxSimulationDistanceSquaredOverride; // 0xa80 [Size: 0x4]
};


struct FortPropertyOverrideReplShared
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FPropertyOverrideDataRepl ReplOverrides; // 0x270 [Size: 0x70]
};


struct FortRemoteControlledPawnAthena
{
public:
	uint8_t pad_0[0x5b80]; // 0x0
	bool bCurrentlyDelayingLaunch : 1; // 0x5b80 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5b81[0x3]; // 0x5b81
	float ServerFuseStartTime; // 0x5b84 [Size: 0x4]
	uint8_t RCTeam; // 0x5b88 [Size: 0x1]
	uint8_t pad_5b89[0x3]; // 0x5b89
	FortPlayerPawnAthena* ControllingPlayerPawn; // 0x5b8c [Size: 0x8]
	uint8_t pad_5b94[0xc]; // 0x5b94
	FortAbilitySystemComponent* OverrideAbilitySystemComponent; // 0x5ba0 [Size: 0x8]
	float TriggeredHealthThreshold; // 0x5ba8 [Size: 0x4]
	uint8_t pad_5bac[0x1c]; // 0x5bac
	bool bTriggeredForDestroy : 1; // 0x5bc8 [Mask: 0x1] [Bit: 0]
};


struct FortReplayMovableSpotLight
{
public:
	uint8_t pad_0[0x450]; // 0x0
	bool bGroupMoveLocked : 1; // 0x450 [Mask: 0x1] [Bit: 0]
	uint8_t pad_451[0x3]; // 0x451
	int LightIndex; // 0x454 [Size: 0x4]
	float RepInnerAngle; // 0x458 [Size: 0x4]
	float RepOuterAngle; // 0x45c [Size: 0x4]
	float RepIntensity; // 0x460 [Size: 0x4]
	float RepRadius; // 0x464 [Size: 0x4]
	uint8_t RepColorR; // 0x468 [Size: 0x1]
	uint8_t RepColorG; // 0x469 [Size: 0x1]
	uint8_t RepColorB; // 0x46a [Size: 0x1]
	uint8_t pad_46b[0x1]; // 0x46b
	float RepTemperature; // 0x46c [Size: 0x4]
	bool bRepEnabled : 1; // 0x470 [Mask: 0x1] [Bit: 0]
	bool bDebugDraw : 1; // 0x471 [Mask: 0x1] [Bit: 0]
};


struct FortSafeZoneIndicator
{
public:
	uint8_t pad_0[0x278]; // 0x0
	float PreviousRadius; // 0x278 [Size: 0x4]
	float NextRadius; // 0x27c [Size: 0x4]
	uint8_t pad_280[0x8]; // 0x280
	FVector_NetQuantize100 PreviousCenter; // 0x288 [Size: 0x18]
	FVector_NetQuantize100 NextCenter; // 0x2a0 [Size: 0x18]
	uint8_t pad_2b8[0x28]; // 0x2b8
	USplineComponent* CurrentTravelSplineComponent; // 0x2e0 [Size: 0x8]
	float StormEffectDelayOverride; // 0x2e8 [Size: 0x4]
	bool bSafezoneEventDriven : 1; // 0x2ec [Mask: 0x1] [Bit: 0]
	bool bMotionExternalAuthoritative : 1; // 0x2ed [Mask: 0x1] [Bit: 0]
	bool bPaused : 1; // 0x2ee [Mask: 0x1] [Bit: 0]
	bool bPausedForPreview : 1; // 0x2ef [Mask: 0x1] [Bit: 0]
	uint8_t pad_2f0[0x1]; // 0x2f0
	bool bSafeZoneStateChangeAudioDisabled : 1; // 0x2f1 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2f2[0xa]; // 0x2f2
	int NextNextMegaStormGridCellThickness; // 0x2fc [Size: 0x4]
	int NextMegaStormGridCellThickness; // 0x300 [Size: 0x4]
	float MegaStormDelayTimeBeforeDestruction; // 0x304 [Size: 0x4]
	int NumActiveMegaStormCircles; // 0x308 [Size: 0x4]
	int ActiveMegaStormCircleGridCellCountFromEdge; // 0x30c [Size: 0x4]
	uint8_t pad_310[0x210]; // 0x310
	TArray<FortSafeZonePhaseInfo> SafeZonePhases; // 0x520 [Size: 0x10]
	int CurrentPhase; // 0x530 [Size: 0x4]
	FortSafeZoneDamageInfo CurrentDamageInfo; // 0x534 [Size: 0x8]
	int PhaseCount; // 0x53c [Size: 0x4]
	float SafeZoneStartShrinkTime; // 0x540 [Size: 0x4]
	float SafeZoneFinishShrinkTime; // 0x544 [Size: 0x4]
	float Radius; // 0x548 [Size: 0x4]
	uint8_t pad_54c[0xdc]; // 0x54c
	bool bPreviewDuringWarmup : 1; // 0x628 [Mask: 0x1] [Bit: 0]
	bool bUseAltPhaseChangedEvent : 1; // 0x629 [Mask: 0x1] [Bit: 0]
	uint8_t pad_62a[0x2]; // 0x62a
	float TimeRemainingWhenPhasePaused; // 0x62c [Size: 0x4]
	uint8_t ForceUpdateCount; // 0x630 [Size: 0x1]
};


struct FortSafeZoneIndicatorFuture
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FVector_NetQuantize100 NextNextCenter; // 0x270 [Size: 0x18]
	float NextNextRadius; // 0x288 [Size: 0x4]
};


struct FortServerDebugActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	uint64_t ServerMemSharedInKb; // 0x270 [Size: 0x8]
	uint64_t ServerMemUniqueInKb; // 0x278 [Size: 0x8]
	uint64_t ServerMemVirtualInKb; // 0x280 [Size: 0x8]
	uint64_t ServerMemPhysicalInKb; // 0x288 [Size: 0x8]
	int64_t SharedDeltaInLastMinute; // 0x290 [Size: 0x8]
	int64_t SharedDeltaSinceProcessStart; // 0x298 [Size: 0x8]
	int64_t SharedDeltaSinceDebugStart; // 0x2a0 [Size: 0x8]
	int64_t UniqueDeltaInLastMinute; // 0x2a8 [Size: 0x8]
	int64_t UniqueDeltaSinceProcessStart; // 0x2b0 [Size: 0x8]
	int64_t UniqueDeltaSinceDebugStart; // 0x2b8 [Size: 0x8]
};


struct FortSpaghettiTowhookAttachableProjectile
{
public:
	uint8_t pad_0[0xbf8]; // 0x0
	FortSpaghettiVehicle* OwningVehicle; // 0xbf8 [Size: 0x8]
};


struct FortSpaghettiVehicle
{
public:
	uint8_t pad_0[0x22c8]; // 0x0
	FNetTowhookAttachState ReplicatedAttachState; // 0x22c8 [Size: 0x38]
	uint8_t pad_2300[0x7f0]; // 0x2300
	FVector_NetQuantizeNormal NetTowhookAimDir; // 0x2af0 [Size: 0x18]
};


struct FortSpecialActorReplicationInfo
{
public:
	uint8_t pad_0[0x270]; // 0x0
	FSpecialActorRepDataArray SpecialActorRepList; // 0x270 [Size: 0x58]
	TArray<FSpecialActorTransform> SpecialActorTransforms; // 0x2c8 [Size: 0x10]
	uint8_t pad_2d8[0x18]; // 0x2d8
	TArray<FSlateBrush> SlateBrushes; // 0x2f0 [Size: 0x10]
	TArray<FVector2D> BrushScales; // 0x300 [Size: 0x10]
};


struct FortSpectateAFriendController
{
public:
	uint8_t pad_0[0x37f0]; // 0x0
	FortPlayerStateAthena* PlayerJoinedOn; // 0x37f0 [Size: 0x8]
	bool HasValidTarget : 1; // 0x37f8 [Mask: 0x1] [Bit: 0]
	uint8_t TeamToFollow; // 0x37f9 [Size: 0x1]
	bool FollowAnyTeam : 1; // 0x37fa [Mask: 0x1] [Bit: 0]
	uint8_t pad_37fb[0x1]; // 0x37fb
	int TeamJoinedOnPlacement; // 0x37fc [Size: 0x4]
};


struct FortSplineGroundPath
{
public:
	uint8_t pad_0[0x960]; // 0x0
	FVector MostRecentlyAddedLocation; // 0x960 [Size: 0x18]
	uint8_t pad_978[0x8]; // 0x978
	FortReppedPointList FortReppedPointList; // 0x980 [Size: 0x60]
};


struct FortSprayDecalInstance
{
public:
	uint8_t pad_0[0xad8]; // 0x0
	FortSprayDecalRepPayload SprayInfo; // 0xad8 [Size: 0x30]
};


struct FortStandInPlayerPawn
{
public:
	uint8_t pad_0[0x5b80]; // 0x0
	FortPawn* ReplacedPawn; // 0x5b80 [Size: 0x8]
	uint8_t pad_5b88[0x10]; // 0x5b88
	bool bIsReplacingFortnitePawn : 1; // 0x5b98 [Mask: 0x1] [Bit: 0]
	bool bAbilityChangesOccurredDuringTransition : 1; // 0x5b99 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5b9a[0x7e]; // 0x5b9a
	bool bManualVisibilityChange : 1; // 0x5c18 [Mask: 0x1] [Bit: 0]
	uint8_t pad_5c19[0xf]; // 0x5c19
	FortAbilitySystemComponent* OverrideAbilitySystemComponent; // 0x5c28 [Size: 0x8]
};


struct FortTeamHealthInfo
{
public:
	uint8_t pad_0[0x280]; // 0x0
	FortPlayerHealthInfoComponent* OwnerHealthComponent; // 0x280 [Size: 0x8]
	uint8_t pad_288[0x8]; // 0x288
	FPrivateTeamDataArray RepData; // 0x290 [Size: 0x80]
	uint8_t TeamNum; // 0x310 [Size: 0x1]
};


struct FortTeamInfo
{
public:
	uint8_t pad_0[0x288]; // 0x0
	uint8_t Team; // 0x288 [Size: 0x1]
	uint8_t pad_289[0x7]; // 0x289
	FString ChatRoomID; // 0x290 [Size: 0x10]
	FTeamSpottedActorInfoArray TeamSpottedActors; // 0x2a0 [Size: 0x60]
	FortTeamPrivateInfo* PrivateInfo; // 0x300 [Size: 0x8]
};


struct FortTeamPrivateInfo
{
public:
	uint8_t pad_0[0x278]; // 0x0
	FPrivateTeamDataArray RepData; // 0x278 [Size: 0x80]
	FLatentRepTeamDataArray LatentTeamRepData; // 0x2f8 [Size: 0x60]
	int16_t AverageDamage; // 0x358 [Size: 0x2]
};


struct FortTimeOfDayManager
{
public:
	uint8_t pad_0[0x280]; // 0x0
	float TimeOfDay; // 0x280 [Size: 0x4]
	float TimeOfDayReplicated; // 0x284 [Size: 0x4]
	uint8_t pad_288[0x14]; // 0x288
	float TimeOfDaySpeed; // 0x29c [Size: 0x4]
	uint8_t pad_2a0[0x14]; // 0x2a0
	bool bTimeStarted : 1; // 0x2b4 [Mask: 0x4] [Bit: 2]
	bool bHeightFogEnabled : 1; // 0x2b4 [Mask: 0x8] [Bit: 3]
	uint8_t pad_2b5[0x9cb]; // 0x2b5
	FTimeOfDayDirectOverrides DirectOverrides; // 0xc80 [Size: 0x58]
	uint8_t pad_cd8[0x291]; // 0xcd8
	bool bServerTODIsVisible : 1; // 0xf69 [Mask: 0x1] [Bit: 0]
	uint8_t pad_f6a[0xe]; // 0xf6a
	FortTimeOfDayWeatherComponent* WeatherComponent; // 0xf78 [Size: 0x8]
};


struct FortTimedActorWaveSpawner
{
public:
	uint8_t pad_0[0x398]; // 0x0
	TArray<FortWaveSpawnPoint> WaveSpawnPoints; // 0x398 [Size: 0x10]
};


struct FortTowHookAttachableProjectile
{
public:
	uint8_t pad_0[0xbf8]; // 0x0
	FortPhysicsTowHook* OwningTowHook; // 0xbf8 [Size: 0x8]
};


struct FortTrack
{
public:
	uint8_t pad_0[0xb98]; // 0x0
	FortTrack* NeighborsByDirection; // 0xb98 [Size: 0x20]
	int SwitchState; // 0xbb8 [Size: 0x4]
	int ConfigurationIdx; // 0xbbc [Size: 0x4]
};


struct FortTrapGrenadeProjectile
{
public:
	uint8_t pad_0[0xab0]; // 0x0
	FortDecoTool_ContextTrap* ProjectileDecoTool; // 0xab0 [Size: 0x8]
};


struct FortVolume
{
public:
	uint8_t pad_0[0x370]; // 0x0
	FortVolumeObjectTrackingComponent* ObjectTrackingComponent; // 0x370 [Size: 0x8]
	uint8_t pad_378[0x10]; // 0x378
	bool bNeverAllowSaving : 1; // 0x388 [Mask: 0x1] [Bit: 0]
	uint8_t pad_389[0x67]; // 0x389
	FortPlaysetItemDefinition* CurrentPlayset; // 0x3f0 [Size: 0x8]
	uint8_t pad_3f8[0x88]; // 0x3f8
	enum ESpatialLoadingState VolumeState; // 0x480 [Size: 0x1]
	uint8_t pad_481[0x1bf]; // 0x481
	bool bUserGeneratedContentRestricted : 1; // 0x640 [Mask: 0x1] [Bit: 0]
	uint8_t pad_641[0x7]; // 0x641
	UCreativeIslandResourceManagerComponent* IslandResourceManagerComponent; // 0x648 [Size: 0x8]
	uint8_t pad_650[0x8]; // 0x650
	FortVolumePersistenceOptions* FortVolumePersistenceOptions; // 0x658 [Size: 0x8]
};


struct FortVolumeManager
{
public:
	uint8_t pad_0[0x2e0]; // 0x0
	FortVolumeActiveUsers VolumeActivePlayers; // 0x2e0 [Size: 0x90]
};


struct FortWeakPoint
{
public:
	uint8_t pad_0[0x938]; // 0x0
	enum EFortWeakPointState WeakPointState; // 0x938 [Size: 0x1]
	uint8_t pad_939[0x3]; // 0x939
	FName WeakPointAttachmentSocketName; // 0x93c [Size: 0x4]
	uint8_t pad_940[0x24]; // 0x940
	Actor* WeakPointOwner; // 0x964 [Size: 0x8]
};


struct FortWeap_BuildingTool
{
public:
	uint8_t pad_0[0x1998]; // 0x0
	UBuildingEditModeMetadata* DefaultMetadata; // 0x1998 [Size: 0x8]
};


struct FortWeap_EditingTool
{
public:
	uint8_t pad_0[0x1928]; // 0x0
	ABuildingSMActor* EditActor; // 0x1928 [Size: 0x8]
};


struct FortWeapon
{
public:
	uint8_t pad_0[0x360]; // 0x0
	bool bIsEquippingWeapon : 1; // 0x360 [Mask: 0x1] [Bit: 0]
	uint8_t pad_361[0x17]; // 0x361
	bool bIsChargingWeapon : 1; // 0x378 [Mask: 0x1] [Bit: 0]
	bool bIsReloadingWeapon : 1; // 0x379 [Mask: 0x1] [Bit: 0]
	bool bDisableEquipAnimation : 1; // 0x379 [Mask: 0x2] [Bit: 1]
	bool bCheckCollisionsWithoutAbility : 1; // 0x379 [Mask: 0x4] [Bit: 2]
	uint8_t pad_37a[0x2b6]; // 0x37a
	FortWeaponItemDefinition* WeaponData; // 0x630 [Size: 0x8]
	FortWeaponItemDefinition* CosmeticOverrideWeaponData; // 0x638 [Size: 0x8]
	uint8_t pad_640[0xa0]; // 0x640
	uint8_t EquippedWeaponDestroyWrapperRepCounter; // 0x6e0 [Size: 0x1]
	uint8_t pad_6e1[0x7]; // 0x6e1
	enum EFortWeaponRuntimeFireMode FireModeOverride; // 0x6e8 [Size: 0x1]
	uint8_t pad_6e9[0x903]; // 0x6e9
	float LastFireTimeVerified; // 0xfec [Size: 0x4]
	uint8_t pad_ff0[0x10]; // 0xff0
	AnimMontage* BlendingOutPawnMontage; // 0x1000 [Size: 0x8]
	uint8_t pad_1008[0x78]; // 0x1008
	FGuid ItemEntryGuid; // 0x1080 [Size: 0x10]
	FGuid TrackerGuid; // 0x1090 [Size: 0x10]
	int WeaponLevel; // 0x10a0 [Size: 0x4]
	int AmmoCount; // 0x10a4 [Size: 0x4]
	int PhantomReserveAmmo; // 0x10a8 [Size: 0x4]
	uint8_t pad_10ac[0xdc]; // 0x10ac
	int16_t ChargeStatusPack; // 0x1188 [Size: 0x2]
	uint8_t pad_118a[0x3e]; // 0x118a
	FortGameplayAbility* ActiveAbility; // 0x11c8 [Size: 0x8]
	FGameplayAbilitySpecHandle PrimaryAbilitySpecHandle; // 0x11d0 [Size: 0x4]
	FGameplayAbilitySpecHandle SecondaryAbilitySpecHandle; // 0x11d4 [Size: 0x4]
	FGameplayAbilitySpecHandle ReloadAbilitySpecHandle; // 0x11d8 [Size: 0x4]
	FGameplayAbilitySpecHandle ImpactAbilitySpecHandle; // 0x11dc [Size: 0x4]
	FGameplayAbilitySpecHandle ReticleTraceOverrideSpecHandle; // 0x11e0 [Size: 0x4]
	uint8_t pad_11e4[0x24]; // 0x11e4
	TArray<FortAlterationItemDefinition*> AppliedAlterations; // 0x1208 [Size: 0x10]
	TArray<FortWeaponModSlot> WeaponModSlots; // 0x1218 [Size: 0x10]
};


struct FortWeaponPickaxeAthena
{
public:
	uint8_t pad_0[0x19d0]; // 0x0
	FortAthenaLoadout CosmeticData; // 0x19d0 [Size: 0x108]
	FortAthenaLoadoutReplicator CosmeticLoadoutReplicator; // 0x1ad8 [Size: 0x150]
};


struct FortWeaponPickaxeDualWieldAthena
{
public:
	uint8_t pad_0[0x1f68]; // 0x0
	enum EFortDualWieldDataSource CurrentWieldStance; // 0x1f68 [Size: 0x1]
};


struct FortWeaponRanged
{
public:
	uint8_t pad_0[0x1950]; // 0x0
	FWeaponCueReplicationStruct ReplayActivationCue; // 0x1950 [Size: 0xd8]
	FWeaponCueReplicationStruct ReplayImpactCue; // 0x1a28 [Size: 0xd8]
	uint8_t pad_1b00[0x27c]; // 0x1b00
	float LocalFireRateModification; // 0x1d7c [Size: 0x4]
	uint8_t pad_1d80[0x6c]; // 0x1d80
	bool bUseScopedThirdPersonTargeting : 1; // 0x1dec [Mask: 0x1] [Bit: 0]
	uint8_t pad_1ded[0x20]; // 0x1ded
	bool bUseOverrideBaseSpread : 1; // 0x1e0d [Mask: 0x40] [Bit: 6]
	bool bUseOverrideSpreadDownsightsMultiplier : 1; // 0x1e0d [Mask: 0x80] [Bit: 7]
	bool bIsMuzzleTraceNearWall : 1; // 0x1e0e [Mask: 0x4] [Bit: 2]
	uint8_t pad_1e0f[0x7b9]; // 0x1e0f
	enum EFortWeaponOverheatState OverheatState; // 0x25c8 [Size: 0x1]
	uint8_t pad_25c9[0x3]; // 0x25c9
	FOverheatSync OverheatSyncData; // 0x25cc [Size: 0xc]
	uint8_t pad_25d8[0x88]; // 0x25d8
	float TimeOverheatedBegan; // 0x2660 [Size: 0x4]
	float OverheatValueWhenVentingBegan; // 0x2664 [Size: 0x4]
	bool bIsManuallyVentingWeapon : 1; // 0x2668 [Mask: 0x1] [Bit: 0]
	uint8_t pad_2669[0x17]; // 0x2669
	FVector LWProjectile_DamageStart; // 0x2680 [Size: 0x18]
	FVector LWProjectile_DamageDirection; // 0x2698 [Size: 0x18]
};


struct FortWeaponRangedDual
{
public:
	uint8_t pad_0[0x28d0]; // 0x0
	enum EDualWeaponHand LastFireHand; // 0x28d0 [Size: 0x1]
};


struct FortWeaponRangedDualForVehicle
{
public:
	uint8_t pad_0[0x2a50]; // 0x0
	FMountedWeaponInfoRepped MountedWeaponInfoRepped; // 0x2a50 [Size: 0x48]
};


struct FortWeaponRangedDualSwing
{
public:
	uint8_t pad_0[0x29a0]; // 0x0
	Actor* RopeAttachPointActor; // 0x29a0 [Size: 0x8]
};


struct FortWeaponRangedForVehicle
{
public:
	uint8_t pad_0[0x2958]; // 0x0
	FMountedWeaponInfoRepped MountedWeaponInfoRepped; // 0x2958 [Size: 0x48]
};


struct FortWeaponRangedProxy
{
public:
	uint8_t pad_0[0x2858]; // 0x0
	FortPawn* HostPawn; // 0x2858 [Size: 0x8]
};


struct FortWeaponRangedTowHook
{
public:
	uint8_t pad_0[0x2858]; // 0x0
	FortPhysicsTowHook* TowHook; // 0x2858 [Size: 0x8]
};


struct FortWeaponRanged_Ostrich
{
public:
	uint8_t pad_0[0x29b0]; // 0x0
	bool bRocketsOnCooldown : 1; // 0x29b0 [Mask: 0x1] [Bit: 0]
};


struct FortWorldManager
{
public:
	uint8_t pad_0[0x2e8]; // 0x0
	FortWindIntensityAndDirection InitialGlobalWind; // 0x2e8 [Size: 0x8]
	uint8_t pad_2f0[0x648]; // 0x2f0
	int FinalNumChosenBuildingFoundations; // 0x938 [Size: 0x4]
	uint8_t pad_93c[0x4]; // 0x93c
	TArray<ABuildingFoundation*> ChosenBuildingFoundations; // 0x940 [Size: 0x10]
};


struct FortWorldSettings
{
public:
	uint8_t pad_0[0x884]; // 0x0
	bool bDisableAllTimeOfDayManagers : 1; // 0x884 [Mask: 0x2] [Bit: 1]
};


struct AInfiltrationCarryObjectCapturePoint
{
public:
	uint8_t pad_0[0x2b0]; // 0x0
	bool bCapturePointEnabled : 1; // 0x2b0 [Mask: 0x1] [Bit: 0]
};


struct AInfiltrationCarryObjectSpawnPoint
{
public:
	uint8_t pad_0[0x998]; // 0x0
	enum ESpawnPointState CurrentState; // 0x998 [Size: 0x1]
	uint8_t pad_999[0x4f]; // 0x999
	Actor* CachedIntelActor; // 0x9e8 [Size: 0x8]
};


struct AKeepItemContainer
{
public:
	uint8_t pad_0[0xd74]; // 0x0
	int HostUpgradeLevel; // 0xd74 [Size: 0x4]
	TArray<FortPlayerState*> SearchedBy; // 0xd78 [Size: 0x10]
	uint8_t pad_d88[0x38]; // 0xd88
	enum EFortRarity BestAvailableRarity; // 0xdc0 [Size: 0x1]
	uint8_t pad_dc1[0x3]; // 0xdc1
	int MaxItems; // 0xdc4 [Size: 0x4]
};


struct AObjectInteractionMode
{
public:
	uint8_t pad_0[0x270]; // 0x0
	UInteractionTargetDetection* BoundInteractionTargetDetection; // 0x270 [Size: 0x8]
	uint8_t pad_278[0x68]; // 0x278
	UDeleteObjects* BoundDeleteInteractBehavior; // 0x2e0 [Size: 0x8]
};


struct APhoneToolActorTargetMode
{
public:
	uint8_t pad_0[0x428]; // 0x0
	TArray<FOriginalAndSpawnedPair> NewlyPlacedActors; // 0x428 [Size: 0x10]
	uint8_t pad_438[0x10]; // 0x438
	TArray<FCreativeSelectedActorInfo> PlacementModeActorsReplicateToRemoteClients; // 0x448 [Size: 0x10]
	UObjectInteractionBehavior* ActiveBoundBehaviorReplicateToRemoteClients; // 0x458 [Size: 0x8]
	TArray<Actor*> DisableCollisionActors; // 0x460 [Size: 0x10]
	uint8_t pad_470[0x20]; // 0x470
	bool bClientNeedsToProcessNewlyPlacedActors : 1; // 0x490 [Mask: 0x1] [Bit: 0]
	uint8_t pad_491[0x7]; // 0x491
	FlashCountedActorInfo CutActors; // 0x498 [Size: 0x18]
};


struct APropertyOverrideDataReplChunkActor
{
public:
	uint8_t pad_0[0x270]; // 0x0
	uint8_t ChunkIndex; // 0x270 [Size: 0x1]
	uint8_t pad_271[0x7]; // 0x271
	FPropertyOverrideDataReplChunk PartialReplOverrides; // 0x278 [Size: 0x58]
};


struct ASimpleDestructiblePropGroup
{
public:
	uint8_t pad_0[0x308]; // 0x0
	TArray<FortBitArray> OrderedReplicatedInstanceData; // 0x308 [Size: 0x10]
	uint8_t pad_318[0x20]; // 0x318
	double DamageEventServerTimestamp; // 0x338 [Size: 0x8]
	uint8_t pad_340[0x70]; // 0x340
	TArray<FSimpleDestructiblePropDestructionData> PerInstanceReplicatedDestructionData; // 0x3b0 [Size: 0x10]
	uint8_t pad_3c0[0x10]; // 0x3c0
	bool bLastDamageEventFromFire : 1; // 0x3d0 [Mask: 0x1] [Bit: 0]
};


struct AWorldMapPin
{
public:
	uint8_t pad_0[0x278]; // 0x0
	bool bIsHomebaseMapPin : 1; // 0x278 [Mask: 0x1] [Bit: 0]
};


struct AWorldTileFoundation
{
public:
	uint8_t pad_0[0xf20]; // 0x0
	uint8_t NumRotations; // 0xf20 [Size: 0x1]
};


struct ActorComponent_ReplicatedParamHelper
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FRepParamFloatArray ParamFloatsArray; // 0xe0 [Size: 0x60]
	FRepParamIntegerArray ParamIntegersArray; // 0x140 [Size: 0x60]
	FRepParamBoolArray ParamBoolsArray; // 0x1a0 [Size: 0x60]
};


struct AthenaLocalCompassComponent
{
public:
	uint8_t pad_0[0x190]; // 0x0
	FCompassMarkHandleArray ActiveHandles; // 0x190 [Size: 0x58]
};


struct AthenaMarkerComponent
{
public:
	uint8_t pad_0[0x288]; // 0x0
	FortWorldMarkerContainer MarkerStream; // 0x288 [Size: 0x68]
};


struct AthenaResurrectionComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	TArray<UniqueNetIdRepl> PlayerIdsForResurrection; // 0xe8 [Size: 0x10]
	uint8_t pad_f8[0x58]; // 0xf8
	bool bIsActivelyRebooting : 1; // 0x150 [Mask: 0x1] [Bit: 0]
	bool bEnhancedResurrectionRequest : 1; // 0x151 [Mask: 0x1] [Bit: 0]
	uint8_t pad_152[0x1e]; // 0x152
	FCloneMachineRepData CloneMachineRepData; // 0x170 [Size: 0x20]
};


struct UBuildingSMOverridesComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<UMaterialInterface*> OverrideMeshMaterials; // 0xc0 [Size: 0x10]
};


struct UBuildingTurretComponent
{
public:
	uint8_t pad_0[0xf0]; // 0x0
	Actor* CurrentTarget; // 0xf0 [Size: 0x8]
};


struct UCaptureComponent
{
public:
	uint8_t pad_0[0x2a3]; // 0x0
	uint8_t StateOwner; // 0x2a3 [Size: 0x1]
	uint8_t OwningTeam; // 0x2a4 [Size: 0x1]
	enum ECaptureState CaptureState; // 0x2a5 [Size: 0x1]
	uint8_t pad_2a6[0x2]; // 0x2a6
	float CaptureProgress; // 0x2a8 [Size: 0x4]
	enum ESmoothProgressState SmoothProgressState; // 0x2ac [Size: 0x1]
};


struct UCobaltPlayerComponent
{
public:
	uint8_t pad_0[0xe4]; // 0x0
	FortAthenaMutator_Cobalt* CachedMutator; // 0xe4 [Size: 0x8]
};


struct UCombatManagerComponentSTW
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	float ReplicatedCombatEventHeat; // 0xc8 [Size: 0x70]
	uint8_t pad_138[0xa0]; // 0x138
	float CurrentTotalHeat; // 0x1d8 [Size: 0x4]
	float MaximumTotalHeat; // 0x1dc [Size: 0x4]
	float MaxHeatEver; // 0x1e0 [Size: 0x4]
};


struct UControllerComponent_RandomizedLoadout
{
public:
	uint8_t pad_0[0xc8]; // 0x0
	FCosmeticLoadout RandomizedCosmeticLoadout; // 0xc8 [Size: 0x18]
};


struct UCreativeMiniMapComponent
{
public:
	uint8_t pad_0[0x210]; // 0x0
	FortMiniMapIndicatorTextProperties IndicatorTextProperties; // 0x210 [Size: 0x78]
	uint8_t pad_288[0x10]; // 0x288
	FCreativeMiniMapComponentIconData IconData; // 0x298 [Size: 0x50]
};


struct UCreativeMoveToolStateComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bPreview : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
};


struct UCreativePlayerHealthInfoComponent
{
public:
	uint8_t pad_0[0xf8]; // 0x0
	FortPlayerStateAthena* BossPlayerState; // 0xf8 [Size: 0x8]
};


struct UCreativePowerBarComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float StartTime; // 0xc0 [Size: 0x4]
	bool bLoop : 1; // 0xc4 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c5[0x3]; // 0xc5
	UCurveFloat* PowerCurve; // 0xc8 [Size: 0x8]
};


struct UCreativeQuestComponent
{
public:
	uint8_t pad_0[0xe8]; // 0x0
	enum ECreativeQuestStat StatToTrack; // 0xe8 [Size: 0x1]
	enum ECreativeQuestSharing SharingMode; // 0xe9 [Size: 0x1]
	bool bResetBetweenRounds : 1; // 0xea [Mask: 0x1] [Bit: 0]
	uint8_t pad_eb[0x1]; // 0xeb
	int TargetTeam; // 0xec [Size: 0x4]
	int TargetClass; // 0xf0 [Size: 0x4]
	int AssignedToTeam; // 0xf4 [Size: 0x4]
	enum EDeathCause TargetDeathCause; // 0xf8 [Size: 0x1]
	bool bSelfEliminationsCount : 1; // 0xf9 [Mask: 0x1] [Bit: 0]
	bool bHeadshotsOnly : 1; // 0xfa [Mask: 0x1] [Bit: 0]
	bool bPlayerEliminationsCount : 1; // 0xfb [Mask: 0x1] [Bit: 0]
	bool bNonPlayerEliminationsCount : 1; // 0xfc [Mask: 0x1] [Bit: 0]
	bool bSelfDamageCount : 1; // 0xfd [Mask: 0x1] [Bit: 0]
	bool bPlayerDamageCount : 1; // 0xfe [Mask: 0x1] [Bit: 0]
	bool bNonPlayerDamageCount : 1; // 0xff [Mask: 0x1] [Bit: 0]
	uint8_t pad_100[0x20]; // 0x100
	int MinigameTargetAmount; // 0x120 [Size: 0x4]
	enum EShowOnHudMode ShowQuestOnHUD; // 0x124 [Size: 0x1]
	enum EShowProgressMode ShowProgressMode; // 0x125 [Size: 0x1]
	bool bShowCompleteEffects : 1; // 0x126 [Mask: 0x1] [Bit: 0]
	uint8_t pad_127[0x1]; // 0x127
	UTexture2D* QuestIconImage; // 0x128 [Size: 0x20]
	FLinearColor QuestColor; // 0x148 [Size: 0x10]
	TArray<FCreativeQuestData> QuestIndividualData; // 0x158 [Size: 0x10]
	TArray<int> QuestTeamProgress; // 0x168 [Size: 0x10]
	int QuestAllProgress; // 0x178 [Size: 0x4]
	int QuestInitialProgress; // 0x17c [Size: 0x4]
};


struct UCreativeRegisteredPlayersManagerComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	TArray<FortPlayerState*> RegisteredPlayers; // 0x100 [Size: 0x10]
};


struct UDestinationTrackerPawnComponent
{
public:
	uint8_t pad_0[0xd8]; // 0x0
	FVector Destination; // 0xd8 [Size: 0x18]
};


struct FNEAIBotComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bIsSpawningBotsForMinigameStart : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c1[0xf]; // 0xc1
	bool bVolumeNavigationHasBuilt : 1; // 0xd0 [Mask: 0x1] [Bit: 0]
};


struct FNEClassComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<FMinigameClassSlot> ClassSlotArray; // 0xc0 [Size: 0x10]
};


struct FNEPersistenceManagerComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	int PersistenceRequiredDevices; // 0xc0 [Size: 0x4]
};


struct FNEPlayerComponent
{
public:
	uint8_t pad_0[0xe0]; // 0x0
	FortPlayerStartCreative* ClaimedPlayerStart; // 0xe0 [Size: 0x8]
	bool bCanClaimedStartBeOverridden : 1; // 0xe8 [Mask: 0x1] [Bit: 0]
	bool bPreparingForRespawn : 1; // 0xe9 [Mask: 0x1] [Bit: 0]
	uint8_t ClassSlotIndex; // 0xea [Size: 0x1]
	uint8_t pad_eb[0x1]; // 0xeb
	FName MinigameClassScope; // 0xec [Size: 0x4]
	uint8_t pad_f0[0x4]; // 0xf0
	uint8_t LastPlayerTeam; // 0xf4 [Size: 0x1]
	uint8_t pad_f5[0x3]; // 0xf5
	FortPlayerState* PlayerState; // 0xf8 [Size: 0x8]
	uint8_t pad_100[0xc8]; // 0x100
	UniqueNetIdRepl UniquePlayerId; // 0x1c8 [Size: 0x30]
	bool bHasValidResetData : 1; // 0x1f8 [Mask: 0x1] [Bit: 0]
	uint8_t TeamBeforeMinigameStarted; // 0x1f9 [Size: 0x1]
	uint8_t pad_1fa[0x6]; // 0x1fa
	FVector LocationBeforeMinigameStarted; // 0x200 [Size: 0x18]
	FRotator RotationBeforeMinigameStarted; // 0x218 [Size: 0x18]
	bool bIsLocationBeforeGameStartedBlocked : 1; // 0x230 [Mask: 0x1] [Bit: 0]
	bool bWasSkydivingBeforeMinigameStarted : 1; // 0x231 [Mask: 0x1] [Bit: 0]
	bool bWasFlyingBeforeMinigameStarted : 1; // 0x232 [Mask: 0x1] [Bit: 0]
	uint8_t pad_233[0x5]; // 0x233
	TArray<FMinigamePlayerTeamClassSlotPair> TeamAndClassSlotHistory; // 0x238 [Size: 0x10]
	FString PlayerName; // 0x248 [Size: 0x10]
	uint8_t pad_258[0x10]; // 0x258
	bool bIsTeleportingOrRespawningForGameplay : 1; // 0x268 [Mask: 0x1] [Bit: 0]
	bool bLeftMatchDuringPreGame : 1; // 0x269 [Mask: 0x1] [Bit: 0]
	uint8_t pad_26a[0x6]; // 0x26a
	bool bIsWaitingForPersistence : 1; // 0x270 [Mask: 0x1] [Bit: 0]
};


struct FNEUIComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	enum EMinigameFullscreenMapWidgetType MinigameMapWidget; // 0xc0 [Size: 0x1]
	bool bShowMapWidget : 1; // 0xc1 [Mask: 0x1] [Bit: 0]
	bool bAllowTeamIndicators : 1; // 0xc2 [Mask: 0x1] [Bit: 0]
	bool bShowPreGameCountdownBars : 1; // 0xc3 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c4[0x4c]; // 0xc4
	bool bPipHudAdEnabled : 1; // 0x110 [Mask: 0x1] [Bit: 0]
	uint8_t pad_111[0x47]; // 0x111
	FGameplayTagContainer UIExtensionTags; // 0x158 [Size: 0x20]
};


struct FortAFKComponent
{
public:
	uint8_t pad_0[0x110]; // 0x0
	bool bIsAFKWarningActive : 1; // 0x110 [Mask: 0x1] [Bit: 0]
	bool bIsConfirmedAFK : 1; // 0x111 [Mask: 0x1] [Bit: 0]
	uint8_t pad_112[0x2]; // 0x112
	int NumTimesPlayerWentAFK; // 0x114 [Size: 0x4]
};


struct FortAIPawnIrisSharedRepMovement
{
public:
	uint8_t pad_0[0x28]; // 0x0
	FortAISharedRepMovement AISharedRepMovement; // 0x28 [Size: 0x108]
};


struct FortAbilitySystemComponent
{
public:
	uint8_t pad_0[0xba8]; // 0x0
	FReplicatedMontagePair LandingMontagePair; // 0xba8 [Size: 0x20]
	uint8_t pad_bc8[0x10]; // 0xbc8
	FGameplayAbilityRepSharedAnim RepSharedAnimInfo; // 0xbd8 [Size: 0x10]
};


struct FortAbilityTask_ApplyRootMotionFallingBoostForce
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float VerticalImpulse; // 0xc0 [Size: 0x4]
	float duration; // 0xc4 [Size: 0x4]
	float GravityScalar; // 0xc8 [Size: 0x4]
	float MaxAcceleration; // 0xcc [Size: 0x4]
	float LateralFriction; // 0xd0 [Size: 0x4]
	float MaxLateralSpeed; // 0xd4 [Size: 0x4]
};


struct FortAbilityTask_ApplyRootMotionFollowCharacterRotation
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	float Strength; // 0xc0 [Size: 0x4]
	float duration; // 0xc4 [Size: 0x4]
	bool bIsAdditive : 1; // 0xc8 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c9[0x7]; // 0xc9
	UCurveFloat* StrengthOverTime; // 0xd0 [Size: 0x8]
	bool bEnableGravity : 1; // 0xd8 [Mask: 0x1] [Bit: 0]
};


struct FortAbilityTask_ApplyRootMotion_DashForce
{
public:
	uint8_t pad_0[0x118]; // 0x0
	float HeightAboveGround; // 0x118 [Size: 0x4]
};


struct FortActorComponent_Affiliation
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bHasSpecificRelations : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c1[0x33]; // 0xc1
	uint32_t AffiliationUID; // 0xf4 [Size: 0x4]
	FGameplayTagContainer CurrentFactions; // 0xf8 [Size: 0x20]
	uint8_t pad_118[0x30]; // 0x118
	FortAffiliationComponentSpecificRelations SpecificRelations; // 0x148 [Size: 0x60]
};


struct FortActorComponent_DamageabilityExtension
{
public:
	uint8_t pad_0[0x228]; // 0x0
	FortHealthSet* ReplicatedHealthAttributeSet; // 0x228 [Size: 0x8]
	FortAbilitySystemComponent* ReplicatedAbilitySystemComponent; // 0x230 [Size: 0x8]
	bool bInstantDeath : 1; // 0x238 [Mask: 0x1] [Bit: 0]
	bool bDestroyed : 1; // 0x238 [Mask: 0x2] [Bit: 1]
};


struct FortActorComponent_FortDeathExtension
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bShouldDeferDeath : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
	bool bDeferringDeath : 1; // 0xc0 [Mask: 0x2] [Bit: 1]
};


struct FortActorComponent_FortInteractExtension
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	TArray<Actor*> AllowedActorsForInteraction; // 0xc0 [Size: 0x10]
};


struct FortActorComponent_MultiInteract
{
public:
	uint8_t pad_0[0xd4]; // 0x0
	FMultiInteractServerTimeData ServerInteractionData; // 0xd4 [Size: 0xc]
	uint8_t pad_e0[0xd]; // 0xe0
	bool bAllowGradualReset : 1; // 0xed [Mask: 0x1] [Bit: 0]
	bool bEndClientLerpWhenDone : 1; // 0xee [Mask: 0x1] [Bit: 0]
	uint8_t pad_ef[0x51]; // 0xef
	FScalableFloat GradualCounterMultiplier; // 0x140 [Size: 0x28]
	uint8_t pad_168[0x8]; // 0x168
	FScalableFloat BaseInterpSpeed; // 0x170 [Size: 0x28]
	uint8_t pad_198[0x8]; // 0x198
	TArray<FortPlayerStateAthena*> InteractingPlayers; // 0x1a0 [Size: 0x10]
	uint8_t pad_1b0[0x10]; // 0x1b0
	int InteractingNonPlayerActorCount; // 0x1c0 [Size: 0x4]
	uint8_t pad_1c4[0x18]; // 0x1c4
	float CachedInterpSpeed; // 0x1dc [Size: 0x4]
};


struct FortActorComponent_ToggleState
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	bool bIsToggledOn : 1; // 0xd0 [Mask: 0x1] [Bit: 0]
};


struct FortActorOptionsComponent
{
public:
	uint8_t pad_0[0x130]; // 0x0
	FPropertyOverrideData PlayerOptionData; // 0x130 [Size: 0x50]
};


struct FortAdvancedMeleeComponent
{
public:
	uint8_t pad_0[0x150]; // 0x0
	TArray<FGameplayAbilitySpecHandle> FightListHandles; // 0x150 [Size: 0x10]
};


struct FortAdvancedMovementSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData GroundFriction; // 0x30 [Size: 0x28]
	FortGameplayAttributeData BrakingDecelerationWalking; // 0x58 [Size: 0x28]
	FortGameplayAttributeData BrakingDecelerationFalling; // 0x80 [Size: 0x28]
	FortGameplayAttributeData BrakingDecelerationFlying; // 0xa8 [Size: 0x28]
	FortGameplayAttributeData MaxAcceleration; // 0xd0 [Size: 0x28]
	FortGameplayAttributeData MaxAccelerationFlying; // 0xf8 [Size: 0x28]
	FortGameplayAttributeData BrakingFrictionFactor; // 0x120 [Size: 0x28]
	FortGameplayAttributeData JumpZVelocity; // 0x148 [Size: 0x28]
	FortGameplayAttributeData JumpHorizontalAccelerationOverride; // 0x170 [Size: 0x28]
	FortGameplayAttributeData JumpHorizontalVelocityOverride; // 0x198 [Size: 0x28]
	FortGameplayAttributeData MinAnalogWalkSpeed; // 0x1c0 [Size: 0x28]
	FortGameplayAttributeData AirControlMultiplier; // 0x1e8 [Size: 0x28]
	FortGameplayAttributeData SlipperyMovementMaxLateralSpeedOverride; // 0x210 [Size: 0x28]
	FortGameplayAttributeData SlipperyMovementMaxVerticalLaunchSpeedOverride; // 0x238 [Size: 0x28]
};


struct FortAttachableProjectileComponent
{
public:
	uint8_t pad_0[0x100]; // 0x0
	FReplicatedAttachParams AttachParams; // 0x100 [Size: 0x140]
};


struct FortAttributeSet_VehicleFuel
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData Fuel; // 0x30 [Size: 0x28]
	FortGameplayAttributeData FuelTankCapacity; // 0x58 [Size: 0x28]
	FortGameplayAttributeData FuelPerSecondIdle; // 0x80 [Size: 0x28]
	FortGameplayAttributeData FuelPerSecondDriving; // 0xa8 [Size: 0x28]
	FortGameplayAttributeData FuelPerSecondBoosting; // 0xd0 [Size: 0x28]
	FortGameplayAttributeData MinFuelAtSpawn; // 0xf8 [Size: 0x28]
	FortGameplayAttributeData MaxFuelAtSpawn; // 0x120 [Size: 0x28]
};


struct FortBuildingActorSet
{
public:
	uint8_t pad_0[0x670]; // 0x0
	FortGameplayAttributeData BuildTime; // 0x670 [Size: 0x28]
	FortGameplayAttributeData RepairTime; // 0x698 [Size: 0x28]
};


struct FortBuildingEnergyComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortBuildingEnergyComponentAttrSet* EnergyComponentAttrSet; // 0xc0 [Size: 0x8]
};


struct FortBuildingEnergyComponentAttrSet
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData CurrentEnergyLevel; // 0x48 [Size: 0x28]
	uint8_t pad_70[0x28]; // 0x70
	FortGameplayAttributeData EnergyCost; // 0x98 [Size: 0x28]
	uint8_t pad_c0[0x28]; // 0xc0
	FortGameplayAttributeData EnergyCapacity; // 0xe8 [Size: 0x28]
};


struct FortBuildingSMActorRepProxyComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FMinimalGameplayCueReplicationProxy SimulatedProxyActiveGameplayCues; // 0xc0 [Size: 0x2c0]
};


struct FortBuildingSkelMeshSetupComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	USkeletalMesh* SkeletalMesh; // 0xc0 [Size: 0x8]
};


struct FortBuildingTrapSet
{
public:
	uint8_t pad_0[0x6c0]; // 0x0
	FortGameplayAttributeData Durability; // 0x6c0 [Size: 0x28]
	FortGameplayAttributeData MaxDurability; // 0x6e8 [Size: 0x28]
	FortGameplayAttributeData DurabilityCostPerFire; // 0x710 [Size: 0x28]
	FortGameplayAttributeData ArmTime; // 0x738 [Size: 0x28]
	FortGameplayAttributeData ReloadTime; // 0x760 [Size: 0x28]
};


struct FortBuildingWallDoorComponent
{
public:
	uint8_t pad_0[0x690]; // 0x0
	APlayerState* LastDoorOpenerState; // 0x690 [Size: 0x8]
	FRotator3f DoorDesiredRotation; // 0x698 [Size: 0xc]
	FVector3f DoorDesiredLocation; // 0x6a4 [Size: 0xc]
	FRotator3f DoorDesiredRotOffset; // 0x6b0 [Size: 0xc]
};


struct FortCameraModeOverrideComponent
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	FortCameraMode* CameraModeOverride; // 0xc0 [Size: 0x8]
};


struct FortCameraPOIFraming
{
public:
	uint8_t pad_0[0xc0]; // 0x0
	bool bOtherPlayers : 1; // 0xc0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_c1[0x3]; // 0xc1
	float OtherPlayerMaxRadialAngleInDegrees; // 0xc4 [Size: 0x4]
	float InterpolationSharpness; // 0xc8 [Size: 0x4]
	float OwnPlayerWeight; // 0xcc [Size: 0x4]
	float OtherPlayerWeight; // 0xd0 [Size: 0x4]
	float OtherPlayerTrackingDropoffAngleInDegrees; // 0xd4 [Size: 0x4]
	float OtherPlayerTrackingDropoffDistance; // 0xd8 [Size: 0x4]
	float POIInterpTime; // 0xdc [Size: 0x4]
	float DecayInterpTime; // 0xe0 [Size: 0x4]
};


struct FortCameraPOIFramingLookAtOffset
{
public:
	uint8_t pad_0[0x170]; // 0x0
	float InterpThreshold; // 0x170 [Size: 0x4]
};


struct FortCameraPOIFramingZoomToFit
{
public:
	uint8_t pad_0[0x108]; // 0x0
	float MaxZoomOffset; // 0x108 [Size: 0x4]
};


struct FortCharacterAttrSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData Fortitude; // 0x30 [Size: 0x28]
	FortGameplayAttributeData Offense; // 0x58 [Size: 0x28]
	FortGameplayAttributeData Tech; // 0x80 [Size: 0x28]
	FortGameplayAttributeData Resistance; // 0xa8 [Size: 0x28]
	FortGameplayAttributeData MaxCharacterLevel; // 0xd0 [Size: 0x28]
};


struct FortCharacterPartsComponent
{
public:
	uint8_t pad_0[0x120]; // 0x0
	TArray<UCustomCharacterPart*> CharacterPartList; // 0x120 [Size: 0x10]
};


struct FortChargingSet_AirbagSuit
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_Banner
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_CardboardBox
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_ChugCannon
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_Disguise
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_HealGun
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_Kaboom
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_Scanner
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortChargingSet_SneakySnow
{
public:
	uint8_t pad_0[0x48]; // 0x0
	FortGameplayAttributeData Charge; // 0x48 [Size: 0x28]
	FortGameplayAttributeData MaxCharge; // 0x70 [Size: 0x28]
	FortGameplayAttributeData ChargeRate; // 0x98 [Size: 0x28]
	FortGameplayAttributeData ServerTimeChargeIncrements; // 0xc0 [Size: 0x28]
};


struct FortClassTrackerComponent
{
public:
	uint8_t pad_0[0xd0]; // 0x0
	bool bEnabled : 1; // 0xd0 [Mask: 0x1] [Bit: 0]
	uint8_t pad_d1[0x7]; // 0xd1
	FortCreativeClassInstanceTracker ClassTracker; // 0xd8 [Size: 0x50]
	FGameplayTagContainer ExcludeActorTags; // 0x128 [Size: 0x20]
};


struct FortConstructionSet
{
public:
	uint8_t pad_0[0x30]; // 0x0
	FortGameplayAttributeData BuildSpeed; // 0x30 [Size: 0x28]
	FortGameplayAttributeData RepairSpeed; // 0x58 [Size: 0x28]
	FortGameplayAttributeData BuildCost; // 0x80 [Size: 0x28]
	FortGameplayAttributeData RepairCost; // 0xa8 [Size: 0x28]
	FortGameplayAttributeData MaxBuildLevel; // 0xd0 [Size: 0x28]
	FortGameplayAttributeData BuildingSkill; // 0xf8 [Size: 0x28]
	FortGameplayAttributeData TrapArmSpeed; // 0x120 [Size: 0x28]
	FortGameplayAttributeData TrapReloadSpeed; // 0x148 [Size: 0x28]
	FortGameplayAttributeData TrapBaseDamage; // 0x170 [Size: 0x28]
	FortGameplayAttributeData TrapMaxDurability; // 0x198 [Size: 0x28]
	FortGameplayAttributeData TrapDiceCritChance; // 0x1c0 [Size: 0x28]
	FortGameplayAttributeData TrapDiceCritMultiplier; // 0x1e8 [Size: 0x28]
	FortGameplayAttributeData TrapHealingSource; // 0x210 [Size: 0x28]
};


struct FortControlResistanceSet
{
public:
	uint8_t pad_0[0x38]; // 0x0
	FortGameplayAttributeData ControlResistance; // 0x38 [Size: 0x28]
	FortGameplayAttributeData MaxControlResistance; // 0x60 [Size: 0x28]
	FortGameplayAttributeData ControlResistanceRegenRate; // 0x88 [Size: 0x28]
	FortGameplayAttributeData ControlResistanceRegenDelay; // 0xb0 [Size: 0x28]
	FortGameplayAttributeData ControlResistanceRegenThreshold; // 0xd8 [Size: 0x28]
	FortGameplayAttributeData KnockbackThreshold; // 0x100 [Size: 0x28]
	FortGameplayAttributeData KnockbackMultiplier; // 0x128 [Size: 0x28]
	FortGameplayAttributeData ImpactDamageResistance; // 0x150 [Size: 0x28]
	FortGameplayAttributeData BlockingImpactDamageResistance; // 0x178 [Size: 0x28]
	FortGameplayAttributeData ImpactDamageMultiplier; // 0x1a0 [Size: 0x28]
};


struct FortControllerComponent_AdHocSquads
{
public:
	uint8_t pad_0[0x168]; // 0x0
	FortAthenaMutator_AdHocSquads* AdHocSquadsMutator; // 0x168 [Size: 0x8]
	uint8_t pad_170[0x20]; // 0x170
	bool bIsInAdHocSquad : 1; // 0x190 [Mask: 0x1] [Bit: 0]
};


struct FortControllerComponent_CosmeticLoadout
{
public:
	uint8_t pad_0[0xd0]; // 0x0
